[
  {
    "date": "2024-08-10T04:00:05Z",
    "img": "https://smartcdn.gprod.postmedia.digital/winnipegsun/wp-content/uploads/2024/08/chy160_100258-the-canadian-press.jpg",
    "title": "Canada’s Gabriela Dabrowski, partner Erin Routliffe advance to NBO doubles quarters",
    "content": " Leylah Fernandez of Laval, Que., who was upset in singles play Thursday as the last Canadian remaining on either bracket, and younger sister Bianca are also in the quarters.\nStearns and Linette, who came back from 4-1 down in the first set, beat Dabrowski and Routliffe — the top seeds in Toronto — at the China Open earlier this year.\n“I’m proud of how we fought through,” Dabrowski said of Friday’s match in windy conditions in Toronto’s north end. “It wasn’t an easy one.”\nDabrowski and Montreal’s Felix Auger-Aliassime captured the country’s first Olympic tennis medal in 24 years at the Paris Games [...]",
    "source_url": "https://winnipegsun.com/pmn/canadas-gabriela-dabrowski-partner-erin-routliffe-advance-to-nbo-doubles-quarters",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Gabriela Dabrowski; Erin Routliffe; NBO; Leylah Fernandez of Laval; Que; Bianca; Dabrowski; Routliffe; China Open; Felix Auger; Aliassime; Olympic; Paris Games; Roland Garros; Daniel Nestor; Sebastien Lareau; Australia; Todd Woodbridge; Mark Woodforde; Sydney Games; Olympics; Felix; Luisa Stefani of Brazil; New Zealand"
  },
  {
    "date": "2024-08-10T03:01:06Z",
    "img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/08/Donald-Trump-points-1.jpg",
    "title": "Iran seems to be trying to influence U.S. election with increased cyber activity: Microsoft",
    "content": " One fake news site that lends itself to a left-leaning audience insults Trump by calling him “raving mad” and suggests he uses drugs, the report said. Another site meant to appeal to Republican readers centers on LGBTQ issues and gender-affirming surgery.\nA third example Microsoft cited found that Iranian groups are impersonating U.S. activists, potentially laying the groundwork for influence operations closer to the election.\nAdvertisement 5\nArticle content\nThe Microsoft report said that as Iran escalates its cyber influence, Russia-linked actors also have pivoted their influence campaigns to focus on the U.S. election, while actors linked to the Chinese Communist Party have taken [...]",
    "source_url": "https://nationalpost.com/news/world/iran-trying-to-influence-us-election",
    "source_name": "nationalpost",
    "category": "Top Stories",
    "keywords": "Iran; Microsoft One; Trump; Republican; LGBTQ; Microsoft; Iranian; Russia; Chinese Communist Party; Palestinian; AI; America; China; Tehran; Israel; Director of National Intelligence Avril Haines; American; Hamas; Gaza; Democratic"
  },
  {
    "date": "2024-08-10T07:29:11Z",
    "img": "https://i.cbc.ca/1.7289833.1723209119!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/oly-canoe-20240809.JPG",
    "title": "Watch Canadians compete in Olympic canoe & kayak finals",
    "content": " Canadian kayakers Riley Melanson, of Dartmouth, N.S., and Michelle Russell, Fall River, N.S., will both look to race their way to the final of that event, which is set for 7 a.m. ET.\nAt 5:40 a.m. ET, Katie Vincent, of Mississauga, Ont., and Sophia Jensen, of Chelsea, Que., both race in the canoe sprint women s C1 200-metre semifinals.\nThat final is slated to begin at 7:40 a.m. ET.\nVincent already has one medal from the Paris Games, teaming up with Sloan MacKenzie, of Windsor Junction, N.S., to claim bronze in the women s doubles 500m sprint canoe final on Friday.\n21 hours ago\nDuration 6:20\nSloan MacKenzie of Windsor Junction, N.S., and Katie Vincent of Mississauga, [...]",
    "source_url": "https://www.cbc.ca/sports/olympics/summer/canoe-kayak/womens-canoe-sprint-august-10-1.7290907?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Watch Canadians; Olympic; Riley Melanson; Michelle Russell; Fall River; Katie Vincent; Mississauga; Ont; Sophia Jensen; Chelsea; Que; Vincent; Paris Games; Sloan MacKenzie; Windsor Junction; Sloan MacKenzie of Windsor Junction; Katie Vincent of Mississauga; Paris"
  },
  {
    "date": "2024-08-10T04:21:04Z",
    "img": "",
    "title": "North Korean leader says thousands of flood victims will be brought to capital for temporary care",
    "content": " Traditional allies Russia and China, as well as international aid groups, have offered to provide North Korea with relief supplies, but the North hasn’t publicly expressed a desire to receive them.\n“Expressing thanks to various foreign countries and international organizations for their offer of humanitarian support, (Kim) said what we regard as the best in all realms and processes of state affairs is the firm trust in the people and the way of tackling problems thoroughly based on self-reliance,” KCNA said.\nKim made similar comments earlier in the week after Russian President Vladimir Putin offered help, expressing his gratitude but saying that [...]",
    "source_url": "https://winnipegsun.com/pmn/north-korean-leader-says-thousands-of-flood-victims-will-be-brought-to-capital-for-temporary-care",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "North Korean; Russia; China; North Korea; North; Expressing; Kim; Russian President Vladimir Putin; Moscow; South Korea; South; United States; Japan; COVID; Some South Korean"
  },
  {
    "date": "2024-08-10T03:46:15Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2020/06/73549502-shawchairtyclassicfinal005-w.jpg",
    "title": "Golf champs Leonard, Weekley, Short finalize field for Rogers Charity Classic",
    "content": " The Texan, whose 12 victories on the PGA Tour included the 1997 British Open and 1998 Players Championship, is a three-time member of the United States Ryder Cup Team. In addition to his British Open triumph, Leonard may be most remembered for his memorable 45-foot birdie putt on the 17th hole of the 1999 Ryder Cup in Brookline, Mass., that capped off a remarkable comeback victory for the red, white and blue on the final day.\nWeekley is set to make his second-straight trip to Calgary next week. A three-time winner on the PGA Tour, he is one of the most [...]",
    "source_url": "https://calgaryherald.com/sports/golf-champs-leonard-weekley-short-finalize-field-for-rogers-charity-classic",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Leonard; Weekley; Rogers Charity Classic the Texan; PGA Tour; British Open; Players Championship; United States Ryder Cup Team; Ryder Cup; Brookline; PGA TOUR Champions; Short Jr; Ken Duke; Jerry Kelly; Doug Barron; Scott McCarron; Jeff Maggert; Charles Schwab Cup Standings; World Golf Hall of Fame; Ernie Els; Padraig Harrington; Vijay Singh; PGA TOUR; Team Rogers; Mike Weir; Darren Clarke; John Daly; David Duval; Tom Lehman; David Toms; Stephen Ames; Ames; Charles Schwab Cup Money Standings; Steve Blake; Blake; Rogers; Van Kesteren"
  },
  {
    "date": "2024-08-10T08:48:09Z",
    "img": "https://i.cbc.ca/1.7291156.1723278834!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/levins-cam-220717-1180.jpg",
    "title": "Cam Levins 36th, Canadian teammate Rory Linkletter 47th on hilly Paris Olympic course",
    "content": " Cam Levins of Black Creek, B.C., made a late push on a hilly Olympic marathon course and placed 36th in two hours 11 minutes 56 seconds on Saturday in Paris.\nCam Levins of Black Creek, B.C., was 36th in the men s marathon on Saturday at the Paris Olympics, finishing the 42.2 km race in two hours 11 minutes 56 seconds. (Christian Petersen/Getty Images/File)\nCam Levins of Black Creek, B.C., made a late push on a hilly Olympic marathon course in Paris and placed 36th in the men s race on Sunday.\nThe three-time Olympian covered 42.2 kilometres in two hours 11 minutes 56 seconds.\nLevins, [...]",
    "source_url": "https://www.cbc.ca/sports/olympics/summer/athletics/levins-linkletter-marathon-men-paris-olympics-recap-1.7291146?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Cam Levins; Rory Linkletter; Paris Olympic; Cam Levins of Black Creek; Olympic; Paris; Paris Olympics; Christian Petersen; Olympian; Levins; Tamirat Tola of Ethiopia; Belgium; Bashir Abdi; Kenya; Benson Kipruto; Arizona; Malindi Elmore; Kelowna"
  },
  {
    "date": "2024-08-10T04:31:14Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/08/calgarysurgevancouverbandits-2.jpg",
    "title": "Surge fall short in CEBL semifinal after wild finish in Montreal",
    "content": " The import forward set a franchise single-game playoff scoring record with the game-high performance, as he helped the Bandits advance to their second-ever championship final appearance — that coming Sunday (4 p.m., TSN2) against the Niagara River Lions, after they dispatched the host Montreal Alliance 78-75 in the Eastern Conference final later Friday.\nMeanwhile, the Surge’s season ends.\n“Despite the loss, our players and coaches showed the entire country the values that bind our team and our city together — passion, resilience and joy,” said Surge vice-chairman/president Jason Ribeiro. “On behalf of our entire organization, thank you so much to all our [...]",
    "source_url": "https://calgaryherald.com/sports/surge-fall-short-in-cebl-semifinal-after-wild-finish-in-montreal",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "CEBL; Bandits; Niagara River Lions; Montreal Alliance; Eastern Conference; Jason Ribeiro; Helping Creek; MVP TazM Moore; Nick Ward; Kyle Julius; Zach; Koby McEwen; Davis; Behind Davis; Malcolm Duvivier; Miller; Moore; Justin Jackson; Creek"
  },
  {
    "date": "2024-08-10T04:26:04Z",
    "img": "",
    "title": "US Coast Guard Academy works to change its culture following sexual abuse and harassment scandal",
    "content": " Shannon Norenberg, a former sexual assault response coordinator at the academy who resigned in June and turned whistleblower, said 20-year-old cadets training and having power over swabs a couple years younger, with minimal supervision, was an issue she raised during last year’s review that the commandant ordered following the revelations of Operation Fouled Anchor.\n“Sometimes the cadets just are not mature enough to handle that role of being in charge and they go too far” and get personal, such as making comments about a swab’s intelligence or appearance, said Norenberg, who has since rescinded her resignation and is trying to return [...]",
    "source_url": "https://winnipegsun.com/pmn/us-coast-guard-academy-works-to-change-its-culture-following-sexual-abuse-and-harassment-scandal",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "US Coast Guard Academy; Shannon Norenberg; Operation Fouled Anchor; Instead; Training Center Cape May; New Jersey; Coast Guard; Oliva Spada; Long Island; New York; Kimberly McLear; Right the Ship Coalition; Academy; Krystyn Pecora; Class Gabriella Kraus"
  },
  {
    "date": "2024-08-10T08:03:04Z",
    "img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/08/2166052398.jpg",
    "title": "Breaking at the Olympics gets off to an … interesting … start with Australia’s Raygun",
    "content": " At 36, the university professor has a PhD in Cultural Studies from Macquarie University and focuses her research on the culture of hip hop, according to CNBC.\n“In 2023, many of my students didn’t believe me when I told them I was training to qualify for the Olympics, and were shocked when they checked Google and saw that I qualified,” she told the news organization.\nAustralia’s Rachael Gunn, known as Raygun competes in the Women’s Breaking dance Round robin of the Paris 2024 Olympics Photo by ODD ANDERSEN /AFP via Getty Images\nHowever, as expected in These Times, she quickly became a meme [...]",
    "source_url": "https://nationalpost.com/sports/olympics/breakdancing-olympics-2024-raygun-australia",
    "source_name": "nationalpost",
    "category": "Top Stories",
    "keywords": "Olympics; Australia; Raygun At; Cultural Studies; Macquarie University; Google; Rachael Gunn; Raygun; Paris; Olympics Photo; ODD ANDERSEN; Getty Images However; These Times; Olympians; Creativity; Los Angeles; Olympic; Summer Youth Olympic Games"
  },
  {
    "date": "2024-08-10T07:12:02Z",
    "img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/06/CP171758521-1.jpg",
    "title": "Conservative government would put 100 per cent tariff on Chinese EVs, Poilievre says",
    "content": " The European Union also imposed higher import tariffs on Chinese EVs this summer, bringing the maximum import tax to almost 50 per cent. On Friday Beijing filed a complaint at the World Trade Organization over it. China promised in May to respond strongly to the U.S. tariffs but hasn’t yet announced any retaliatory measures.\nPoilievre accused Prime Minister Justin Trudeau of refusing to follow the U.S. lead.\n“Meanwhile, Trudeau has done nothing to protect our workers and our jobs,” he said. “Worse than that, this is where it gets really crazy, he’s giving out rebates for people to buy Chinese made cars.”\nRecommended [...]",
    "source_url": "https://nationalpost.com/news/politics/conservative-government-100-per-cent-tariff-on-chinese-evs",
    "source_name": "nationalpost",
    "category": "Top Stories",
    "keywords": "Conservative; Chinese EVs; Poilievre; European Union; On Friday Beijing; World Trade Organization; China; Prime Minister Justin Trudeau; Trudeau; Editorial Canada; EVs; Teslas; Shanghai; EV; April China; BYD; On Friday; Freeland; Pierre Poilievre; Katherine Cuplinskas; Customs Tariff Act; Bloomberg NEF; Liberals; On Friday International Trade Minister Mary Ng"
  },
  {
    "date": "2024-08-10T08:17:04Z",
    "img": "",
    "title": "A chess club for kids thrives in a Congo refugee camp. It’s about more than the game",
    "content": " Hundreds of thousands of people forced to escape the attacks that destroy their towns and villages have ended up in vast displacement camps like Kanyaruchinya, where the Soga Chess Club operates. The United Nations Children’s Fund says around a quarter million children live in the camps, ripped away from their homes and their schools, and sometimes their families.\nSoga has around 100 children signed up to its club. One of them is 9-year-old Heritier, who is still learning the game, but confident enough already to hand out his own lesson.\n“Here,” he said, his fingers flicking across the board. “I’m doing everything [...]",
    "source_url": "https://winnipegsun.com/pmn/a-chess-club-for-kids-thrives-in-a-congo-refugee-camp-its-about-more-than-the-game",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Congo; Soga Chess Club; United Nations Children"
  },
  {
    "date": "2024-08-10T03:53:05Z",
    "img": "https://smartcdn.gprod.postmedia.digital/winnipegsun/wp-content/uploads/2024/08/pacs110-the-associated-press.jpg",
    "title": "No Canadian clubs left in Leagues Cup after CF Montreal falls 2-0 to Philadelphia",
    "content": " Play Video\nBoth Philadelphia goals came in stoppage time, with forward Tai Baribo scoring both — one in the dying minutes of the first half, the other in the game’s 96th minute.\nPhiladelphia outshot Montreal 13-8 in the match, with seven shots on goal versus only two for the Canadian club. Montreal did have the advantage in possession with 53.7 per cent.\nUnion goalkeeper Andre Blake recorded the clean sheet in the win, the third of his career in Leagues Cup play.\nThe Union will face FC Cincinnati in the next round of the Leagues Cup knockout stage on Aug. 13, while Montreal will [...]",
    "source_url": "https://winnipegsun.com/pmn/no-canadian-clubs-left-in-leagues-cup-after-cf-montreal-falls-2-0-to-philadelphia",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "No Canadian; Leagues Cup; CF Montreal; Philadelphia Play Video Both Philadelphia; Tai Baribo; Philadelphia; Andre Blake; FC Cincinnati; Major League Soccer; New England Revolution; Toronto FC; Inter Miami; Vancouver Whitecaps; Mexican; Pumas UNAM; Laurent Courtois; Blake; New England; MLS; Mexico; Liga MX; US; CONCACAF Champions Cup"
  },
  {
    "date": "2024-08-10T04:04:05Z",
    "img": "",
    "title": "Ukraine’s foray into Russia’s border region embarrasses Putin. How will it affect the course of war?",
    "content": " Caught off guard, Russian troops failed to mount a quick response to the incursion. With the bulk of the Russian army engaged in the offensive in Ukraine’s eastern Donetsk region, few troops were left to protect the Kursk border region. The Russian units along the frontier consisted mostly of poorly trained conscript soldiers, who were easily overcome by elite Ukrainian units. Some conscripts were captured.\nThe manpower shortage prompted Russian military command to initially rely on warplanes and helicopter gunships to try to stem the Ukrainian attack. At least one Russian helicopter was downed and another one was damaged by the [...]",
    "source_url": "https://winnipegsun.com/pmn/ukraines-foray-into-russias-border-region-embarrasses-putin-how-will-it-affect-the-course-of-war",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Ukraine; Russia; Putin; Russian; Donetsk; Kursk; Ukrainian; Wagner; Some of; Russian Defense Ministry"
  },
  {
    "date": "2024-08-10T03:42:06Z",
    "img": "https://smartcdn.gprod.postmedia.digital/winnipegsun/wp-content/uploads/2024/08/jfj821-the-canadian-press.jpg",
    "title": "DaShaun Amos. Janarion Grant score key TDs to rally Argos past Stampeders 39-25",
    "content": " Hajrullahu’s 45-yard field goal at 13:00 put Toronto ahead 21-15. He connected from 41 yards out at 4:44, which was set up by linebacker Robert Priester’s recovery of Jake Maier’s fumble at the Stampeders’ 32-yard line.\nGrant gave Toronto a glorious opportunity for points with a 39-yard kickoff return to open the second half. With the Argos at the Calgary 25, Arbuckle hit Carey on a 13-yard completion but linebacker Cameron Judge recovered Carey’s fumble.\nToronto (5-4) earned a split in the home-and-home series with the Stampeders after losing 27-23 at McMahon Stadium last weekend.\nCalgary (4-5) fell to 0-5 on the road [...]",
    "source_url": "https://winnipegsun.com/pmn/dashaun-amos-janarion-grant-score-key-tds-to-rally-argos-past-stampeders-39-25",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "DaShaun Amos; Janarion Grant; TDs; Argos; Stampeders; Robert Priester; Jake Maier; With the Argos; Carey; Cameron Judge; McMahon Stadium; West Division; Saskatchewan Roughriders; On May; Chad Kelly; CFL; Kelly; Cam Echols; Peyton Logan; Paredes; Cody Grace; Makar Polk; Logan; Demerio Houston; Micah Awe; Maier"
  },
  {
    "date": "2024-08-10T04:12:04Z",
    "img": "",
    "title": "Brazilian authorities are investigating the cause of the fiery plane crash that killed 61",
    "content": " But Brazilian aviation expert Lito Sousa cautioned that meteorological conditions alone might not be enough to explain why the plane fell in the manner that it did on Friday.\n“Analyzing an air crash just with images can lead to wrong conclusions about the causes,” Sousa told the AP by phone. “But we can see a plane with loss of support, no horizontal speed. In this flat spin condition, there’s no way to reclaim control of the plane.”\nSpeaking to reporters Friday in Vinhedo, Sao Paulo Public Security Secretary Guilherme Derrite said the plane’s black box had been recovered, apparently in a preserved [...]",
    "source_url": "https://winnipegsun.com/pmn/brazilian-authorities-are-investigating-the-cause-of-the-fiery-plane-crash-that-killed-61",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Brazilian; But Brazilian; Lito Sousa; Analyzing; AP; Sao Paulo Public Security Secretary Guilherme Derrite; Marcelo Moura; Lt; Carlos Henrique Baldi of the Brazilian; Airports Minister Silvio Costa Filho; Brazil; Federal Police; French; Italian; Airbus; France; Italy; Leonardo; Aviation Safety Network; Costa Filho"
  }
]
