[{"date": "2024-08-19T23:36:11Z", "img": "", "title": "Two 18-year-olds charged with murder of former ‘General Hospital’ actor Johnny Wactor", "content": " Wactor was shot and killed when he interrupted three thieves stealing the catalytic converter from his car on May 25. Police said the 37-year-old had left work at a downtown LA rooftop bar with a coworker when he saw three men who had hoisted his car. Police said one of them fired at him without provocation and killed him.\nBarceleau and Estrada were also both charged with grand theft and attempted robbery.\nBarceleau’s charges include special circumstances, including murder during an attempted robbery and personal use of a firearm, that after a conviction could lead to a life sentence without possibility of [...]", "source_url": "https://winnipegsun.com/pmn/two-18-year-olds-charged-with-murder-of-former-general-hospital-actor-johnny-wactor", "source_name": "winnipegsun", "category": "Top Stories", "keywords": "General Hospital; Johnny Wactor Wactor; LA; Leonel Gutierrez; Frank Olano; Wactor; Johnny; LAPD Interim Chief Dominic Choi; Mayor Karen Bass"}, {"date": "2024-08-19T23:42:09Z", "img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/08/na-drinks.jpg", "title": "Homemade cream soda lets vanilla beans take the spotlight", "content": " Cream soda is vanilla soda, though it contains no cream, and most don’t contain any actual vanilla. This is understandable, because the real stuff is so rare that all the vanilla farmers in the world can barely put a dent in the demand. In fact, less than 1 percent of all vanilla flavouring comes from actual vanilla beans – a fact that’s not remotely shocking once you learn all it takes to bring a single pod into this crazy world.\nIt all begins with orchids, which are well known for being so fussy you almost wonder why gardeners put up with [...]", "source_url": "https://nationalpost.com/pmn/life-pmn/food-life-pmn/homemade-cream-soda-recipe", "source_name": "nationalpost", "category": "Top Stories", "keywords": "Indigenous; When the Europeans; New World; Old World; Europeans; French; Mexico; Brazil; Edmond Albius; Tahiti; Because of; Making Cream Soda; Scott Suchman; Lisa Cherkasky"}, {"date": "2024-08-19T23:11:09Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/GettyImages-1542757420.jpg", "title": "LILLEY: Ontario spends least on health, gets better results", "content": " What’s interesting is that on six treatments measured nationally,  in providing timely access to hip replacement and knee replacement surgeries. When it comes to providing timely access to radiation therapy, Ontario meets the mark 99% of the time just behind Manitoba at 100% but well ahead of Newfoundland, the big spender among the provinces which only meets the mark 57% of the time.\nOn hip fracture repair, Ontario is just ahead of the national average meeting the guidelines 83% of the time. For cataract surgery, the province is behind the national average meeting the timeliness guidelines just 65% of the [...]", "source_url": "https://torontosun.com/opinion/columnists/ontario-spends-least-on-health-gets-better-results", "source_name": "torontosun", "category": "Top Stories", "keywords": "LILLEY; Manitoba; Newfoundland; Liberal; Ford; Marit Stiles of the NDP; Bonnie Crombie of the Liberals; Mike Schriener of the Greens"}, {"date": "2024-08-19T23:27:12Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/05/johny-wactor-n.jpg", "title": "Two 18-year-olds charged with murder of former ’General Hospital’ actor Johnny Wactor", "content": " Robert Barceleau and Sergio Estrada were each charged Monday in Los Angeles County Superior Court, District Attorney George Gason said at a news conference.\n“The loss of this talented young actor, who was in the prime of his life and had so much to offer the world, is deeply felt by all of us,” Gascon said.\nThe men and two co-defendants, all of whom were arrested Thursday, were set to be arraigned on Monday afternoon. It is not clear whether any have yet retained lawyers. An email to the county public defender’s office seeking comment on the case was not immediately answered.\nWactor [...]", "source_url": "https://torontosun.com/entertainment/celebrity/two-18-year-olds-charged-with-murder-of-former-general-hospital-actor-johnny-wactor", "source_name": "torontosun", "category": "Top Stories", "keywords": "General Hospital; Johnny Wactor Robert Barceleau; Sergio Estrada; Los Angeles County Superior Court; District Attorney George Gason; Wactor; LA"}, {"date": "2024-08-19T23:19:10Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/couche-tard-japan-20240819.jpg", "title": "Circle K owner makes a play for global convenience store giant 7-Eleven", "content": " Seven & i owns not just the popular 7-Eleven convenience store chain in the U.S., Japan and elsewhere, but also a number of other businesses including supermarkets, food producers, household goods retailers, financial services companies and even has a stake in Tower Records Japan.\nIn the U.S. alone, Saunders said 7-Eleven’s 14.5 per cent market share makes it the biggest operator in the country’s convenience retail store space, while Couche-Tard’s banners hold about 4.6 per cent.\n“Combining the two would produce an entity that controls almost a fifth of the market,” he said.\nThough Couche-Tard publicized the offer Monday, it cautioned there could [...]", "source_url": "https://torontosun.com/business/money-news/circle-k-owner-makes-a-play-for-global-convenience-store-giant-7-eleven", "source_name": "torontosun", "category": "Top Stories", "keywords": "Circle; Eleven Seven; Eleven; Japan; Tower Records Japan; Couche; Tard; Combining; Though Couche; Irene Nattel; RBC Capital Markets; While Saunders; Federal Trade Commission; Japanese; Unless the Alimentation Couche; French; Carrefour SA; French Finance Minister Bruno Le Maire; Brian Hannasch; Europe; TotalEnergies SE; GetGo Cafe; Giant Eagle Inc; Terms of; Pennsylvania; Ohio; West Virginia; Maryland; Indiana"}, {"date": "2024-08-19T23:47:14Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/convoy-trial-20240819.jpg", "title": "’Freedom Convoy’ organizer defends charge of encouraging honking during protest", "content": " “There is ambiguity about how far the exception goes,” she said, and suggested Barber was trying to explain the limits on the court order “in his own words.”\nThat exception wasn’t clear, she argued, saying the threat of an unlawful arrest by riot police may have constituted an emergency in Barber’s mind.\n“That’s a stretch,” Justice Heather Perkins-McVey said when Magas introduced the argument Monday.\nIn the days before the TikTok video, Magas said Barber’s social media posts suggested he had growing fears about riot police showing up and kettling protesters — a controversial law-enforcement practice that involves corralling and containing large crowds [...]", "source_url": "https://torontosun.com/news/crime/freedom-convoy-organizer-defends-charge-of-encouraging-honking-during-protest", "source_name": "torontosun", "category": "Top Stories", "keywords": "Freedom Convoy; Barber; Justice Heather Perkins; TikTok; Parliament Hill"}, {"date": "2024-08-19T23:37:11Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/cityhall.jpg", "title": "WARMINGTON: Only in Toronto would illegal residents be celebrated", "content": " The rules don’t apply to everyone in Toronto. In fact, in city hall’s rotunda this week there’s “a display of materials highlighting the realities of the lived experiences of undocumented Torontonians.” It pays homage not to those who come though the system but those have gone around it.\nMayor Chow has so far not commented but this designated day to honour illegal immigrants predated her election. Same goes for Councillor Diane Saxe, who said did not vote for it.\n“Declaration of this day was not approved by city council, at least not since I was elected, and no rationale for it has [...]", "source_url": "https://torontosun.com/news/local-news/warmington-only-in-toronto-would-illegal-residents-be-celebrated", "source_name": "torontosun", "category": "Top Stories", "keywords": "WARMINGTON; Mayor Chow; Councillor Diane Saxe; Saxe of Ward; University; On the City of Toronto; City Services; Undocumented Torontonians; Rosedale Councillor Dianne Saxe; Kensington Market; Angela Ho; Downtown Concerned Citizens Organization; Refugee Protection Act; Canada Border Services Agency; CBSA; Toronto Mayor Olivia Chow"}, {"date": "2024-08-19T23:49:14Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/assisted-dying-20240819.jpg", "title": "Canada’s assisted-dying law faces constitutional fight for excluding mental disorder", "content": " “I feel it’s incumbent on me to rattle whatever cage I can, to say, not ‘Look at me,’ but ‘Look at us.’ For God’s sake. Do something about it.”\nThe Liberal government announced in February it would delay a planned expansion to the assisted-dying regime that would have allowed people with mental disorders to be considered starting in March. The expansion has been delayed until 2027.\nThe government cited readiness concerns from provinces and outstanding questions from psychiatrists about how clinicians could determine whether someone’s mental illness could be cured.\nDying with Dignity, Scully and a third plaintiff, Claire Elyse Brosseau, argue the [...]", "source_url": "https://torontosun.com/news/national/canadas-assisted-dying-law-faces-constitutional-fight-for-excluding-mental-disorder", "source_name": "torontosun", "category": "Top Stories", "keywords": "For God; Liberal; Claire Elyse Brosseau; Canadian Charter of Rights; MAID; Senate; Senators; As the March; Health Minister Mark Holland; Justice Minister Arif Virani; Proponents of; Holland; Conservative Leader Pierre Poilievre; Helen Long; CEO of Dying; Dignity Canada; Virani"}, {"date": "2024-08-19T23:30:12Z", "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/08/wildfires-bc-20240819.jpg", "title": "Helicopter evacuations underway as wildfire threatens Yukon wilderness lodge", "content": " The Yukon government’s wildfire information website said the Snag Lake fire displayed “extreme behaviour” in hot and dry conditions the day before.\nIt said fire officials were at the site and four people had been evacuated by helicopter, with further evacuations planned.\nDack said the those who left the lodge were a family from Northern California who were “very understanding” about the evacuation.\n“I think they’re kind of used to smoke,” Dack said, adding the family told him they would return to the lodge next year.\nAdvertisement 4\nArticle content\nDack said the heat in the region has been “unbearable” at times this summer, and he’s [...]", "source_url": "https://torontosun.com/news/national/helicopter-evacuations-underway-as-wildfire-threatens-yukon-wilderness-lodge", "source_name": "torontosun", "category": "Top Stories", "keywords": "Yukon; Snag Lake; Northern California; North; Snag Junction; Alaska Highway; British Columbia; BC Wildfire Service"}, {"date": "2024-08-19T23:56:04Z", "img": "https://ichef.bbci.co.uk/news/1024/branded_news/21ed/live/c34cde00-5e3f-11ef-a18e-07b4efd360b4.jpg", "title": "I never thought I d get home, gay man arrested in Qatar says", "content": " A British-Mexican man convicted of drug offences in Qatar after being detained there for six months has told BBC News he “never thought I’d return home\".\nIn his first interview since leaving the country, Manuel Guerrero Aviña, who says he was targeted because he is gay, warned LGBT people to “be careful when visiting Qatar”, saying: “What happened to me could happen to anyone.”\nHe was arrested in February after arranging to meet a man - who he later found out was an undercover police officer - using gay dating app Grindr.\nHuman-rights groups have raised concerns over Manuel s detention and called [...]", "source_url": "https://www.bbc.com/news/articles/c3vxddzr2z5o", "source_name": "bbc.com", "category": "World", "keywords": "Qatar; Mexican; Manuel Guerrero Avi; LGBT; Grindr; Manuel; British Airways; UK"}, {"date": "2024-08-19T23:41:10Z", "img": "", "title": "Betty Jean Hall, advocate who paved the way for women to enter coal mining workforce, dies at 78", "content": " “Her push was always, ‘Mining is where the jobs are and women need to make money just as men do.’ She would say, ‘We need the money because we have babies and we’ve got families, too,”‘ McAteer said.\nHall told the Times in 1979 that if women had to choose between making $6,000 a year in a factory and mining coal for $60 or more a day, “they’ll go into the mines.”\n“Sure, coal mining is hard work,” she told the newspaper. “But so is housework and so is working in sewing factories for minimum wages.”\nWithin a little more than a year, [...]", "source_url": "https://winnipegsun.com/pmn/betty-jean-hall-advocate-who-paved-the-way-for-women-to-enter-coal-mining-workforce-dies-at-78", "source_name": "winnipegsun", "category": "Top Stories", "keywords": "Betty Jean Hall; Hall; Coal Employment Project; By December; Consolidation Coal Company; Kipp Dawson; Pennsylvania; Lexington Herald; Medical Leave Act; Department of Labor Benefits Review Board; United Mine Workers of America International President Cecil; Roberts; Mother Jones; Kevin Olsen; Timothy Burke; Janet Smith"}, {"date": "2024-08-19T23:33:09Z", "img": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2024/08/wayfair-dresser-scaled.jpg", "title": "Review: Wayfair’s Bixby Bookshelf is multifunctional and charming", "content": " Delivery: Extremely fast. I received it within a week of ordering it. I believe the delivery standard on this item is within two weeks (if you’re in Canada). The shipping was free and the bookshelf arrived with all necessary parts in one large box.\nAssembly: This took about 75 minutes for one person. I usually assemble these pieces myself so I have a complete understanding of the physicality required, but my partner took this one on as we wanted to get it up quickly. The assembly was straightforward — the included instructions were clear and all of the holes aligned perfectly [...]", "source_url": "https://nationalpost.com/shopping-essentials/wayfair-bixby-bookshelf-review", "source_name": "nationalpost", "category": "Top Stories", "keywords": "Wayfair; Bixby Bookshelf; Assembly; Amazon"}, {"date": "2024-08-19T23:25:01Z", "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/19/2024-dnc-chicago-1-7006561-1724109531465.jpg", "title": "Democrats to honour Biden while pivoting to Harris on Day 1 of convention", "content": " A refreshed Democratic Party will gather Monday night for a valedictory speech from President Joe Biden, whose decision to end his re-election bid released newfound energy with Vice-President Kamala Harris ′ rise to the top of the ticket.\nThe Democratic National Convention that began Monday in Chicago holds particularly high stakes for the party. It must finalize the unprecedented mid-campaign handoff from Biden to Harris and reintroduce the vice-president to a divided country that is viewing her more positively but still making up its mind about the election.\nIf successful, Democrats will slingshot Harris toward an faceoff with Republican Donald Trump, whose [...]", "source_url": "https://www.ctvnews.ca/world/democrats-to-honour-biden-while-pivoting-to-harris-on-day-1-of-convention-1.7005978", "source_name": "CTVnews", "category": "World", "keywords": "Democrats; Biden; Harris; Democratic Party; President Joe Biden; President Kamala Harris; Democratic National Convention; Chicago; Republican Donald Trump; White House; Democrat; Trump; Minnesota Gov; Tim Walz; Walz; Hispanic Caucus; Kamala Harris; Senate; Delaware; Florida; Israel; Hamas; Gaza; United Center; DNC; Abandon Biden; Abandon Harris; Palestinian; Democratic; United Auto Workers President Shawn Fain; Hillary Clinton; Grace Meng; Jamie Raskin; Jasmine Crockett; Chris Coons; Raphael Warnock; Kentucky Gov; Andy Beshear; James Taylor; Jason Isbell; Mickey Guyton; Atlanta; Will Weissert; Ali Swenson; Michelle; New York; Chris Megerian; Washington; Freedom Convoy; Chris Barber; Liberal Party of Canada; Ottawa Pride; Palestinians; Former; Donald Trump; Taylor Swift; Mike Lynch; Sicily; Italy; Lynch; Jon Kotwicki; Alaska; Alimentation Couche; Tard Inc; Secretary of State Antony Blinken; Twilite Drive; BC Lions; Swallowtail Lighthouse; New Brunswick; Grand Manan Island; Samih Angelo Alame; Grade Six; World Honey Bee Day; Regina; London; Ont; Tessa Virtue; Toronto Maple Leafs; Morgan Rielly; Shopping Trends; Read"}, {"date": "2024-08-19T23:14:06Z", "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/19/u-s--election---democratic-national-convention-1-7006552-1724109142310.jpg", "title": "Protesters break through police fence near site of Democratic National Convention", "content": " Protesters broke through a fence set up by police near the site of the Democratic National Convention on its opening day Monday as thousands took to the streets to voice their opposition to the war in Gaza.\nAs the larger group marched, a few dozen who broke away tore down pieces of the security fence. Some protesters, dressed in black with their faces covered, dragged pieces of the fence back to a park near the United Center, where the convention is being held.\nThe march happened just as U.S. President Joe Biden, who has been the target of intense criticism from pro-Palestinian [...]", "source_url": "https://www.ctvnews.ca/world/protesters-break-through-police-fence-near-site-of-democratic-national-convention-1.7006548", "source_name": "CTVnews", "category": "Top Stories", "keywords": "Democratic National Convention Protesters; Democratic National Convention; Gaza; United Center; President Joe Biden; Palestinian; Biden; Genocide Joe; President Kamala Harris; Harris; Democratic; Israel; Palestine; Hatem Abudayyeh; DNC; Chicago Police Supt; Larry Snelling; Mayor Brandon Johnson; Chicago; Faayani Aboma Mijana; Taylor Cook; Freedom Road Socialist Organization; Atlanta; Cook; Democrats; Kamala; Joe Biden; Medea Benjamin; Washington; US; Union Park; Loop; Cornel West; Israeli; Josh Weiner; Chicago Jewish Alliance; LGBTQ; Listen; Chicago Police Department; Hamas; Vietnam War; Illinois Policy Institute; Also Monday; Philadelphia; Poor People; Humboldt Park; Jill Stein; West; BREAKING The Court of Arbitration; Olympic; Ontario Provincial Police; Martyn Rosko; Kirkland Lake; Colombian President Gustavo Petro; Venezuelan President Nicolas Maduro; Maduro; Starbucks; Jason Pilbin; Vermont; Alabama; British Columbia; Marathon Monday; Patrick Law; Dylan Thornborough; Anne Murray Centre; Imani Nadir; Two Horses; Jasper National Park; Colleen Knull; Jasper; Alta; Saskatchewan; Second World War; France; First Nations; Shopping Trends; Read"}, {"date": "2024-08-19T23:28:16Z", "img": "https://www.sciencedaily.com/images/scidaily-icon.png", "title": "Evidence stacks up for poisonous books containing toxic dyes", "content": " If you come across brightly colored, cloth-bound books from the Victorian era, you might want to handle them gently, or even steer clear altogether. Some of their attractive hues come from dyes that could pose a health risk to readers, collectors or librarians. The latest research on these poisonous books used three techniques -- including one that hasn t previously been applied to books -- to assess dangerous dyes in a university collection and found some volumes may be unsafe to handle.\nThe researchers will present their results at the fall meeting of the American Chemical Society (ACS).\n\"These old books with [...]", "source_url": "https://www.sciencedaily.com/releases/2024/08/240819172512.htm", "source_name": "sciencedaily.com", "category": "Technology", "keywords": "Victorian; American Chemical Society; Abigail Hoermann; Lipscomb University; Jafer Aljorani; Leila Ais; Joseph Weinstein; Webb; Jan Cohu; Michaela Rutledge; Beaman Library; Weinstein; Winterthur Museum; Poison Book Project; Raman; For the Lipscomb; Although XRD; Janet Macdonald; Vanderbilt University; Subsequent XRD; II; Vincent; Gogh; Disease Control; CDC"}]