[
  {
    "date": "2024-10-06T02:12:12Z",
    "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/CP173261018.jpg",
    "title": "Maple Leafs season preview: From the crease to the bench, meet the new players",
    "content": " WHERE HE’S BEEN: Years of near anonymity in the desert for the sixth overall pick in 2009 (just before the Leafs selected Nazem Kadri) ended couple of high-profile years in Vancouver and then a Cup with the Panthers. His 24 games last spring nearly doubled his career playoff run, on top of 80 regular-season games, his best attendance in five years. \nWHAT HE BRINGS: In addition to experience, he possesses a better point shot than most on the current Leafs, which will help at 5-on-5 and the power play. If Berube can find a complimentary right-handed shot as a partner, Ekman-Larsson will [...]",
    "source_url": "https://torontosun.com/sports/hockey/nhl/toronto-maple-leafs/season-preview-from-the-crease-to-the-bench-meet-the-new-maple-leafs",
    "source_name": "torontosun",
    "category": "Top Stories",
    "keywords": "Maple Leafs; WHERE HE; Leafs; Nazem Kadri; Cup; Panthers; WHAT HE BRINGS; If Berube; Ekman; Larsson; DID YOU KNOW; NHL; Leaf; Tim Horton; Finland; Hawk WHERE HE; St; Louis; Hakanpaa; Anaheim; Dallas Stars; UFAs; American Brian Rafalski; Finnish; New Canaan; Conn; Patches WHERE HE; Patrick Kane; James; Stanley Cup; Vegas; Achilles; Pacioretty; Tyler Bertuzzi; Auston Matthews; Mexican"
  },
  {
    "date": "2024-10-06T01:24:11Z",
    "img": "https://i.cbc.ca/1.7344233.1728179110!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/rgu-wxv-1-ireland-canada-20241005.JPG",
    "title": "Canada s women s rugby team beats Ireland to improve to 2-0 at WXV 1 tournament in B.C.",
    "content": " The Canadian women s rugby team started quickly and then dug in defensively to beat Ireland 21-8 at the WXV 1 tournament on Saturday at Langley Events Centre in Langley, B.C.\nThe Canadian women s rugby team started quickly and then dug in defensively to beat Ireland 21-8 at the WXV 1 tournament on Saturday at Langley Events Centre in Langley, B.C.\nThe Canadians, who rolled past France 46-24 in their tournament opener on Sept. 29, improved to 2-0. They ll next face England on Saturday, Oct. 12, at B.C. Place in Vancouver. England, which crushed the United States 61-21 in its tourney opener on Sept. [...]",
    "source_url": "https://www.cbc.ca/sports/rugby/canadian-women-rugby-ireland-wxv-1-tournament-recap-1.7344230?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Ireland; WXV; Langley Events Centre; Langley; France; England; United States; New Zealand; Clair Gallagher; Julia Omokhuale; Alex Tessier; Eimear Considine; Brien"
  },
  {
    "date": "2024-10-06T01:43:01Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2021/3/15/rcmp-1-5347740-1710784597555.jpg",
    "title": "Car flies into B.C. backyard, lands upside down",
    "content": " A driver suffered only minor injuries after going airborne in a residential neighbourhood in Maple Ridge, B.C., on Friday, the car eventually landing on its roof in someone’s backyard.\nLocal RCMP say officers responded to the rollover in the 14000 block of Mier Drive around noon.\nPolice say they found the vehicle upside-down in a backyard after it appeared to cause damage in multiple other backyards.\nA video posted on social media shows the vehicle, a white SUV, careening over a metal fence, and flying through the air before skidding across a rock barrier.\nby u/mx043 in MapleRidge\nAnother video taken after the crash shows [...]",
    "source_url": "https://bc.ctvnews.ca/car-flies-into-b-c-backyard-lands-upside-down-1.7063786",
    "source_name": "CTVnews",
    "category": "Top Stories",
    "keywords": "Maple Ridge; Local RCMP; Mier Drive; SUV; MapleRidge Another; RCMP; Cpl; Brett Urano; Ridge Meadows RCMP; Integrated Collision Analysis; Reconstruction Service; Donald Trump; Pennsylvania; Trump; GST; HST; North York; Ligeng Guo; Old Montreal; Galway University; Ireland; Hamilton; McMaster University; Vanderbilt; AP; Alabama; Tropical Storm Milton; Gulf of Mexico; Mexico; Shopping Trends; Read"
  },
  {
    "date": "2024-10-06T01:26:10Z",
    "img": "https://i.cbc.ca/1.7344225.1728176274!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/2176100465.jpg",
    "title": "Unranked Vanderbilt stuns No. 1 Alabama in historic college football upset",
    "content": " Fans of the Vanderbilt Commodores danced onto the field, jumping up and down as they tore down a goal post, carried it out of the stadium and rang out sweet sounds of victory. Their school s historic win over No. 1 Alabama deserved to be celebrated this way.\nVanderbilt Commodores defensive lineman De Marion Thomas and offensive lineman Duncan MacDonald celebrate their team s 40-35 upset victory over the Alabama Crimson Tide on Saturday at FirstBank Stadium in Nashville. (Carly Mackler/Getty Images)\nFans of the Vanderbilt Commodores danced onto the field, jumping up and down as they tore down a goal post, [...]",
    "source_url": "https://www.cbc.ca/sports/football/vanderbilt-upsets-alabama-college-football-1.7344224?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Unranked Vanderbilt; Alabama; Fans of the Vanderbilt Commodores; Vanderbilt Commodores; De Marion Thomas; Duncan MacDonald; Alabama Crimson Tide; FirstBank Stadium; Nashville; Carly Mackler; Sedrick Alexander; Randon Fontenette; Diego Pavia; Heisman Trophy; Jalen Milroe; Vanderbilt; Southeastern Conference; AP; Clark Lea; DOWN GOES the FIELD GOAL POSTS; Only Jam Miller; TD; AP Top; Georgia; Alexander; Nick Saban; Ryan Williams; Miles Capers; Yilanan Ouattara; Kamrean Johnson; Williams; PAVIA TO JOHNSON FOR the TOUCHDOWN; Games; De Rickey Wright; SEC"
  },
  {
    "date": "2024-10-20T00:00:00Z",
    "img": "https://media.cnn.com/api/v1/images/stellar/prod/20241018-trumpharrissplit101824.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",
    "title": "Why nobody knows who will win the 2024 election",
    "content": "As Election Day approaches, uncertainty reigns over the outcome of the 2024 presidential election. Polls show tight races between Kamala Harris and Donald Trump, with Harris needing to win key 'blue wall' states like Michigan, Pennsylvania, and Wisconsin. While Trump has historically outperformed polls, the dynamics may not favor him this time. A historical analysis suggests that past polling misses do not consistently benefit the same party in successive elections. Moreover, structural indicators show that the incumbent party struggles when the president's approval ratings are low, which complicates predictions for Trump’s chances.",
    "source_url": "https://www.cnn.com/2024/10/20/politics/2024-election-uncertainty-analysis/index.html",
    "source_name": "cnn.com",
    "category": "World",
    "keywords": "2024 election; Kamala Harris; Donald Trump; polling; battleground states; blue wall"
  },  
  {
    "date": "2024-10-08T22:22:22Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/c4bd/live/f4063730-85a9-11ef-a9c9-470d3c15ff2c.jpg",
    "title": "New book says Trump secretly sent Covid tests to Putin during shortage",
    "content": " A new book by veteran Watergate reporter Bob Woodward says Donald Trump secretly sent coveted Covid-19 tests to Vladimir Putin for personal use when it was in short supply, a claim angrily dismissed by the Trump campaign.\nThe book -titled War- also includes a claim that Trump has secretly stayed in touch with Putin since leaving office, according to excerpts cited by US media.\nThe Trump campaign said none of these \"made-up stories\" were true.\n“President Trump gave him absolutely no access for this trash book that either belongs in the bargain bin of the fiction section of a discount bookstore or used [...]",
    "source_url": "https://www.bbc.com/news/articles/c33vjjg8k3yo",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Trump; Covid; Putin; Bob Woodward; Donald Trump; Vladimir Putin; US; President Trump; Steven Cheung; BBC; Woodward; Richard Nixon; Calling Woodward; New York Times; Mar; Lago; White House; Abbott Point of Care Covid; Russia; Department of Justice; President Joe Biden; Merrick Garland; Hunter; Garland"
  },
  {
    "date": "2024-10-08T23:08:05Z",
    "img": "https://assets.nationbuilder.com/therebel/pages/115691/meta_images/original/2024.10.05_-_RNL_Calgary_-_Danielle_Smith_HR_TI_meta.png?1728413811",
    "title": "Premier Smith discusses  hate speech provision  after Rebel News hit with human rights complaint",
    "content": "  My personal view on hate speech has been that the Criminal Code already draws the lines, and it has to be a very high bar,  said Premier Smith.\nRemove Ads\nAlberta Premier Danielle Smith spoke with  about hate speech laws and human rights complaints at this year s Rebel News LIVE! event in Calgary.\nLevant informed Smith that Rebel News has been hit with a human rights complaint under the so-called \"hate speech provision.\" While discussing the complaint — which was not filed in Alberta — Levant noted that B.C, Saskatchewan, and Alberta still include the hate speech provision in their jurisdictions.\nLevant [...]",
    "source_url": "http://www.rebelnews.com/premier_smith_discusses_hate_speech_provision_after_rebel_news_hit_with_human_rights_complaint",
    "source_name": "rebelnews.com",
    "category": "World",
    "keywords": "Premier Smith; Rebel News; Criminal Code; Remove Ads Alberta Premier Danielle Smith; Rebel News LIVE; Levant; Smith; Saskatchewan"
  },
  {
    "date": "2024-10-15T00:00:00Z",
    "img": "https://media.cnn.com/api/v1/images/stellar/prod/2024-09-17t200405z-554324718-rc2j2aa2cphs-rtrmadp-3-usa-election-harris.JPG?c=16x9&q=h_653,w_1160,c_fill/f_webp",
    "title": "Kamala Harris pledged to prosecute oil companies over emissions. Now, she is praising their record US production",
    "content": "Kamala Harris has shifted her stance on energy and climate since joining the Biden administration. Initially promising to hold oil companies accountable for their emissions, she now emphasizes the record levels of domestic oil production. This change reflects the political balancing act within the Democratic Party as Harris distances herself from more progressive positions like the Green New Deal. Despite previous commitments to regulate the oil industry and environmental practices, she now highlights the achievements of the Biden administration in increasing oil production, attributing this success to market forces rather than policy.",
    "source_url": "https://www.cnn.com/2024/10/15/politics/kamala-harris-oil-production-emissions/index.html",
    "source_name": "cnn.com",
    "category": "World",
    "keywords": "Kamala Harris; oil companies; emissions; climate change; Green New Deal; US production"
  },  
  {
    "date": "2024-10-08T22:22:19Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/trump-called-putin-after-leaving-office--woodward-1-7066647-1728411686926.jpg",
    "title": "Woodward book reveals Trump s calls with Putin and Biden s private remarks on Obama and Netanyahu",
    "content": " Donald Trump has had as many as seven private phone calls with Vladimir Putin since leaving office and secretly sent the Russian president COVID-19 test machines during the height of the pandemic, Bob Woodward reported in his new book, “War.\"\nSteven Cheung, Trump s communications director, denied the accounts in the book. “None of these made up stories by Bob Woodward are true and are the work of a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome,” Cheung said in a statement.\nTrump had previously spoken to Woodward for the journalist s 2021 book, “Rage.” [...]",
    "source_url": "https://www.ctvnews.ca/world/woodward-book-reveals-trump-s-calls-with-putin-and-biden-s-private-remarks-on-obama-and-netanyahu-1.7066644",
    "source_name": "CTVnews",
    "category": "World",
    "keywords": "Woodward; Trump; Putin; Biden; Obama; Netanyahu Donald Trump; Vladimir Putin; Russian; COVID; Bob Woodward; Steven Cheung; Trump Derangement Syndrome; Florida; Mar; Lago; Jason Miller; But Miller; Russia; Hillary Clinton; Democratic; Robert Mueller; Ukraine; Putin COVID; President Kamala Harris; Howard Stern; American; Harris; Netanyahu; Israel; Hamas; With Netanyahu; Israeli; Mideast; White House; Emilie Simons; President Barack Obama; Crimea; Democrat; Barack; One of Trump; South Carolina Sen; Lindsey Graham; Graham; North Korea; In March; Middle East; Saudi; New York; Hillel Italie; Eric Tucker; Washington; Aamer Madhani; Air Force One; LIVE UPDATES; National Hurricane Center; Hurricane Milton; Category; Tampa; Daytona Beach; Liberal; Parliament; Deputy Prime Minister Chrystia Freeland; Conservative; Ontario Ministry of Health; Marc Garneau; Fort Chipewyan; Alta; Transport Minister Anita Anand; On September; Madeleine Gervais; Loblaws; College Square; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-06T02:25:03Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/3f4b/live/72edb570-8378-11ef-83dd-fbf1b9732cf0.jpg",
    "title": "Netanyahu says Macron s call for arms embargo is  a disgrace",
    "content": " Israeli Prime Minister Benjamin Netanyahu has criticised French President Emmanuel Macron over his call to halt arms deliveries to Israel for use in Gaza.\nMacron told France Inter radio that \"the priority is that we return to a political solution, that we stop delivering weapons to fight in Gaza\".\nAt a summit in Paris on Saturday, the French president reiterated his concern over the conflict in Gaza continuing despite ceasefire calls, and he also criticised Israel s decision to\nNetanyahu responded: \"Shame on them,\" referring to Macron and other Western leaders who have called for what he described as an arms embargo on [...]",
    "source_url": "https://www.bbc.com/news/articles/cjr3zd4d8y5o",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Netanyahu; Macron; Israeli Prime Minister Benjamin Netanyahu; French President Emmanuel Macron; Israel; Gaza; France Inter; Paris; French; Western; France; Lebanon; Iran; As Israel; President Macron; Reuters Macron; Francophonie Summit; Grand Palais; Paris Speaking; US; Prime Minister Netanyahu; Lebanese; Franco; Israelis; Hamas"
  },
  {
    "date": "2024-10-06T01:22:01Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/alberta-ndp-politics-100524-gya-3.jpg",
    "title": "‘Shameless’: Nenshi blasts UCP over Green Line flip-flop during NDP town hall, leans into  Nenshi Nightmare",
    "content": " Speaking about the province’s commitment to education spending, Nenshi called Smith a “pinball Premier,” who “goes from crisis to crisis, careening wildly, patching up holes in the wall after the water has already come in.”\nThe provincial opposition leader gave credit to Smith for the recent announcement that the province would invest $8.6 billion in education over the next three years, but raised concerns about whether the Premier knows how the money will be spent. He also criticized Smith for creating massive inflation in the construction industry with the announcement.\nOther issues addressed during the town hall were hospital wait times, overcrowded [...]",
    "source_url": "https://calgaryherald.com/news/local-news/nenshi-to-speak-at-ndp-town-hall-saturday-morning",
    "source_name": "calgaryherald.com",
    "category": "World",
    "keywords": "Shameless; Nenshi; UCP; Green Line; NDP; Nenshi Nightmare Speaking; Smith; Danielle Smith; Alberta NDP"
  },
  {
    "date": "2024-10-21T00:00:00Z",  
    "img": "https://live-production.wcms.abc-cdn.net.au/cd9bcb9074bc7c3c21fdf1d27e253518?impolicy=wcms_crop_resize&cropH=1280&cropW=1920&xPos=0&yPos=0&width=862&height=575",  
    "title": "As Peter Dutton plots federal victory in 'key battleground state', Libby Mettam insists she can win back WA",
    "content": "After a few years of soul-searching in the political wilderness, the WA Liberal Party has outlined its plan for redemption ahead of the looming double-header elections. WA Liberal leader Libby Mettam speaks at a lectern with her head framed by a ring of lights. WA Liberal leader Libby Mettam's party was decimated at the 2021 state election. Can she lead them into the light in 2025? At the Liberal Party's annual state conference, both state and federal leaders made their pitch to WA voters. Peter Dutton declared WA a 'key battleground state' in the next federal election. Dutton promises to keep the live sheep trade, turbocharge the mining industry, and scrap federal Labor's offshore wind plans. Libby Mettam announced the party's 'Priorities for Western Australia' including fixing the health system and restoring law and order.",
    "source_url": "https://www.abc.net.au/news/2024-10-21/wa-state-liberal-conference-peter-dutton-anthony-albanese-visit/104492152",
    "source_name": "abc.net.au",
    "category": "World",
    "keywords": "Peter Dutton; Libby Mettam; WA Liberal Party; elections; health system; GST; housing; priorities"
  },
  {
    "date": "2024-10-18T00:00:00Z",  
    "img": "https://media.cnn.com/api/v1/images/stellar/prod/20241018-trumpharrissplit101824.jpg?c=16x9&q=h_653,w_1160,c_fill/f_webp",  
    "title": "Whatever his policy, Peter Dutton will be a big target on workplace relations",
    "content": "Peter Dutton has been receiving a good many political breaks recently. Although the Coalition is not expected to win next year's election, it looks placed to do well. Industrial relations could be dangerous ground for Peter Dutton in the upcoming election, as the government will reach for workplace issues as a potential lifeline. Labor's campaign could focus on the government's support for wage rises and protections for casuals. The Coalition must navigate how many Labor changes it will pledge to roll back, while reassuring workers it doesn't have a hidden agenda.",
    "source_url": "https://theconversation.com/whatever-his-policy-peter-dutton-will-be-a-big-target-on-workplace-relations-104492152",
    "source_name": "theconversation.com",
    "category": "World",
    "keywords": "Peter Dutton; workplace relations; industrial relations; federal election; Labor; Coalition"
  },  
  {
    "date": "2024-10-19T00:00:00Z",
    "img": "https://live-production.wcms.abc-cdn.net.au/4be24fce5d6317b17fdfcdc8642c2a6a?impolicy=wcms_crop_resize&cropH=3333&cropW=5000&xPos=0&yPos=164&width=862&height=575",
    "title": "Israel's elimination of terror leader Yahya Sinwar puts Labor in the right place at the right time",
    "content": "Diminished and half-crumpled in a sofa chair, Yahya Sinwar had time to take in the reality of his final moments alive. Drone footage shows the Hamas leader's last act of defiance before being killed by Israeli forces. Sinwar's elimination may signal an inflection point in the conflict, offering hope for peace. The Albanese government, caught between leftist demands and hardline stances, may find relief as Labor's call for hostilities to end aligns with current events. Leaders like Biden are urging for a ceasefire and a two-state solution. The Coalition also calls for Hamas to surrender and release hostages.",
    "source_url": "https://www.abc.net.au/news/2024-10-19/israel-elimination-yahya-sinwar-labor-albanese-biden-peace/104492232",
    "source_name": "abc.net.au",
    "category": "World",
    "keywords": "Yahya Sinwar; Israel; Hamas; Labor; Albanese; ceasefire; two-state solution"
  },  
  {
    "date": "2024-10-08T18:32:16Z",
    "img": "https://www.spxdaily.com/images-hg/holographic-sound-generate-3d-imagery-parts-hg.jpg",
    "title": "Holographic 3D printing has the potential to revolutionize multiple industries",
    "content": " Researchers at Concordia have developed a novel method of 3D printing that uses acoustic holograms. And they say it s quicker than existing methods and capable of making more complex objects.\nThe process, called holographic direct sound printing (HDSP), is described in a recent article in the journal Nature Communications. It builds on a method introduced in 2022 that described how sonochemical reactions in microscopic cavitations regions -- tiny bubbles -- create extremely high temperatures and pressure for trillionths of a second to harden resin into complex patterns.\nNow, by embedding the technique in acoustic holograms that contain cross-sectional images of a [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008122240.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "Nature Communications; Muthukumaran Packirisamy; Department of Mechanical; Aerospace Engineering; Concordia University; Patrick Lejtenyi"
  },
  {
    "date": "2024-10-08T16:59:33Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/astronauts-stranded-hurricane-milton.jpg",
    "title": "Astronauts Stranded in Space Due to Hurricane Milton",
    "content": " But thanks to the dangerous mega storm currently brewing in the Atlantic, they are stuck on board the International Space Station a little while longer.\nNASA has announced that the crew for its latest return mission won t be able to leave until at least October 13. It s the second time the agency has had to scrub the date due to the rapidly-approaching Hurricane Milton.\n\"NASA and SpaceX now are targeting no earlier than 3:05 am EDT Sunday, Oct. 13, for the undocking of the Crew-8 mission from the International Space Station due to weather conditions and potential impacts from Hurricane [...]",
    "source_url": "https://futurism.com/the-byte/astronauts-stranded-hurricane-milton",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "Astronauts Stranded; Space Due; Hurricane Milton But; Atlantic; International Space Station; NASA; Hurricane Milton; SpaceX; EDT Sunday; Florida; Though Tampa; Category; Kennedy Space Station; Cape Canaveral; Milton; Europa Clipper; Boeing; Starliner; ISS; Russian Soyuz"
  },
  {
    "date": "2024-10-08T21:56:13Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/jellyfish-fuse-together-injured.jpg",
    "title": "These Mighty Morphin’ Jellyfish Have a Mind-Blowing Survival Trick Up Their Sleeves",
    "content": " After capturing a bunch of these so-called \"sea walnuts\" from the western Atlantic Ocean and putting them in saltwater tanks, researchers at the University of Chicago s Marine Biological Lab noticed something odd: one of the creatures seemed much larger than the others, and it had two brains and two butts.\nIt occurred to the team that they might have a fused-together monstrosity on their hands. To test their theory out, they removed parts of some of the smaller jellies — which, yes, means they intentionally injured them — and put them close together in pairs.\n\"It turned out that, nine out [...]",
    "source_url": "https://futurism.com/the-byte/jellyfish-fuse-together-injured",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "These Mighty Morphin; Jellyfish Have; Blowing Survival Trick Up Their Sleeves After; Atlantic Ocean; University of Chicago; Marine Biological Lab; Kei Jokura; Japanese; Current Biologystudy; Unraveling"
  },
  {
    "date": "2024-10-08T19:13:24Z",
    "img": "https://science.nasa.gov/wp-content/uploads/2024/09/mars-wet-lpi-16x9-1.jpg?w=1536&format=webp",
    "title": "New insights into how Mars became uninhabitable",
    "content": " NASA s Curiosity rover, currently exploring Gale crater on Mars, is providing new details about how the ancient Martian climate went from potentially suitable for life -- with evidence for widespread liquid water on the surface -- to a surface that is inhospitable to terrestrial life as we know it.\nAlthough the surface of Mars is frigid and hostile to life today, NASA s robotic explorers at Mars are searching for clues as to whether it could have supported life in the distant past. Researchers used instruments on board Curiosity to measure the isotopic composition of carbon-rich minerals (carbonates) found in [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241007165317.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "Mars; NASA; Martian; Red Planet; David Burtt of NASA; Goddard Space Flight Center; Greenbelt; Maryland; Proceedings of the National Academy of Sciences; Jennifer Stern of NASA Goddard; Sample Analysis; SAM; Tunable Laser Spectrometer; Mars Exploration Program; Mars Science Laboratory; Jet Propulsion Laboratory; California; Science Mission Directorate; Washington; NASA Goddard; William Steigerwald"
  },
  {
    "date": "2024-10-08T16:52:30Z",
    "img": "https://scx1.b-cdn.net/csz/news/800a/2024/ai-speeds-up-the-disco.jpg",
    "title": "AI speeds up the discovery of energy and quantum materials",
    "content": " Researchers from Tohoku University and the Massachusetts Institute of Technology (MIT) have unveiled a new AI tool for high-quality optical spectra with the same accuracy as quantum simulations, but working a million times faster, potentially accelerating the development of photovoltaic and quantum materials.\nUnderstanding the optical properties of materials is essential for developing optoelectronic devices, such as LEDs, solar cells, photodetectors, and photonic integrated circuits. These devices are pivotal in the semiconductor industry s current resurgence.\nTraditional means of calculation using the basic laws of physics involve complex mathematical calculations and immense computational power, rendering it difficult to quickly test a large [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241007222754.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "AI; Tohoku University; Massachusetts Institute of Technology; MIT; LEDs; Nguyen Tuan Hung; Frontier Institute; Interdisciplinary Science; Mingda Li; Department of Nuclear Science; Nguyen; Advanced Materials; Ryotaro Okabe; Abhijatmedhi Chotrattanapituk"
  },
  {
    "date": "2024-10-08T16:24:19Z",
    "img": "https://scx1.b-cdn.net/csz/news/800a/2024/ai-and-quantum-mechani.jpg",
    "title": "AI and quantum mechanics team up to accelerate drug discovery",
    "content": " Drug discovery is much like working a jigsaw puzzle. The chemical compounds behind drug molecules must be shaped to fit with the proteins in our bodies to produce therapeutic effects. That requirement for a meticulous fit means the creation of new drugs is extremely complex and time-consuming.\nTo speed up the puzzle-fitting process, researchers at SMU have created SmartCADD. This open-source virtual tool combines artificial intelligence, quantum mechanics and Computer Assisted Drug Design (CADD) techniques to speed up the screening of chemical compounds, significantly reducing drug discovery timelines. In a recent study published in the Journal of Chemical Information and Modeling, [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241007134022.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "AI; Computer Assisted Drug Design; Journal of Chemical Information; HIV; Dedman College of Humanities; Sciences; Lyle School of Engineering; Elfi Kraka; Computational And Theoretical Chemistry Group; Despite AI; How SmartCADD Works SmartCADD; Pipeline Interface; Filter Interface; Corey Clark; SMU Guildhall; Collaboration Made SmartCADD Possible; Clark; Ayesh Madushanka; Donnell Data Science; Research Computing Institute; Eli Laird; Donnell Institute Ph; Interdisciplinary; Adds Laird; National Science Foundation; Southern Methodist University"
  },
  {
    "date": "2024-10-08T20:57:18Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/first-ovarian-cancer-vaccine.jpg",
    "title": "Groundbreaking Ovarian Cancer Vaccine at an \"Exciting\" Moment, Lead Scientist Says",
    "content": " Scientists at Oxford have started developing the world s first ovarian cancer vaccine, which they hope could soon eradicate the cancer once and for all.\nAs Sky News reports , the vaccine candidate is not unlike the vaccine for HPV (human papillomavirus), which has made major strides in cutting down the number of infections.\nIt s being developed to imbue the immune system with the ability to recognize and attack early-stage ovarian cancer cells.\nThe team behind the shot was just awarded a $785,000 grant by Cancer Research UK. But until it can be widely distributed, a lot of work remains to be done. [...]",
    "source_url": "https://futurism.com/neoscope/first-ovarian-cancer-vaccine",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "Groundbreaking Ovarian Cancer Vaccine; Exciting; Lead Scientist Says Scientists; Oxford; As Sky News; HPV; Cancer Research UK; University of Oxford; Ahmed Ahmed; Forbes; Ahmed"
  },
  {
    "date": "2024-10-08T15:58:20Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/nuclear-rockets-mars-problem.jpg",
    "title": "There’s a Big Problem With Using Nuclear Rockets to Get to Mars",
    "content": " Scientists have long proposed nuclear fission-fueled rockets to get to Mars fast — but one is warning that making it happen will be an uphill battle.\nIn an explainer for The Conversation , nuclear engineering expert Dan Kotlyar noted that fueling rockets with nuclear fission, which results from the energy emanated from splitting atoms, will indeed cut the years-long journey to and from Mars by a wide margin.\nOne of the chemical compounds that goes into the production of nuclear fuel, however, makes those dreams difficult to achieve.\nKotlyar, a nuclear and radiological engineering assistant professor at the Georgia Institute of Technology, pointed out [...]",
    "source_url": "https://futurism.com/the-byte/nuclear-rockets-mars-problem",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "Big Problem With Using Nuclear Rockets; Mars Scientists; Mars; Dan Kotlyar; One of; Georgia Institute of Technology; United States; General Electric; US Department of Energy; Global Threat Reduction Initiative; Biden"
  },
  {
    "date": "2024-10-08T16:40:19Z",
    "img": "https://www.cfca.nao.ac.jp/files/202410Asahina_fig1.jpg",
    "title": "Influence of a black hole s spin: First evidence of precession in ultraluminous accretion disks",
    "content": " Researchers at University of Tsukuba conducted innovative simulations of spinning black holes grounded in general relativity, which clarified that the ultraluminous accretion disk (i.e., gaseous spiral surrounding a black hole) exhibits a precessional motion driven by the black hole s spin. This finding underscores the potential of this spin to be the primary driver of the periodic fluctuations in luminosity observed within these ultraluminous accretion disks.\nGas swirls around a black hole (BH) owing to the intense gravity of the BH, forming an accretion disk. These accretion disks, being among the most efficient energy conversion mechanisms in the universe, emit light [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241007115449.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "University of Tsukuba; JSPS KAKENHI Grant Numbers; Promoting Researches; Supercomputer Fugaku; Evolution of the Universe Unraveled; Fusion of Simulation; AI; Grant Number; RIKEN Center; Computational Science; Project ID; ATERUI II; National Astronomical Observatory of Japan; University of Tokyo; Odyssey"
  },
  {
    "date": "2024-10-08T18:01:01Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/great-white-shark-bite-1-7066628-1728410857700.jpg",
    "title": "Ocean research device victim of great white shark attack off Nova Scotia shore",
    "content": " Clark Richards, a research scientist with the federal department, says his colleagues are confident the bite marks on an ocean glider used to track ocean data are from a great white -- a species known for their sharp, serrated teeth.\nFisheries and Oceans Canada sends autonomous ocean gliders into the ocean as part of a program to gather data on salinity and temperature and to track small particles in sea water.\nAt around 9 a.m. on Sept. 22, Richards says one of the five gliders in the program was about 300 metres below the ocean s surface when it suddenly malfunctioned.\nThe shark [...]",
    "source_url": "https://atlantic.ctvnews.ca/ocean-research-device-victim-of-great-white-shark-attack-off-nova-scotia-shore-1.7066626",
    "source_name": "CTVnews",
    "category": "Technology",
    "keywords": "Nova Scotia; Clark Richards; Oceans Canada; Richards; LIVE UPDATES; Hurricane Milton; Yucatan Peninsula; Florida; American; An American; TikTok; NDP; Tom Mulcair; Conservative Leader Pierre Poilievre; Baby Boomers; Star Trek; Chris Pine; When Digz the Dog Met Zurl the Squirrel; Short Tale About; Short Tail; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T17:07:30Z",
    "img": "https://images.squarespace-cdn.com/content/v1/5c96943c840b16870d5c01fe/8a4a4382-3b23-4f4b-a2c0-ca43251be5e0/navigator_550.jpg?format=1500w",
    "title": "New apps will enable safer indoor navigation for visually impaired",
    "content": " Two new apps will enable blind people to navigate indoor buildings with spoken directions from a smartphone app, providing a safe method of wayfinding where GPS doesn t work.\nUC Santa Cruz professor of Computer Science and Engineering Roberto Manduchi has devoted much of his research career to creating accessible technology for the blind and visually impaired. Throughout years of working with these communities, he has learned that there is a particular need for tools to help with indoor navigation of new spaces.\n\"Moving about independently in a place that you don t know is particularly difficult, because you don t have [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008103803.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "GPS; UC Santa Cruz; Computer Science; Engineering Roberto Manduchi; ACM Transactions; Accessible Computing; Apple; Google; Google Maps; Instead; Baskin Engineering; AI; Santa Cruz; Emily Cerf; University of California"
  },
  {
    "date": "2024-10-08T22:24:31Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/disguised-doctor-fake-covid-murder.jpg",
    "title": "Scheming Doctor Wears Disguise During Fake COVID Shot Murder Plot",
    "content": " In England, a doctor injected his mom s boyfriend with a toxic substance while wearing a disguise in an attempt to prevent the older man from inheriting property.\nAs CBS News reports , Sunderland, UK-based doctor Thomas Kwan has been found guilty after admitting to the complex murder plot, which involved him tricking his mom s partner into thinking he was giving him a COVID booster shot.\nIn January, the 53-year-old general practitioner went to great lengths to convince his mom s partner, 72-year-old Patrick O Hara, that he was a nurse administering the vaccine. Besides using a wig and fake facial [...]",
    "source_url": "https://futurism.com/neoscope/disguised-doctor-fake-covid-murder",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "Scheming Doctor Wears Disguise During Fake COVID Shot Murder Plot In England; As CBS News; UK; Thomas Kwan; COVID; In January; Patrick; Jenny Leung; CBS; As the Guardian"
  },
  {
    "date": "2024-10-08T19:18:28Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/this-timelapse-of-the-northern-lights-taken-from-space-utterly-breathtaking.jpg",
    "title": "This Timelapse of the Northern Lights Taken From Space Is Utterly Breathtaking",
    "content": " NASA astronaut Matthew Dominick has shared a breathtaking timelapse he took of red and green auroras outside the window of SpaceX s Endeavour Crew Dragon spacecraft, which is currently docked at the International Space Station.\nWhile clocking in at a brief 11 seconds, the clip shows off a dazzling view of charged particles glowing in magenta and turquoise hues as they enter the Earth s atmosphere.\nDominick stitched together \"a couple thousand images\" for the video. While it was taken out of the window of one Crew Dragon spacecraft, a second SpaceX capsule docked at a different port of the ISS can be seen [...]",
    "source_url": "https://futurism.com/the-byte/timelapse-northern-lights-space-breathtaking",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "This Timelapse of the Northern Lights Taken From Space Is Utterly Breathtaking NASA; Matthew Dominick; SpaceX; Endeavour Crew Dragon; International Space Station; Crew Dragon; ISS; Hurricane Milton; Florida; Red; Dragon Endeavour; Dragon Freedom; As the Sun"
  },
  {
    "date": "2024-10-08T18:16:03Z",
    "img": "https://www.psych.ox.ac.uk/images/teenage-depression-from-cannabis-use/responsive_image?ratio=image&scale=w1140",
    "title": "Mental health app could help prevent depression in young people at high risk",
    "content": " A cognitive behavioural therapy (CBT) app has been found to significantly prevent increases in depression in young people who are at high risk -- and could be implemented as a cost effective public mental health measure.\nGlobally, concern is growing about the high and steadily increasing rates of anxiety and depression in young people. Effective and scalable ways of preventing poor mental health in this group are needed, and digital tools such as mobile apps have been proposed as part of the solution.\nWhilst there is emerging evidence for mental health apps being effective in treating anxiety and depression, this project led [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008103818.htm",
    "source_name": "sciencedaily.com",
    "category": "Technology",
    "keywords": "CBT; University of Exeter; Lancet Digital Health; Horizon; Professor Ed Watkins; UK; Germany; Belgium; Spain; German; Danish; LMU Munich; Ghent University; Universitat Jaume; University of Oxford; Tom Seymour"
  },
  {
    "date": "2024-10-08T18:22:04Z",
    "img": "https://wordpress-assets.futurism.com/2024/10/hurricane-milton-powerful.jpg",
    "title": "Hurricane Milton Is so Insanely Powerful, It’s Literally Just a Giant Red Smudge on Meteorological Maps",
    "content": " The hurricane, which emerged as a tropical storm in the Gulf of Mexico over the weekend and is expected to make landfall on the western coast of Florida this evening, was declared an epic Category Five hurricane yesterday after rapidly intensifying in the gulf.\nThe scale of the storm is staggering: wind speeds have topped a treacherous 180 miles per hour with sustained gusts of over 200 miles per hour. Over one million Floridians were urged to evacuate.\nMeteorologists and storm experts, meanwhile, have taken to social media to detail the magnitude of the severe weather event.\n\"This is nothing short of astronomical,\" reads [...]",
    "source_url": "https://futurism.com/the-byte/hurricane-milton-powerful",
    "source_name": "futurism.com",
    "category": "Technology",
    "keywords": "Hurricane Milton Is; Insanely Powerful; Literally Just; Giant Red Smudge; Meteorological Maps; Gulf of Mexico; Florida; Category Five; Floridians; Orlando; Noah Bergren; Twitter; Milton; Red; Category; Hurricane Helene; North Carolina; Tennessee; Though Milton; Hurricane Rita; Louisiana; Texas; But Rita; PM; Atlantic; Floridians of; Tampa Mayor Jane Castor; CNN"
  },
  {
    "date": "2024-10-09T01:37:02Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/c6c5/live/ac7ce250-8578-11ef-83dd-fbf1b9732cf0.jpg",
    "title": "Netanyahu warns Lebanon of  destruction like Gaza",
    "content": " Israel s prime minister has made a direct appeal to urge the Lebanese people to throw out Hezbollah and avoid \"destruction and suffering like we see in Gaza\".\nBenjamin Netanyahu s appeal on Tuesday came as Israel expanded its ground invasion against Hezbollah by sending thousands more troops into a new zone in south-west Lebanon.\nNetanyahu also claimed the Israel Defense Forces had killed the successor to Hezbollah s former leader, Hassan Nasrallah, but the IDF later said it could not confirm Hashem Safieddine s death.\nElsewhere, Hezbollah s fighters launched barrages of rockets towards the Israeli port city of Haifa for the [...]",
    "source_url": "https://www.bbc.com/news/articles/cly3x1w0595o",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Netanyahu; Lebanon; Gaza Israel; Lebanese; Hezbollah; Gaza; Benjamin Netanyahu; Israel; Israel Defense Forces; Hassan Nasrallah; IDF; Hashem Safieddine; Israeli; Haifa; Tuesday Hassan Nasrallah; Naim Qassem; Palestinians; Hamas; Reuters Many; Beirut; On Tuesday; UN; Syria; Syrian; World Food Programme; AFP An; Kiryat Yam; Tuesday The IDF; Suhail Husseini; Nasrallah; Daniel Hagari; Lebanese Parliament Speaker; Nabih Berri; Haifa Bay; Upper Galilee; On Sunday"
  },
  {
    "date": "2024-10-08T22:22:19Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/trump-called-putin-after-leaving-office--woodward-1-7066647-1728411686926.jpg",
    "title": "Woodward book reveals Trump s calls with Putin and Biden s private remarks on Obama and Netanyahu",
    "content": " Donald Trump has had as many as seven private phone calls with Vladimir Putin since leaving office and secretly sent the Russian president COVID-19 test machines during the height of the pandemic, Bob Woodward reported in his new book, “War.\"\nSteven Cheung, Trump s communications director, denied the accounts in the book. “None of these made up stories by Bob Woodward are true and are the work of a truly demented and deranged man who suffers from a debilitating case of Trump Derangement Syndrome,” Cheung said in a statement.\nTrump had previously spoken to Woodward for the journalist s 2021 book, “Rage.” [...]",
    "source_url": "https://www.ctvnews.ca/world/woodward-book-reveals-trump-s-calls-with-putin-and-biden-s-private-remarks-on-obama-and-netanyahu-1.7066644",
    "source_name": "CTVnews",
    "category": "World",
    "keywords": "Woodward; Trump; Putin; Biden; Obama; Netanyahu Donald Trump; Vladimir Putin; Russian; COVID; Bob Woodward; Steven Cheung; Trump Derangement Syndrome; Florida; Mar; Lago; Jason Miller; But Miller; Russia; Hillary Clinton; Democratic; Robert Mueller; Ukraine; Putin COVID; President Kamala Harris; Howard Stern; American; Harris; Netanyahu; Israel; Hamas; With Netanyahu; Israeli; Mideast; White House; Emilie Simons; President Barack Obama; Crimea; Democrat; Barack; One of Trump; South Carolina Sen; Lindsey Graham; Graham; North Korea; In March; Middle East; Saudi; New York; Hillel Italie; Eric Tucker; Washington; Aamer Madhani; Air Force One; LIVE UPDATES; National Hurricane Center; Hurricane Milton; Category; Tampa; Daytona Beach; Liberal; Parliament; Deputy Prime Minister Chrystia Freeland; Conservative; Ontario Ministry of Health; Marc Garneau; Fort Chipewyan; Alta; Transport Minister Anita Anand; On September; Madeleine Gervais; Loblaws; College Square; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T22:39:06Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/gas-pumps-1-7066918-1728423753135.jpg",
    "title": "The hunt for gasoline is adding to Floridians  anxiety as Milton nears",
    "content": " Florida gas stations struggled to keep up with demand Tuesday as long lines and empty pumps compounded the stress for residents planning to hunker down or flee as Hurricane Milton approached the state s western coast.\nGov. Ron DeSantis said during a morning news conference that state officials, including the Florida Highway Patrol, were working with fuel companies to continue bringing in gasoline ahead of Milton s expected landfall on Wednesday. Troopers escorted 27 fuel trucks to stations Monday night, DeSantis said.\nPatrick De Haan, an analyst for GasBuddy, said \"replenishments are happening,\" but about 16.5 per cent of Florida stations were [...]",
    "source_url": "https://www.ctvnews.ca/world/the-hunt-for-gasoline-is-adding-to-floridians-anxiety-as-milton-nears-1.7066908",
    "source_name": "CTVnews",
    "category": "World",
    "keywords": "Floridians; Milton; Florida; Hurricane Milton; Gov; Ron DeSantis; Florida Highway Patrol; DeSantis; Patrick De Haan; Tampa; St; De Haan; Stephanie Grover; Brock; Ralph Douglas; Martin Oakes of Apollo Beach; Ned Bowman; Florida Petroleum Marketers Association; Bowman; McGill; New Orleans LIVE UPDATES; National Hurricane Center; Category; Daytona Beach; American; Liberal; Parliament; Deputy Prime Minister Chrystia Freeland; Conservative; Ontario Ministry of Health; Marc Garneau; Fort Chipewyan; Alta; Transport Minister Anita Anand; On September; Madeleine Gervais; Loblaws; College Square; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-09T02:02:05Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/fire-100624-gya-6.jpg",
    "title": "Absolute shock : Resident charged with arson following explosion at Calgary townhome complex",
    "content": " Defoe said he knew of Robinson but the two did not have a personal relationship and had rarely spoken. He now questions whether Robinson experienced some form of mental illness — though he does not hold sympathy for his neighbour under the circumstances, should the allegations be proven in court.\n“It’s the lack of respect and care for the people that were living in this unit. He knew that there were multiple families, young kids … he had every opportunity to stop what he was doing,” Defoe said.\nHelen Pena, whose aunt and uncle were two of the six people taken to [...]",
    "source_url": "https://calgaryherald.com/news/local-news/northeast-calgary-fire-investigation-families-seek-answers",
    "source_name": "calgaryherald.com",
    "category": "World",
    "keywords": "Robinson; Helen Pena; Lenin Pastran; Mirella Bautista; Bautista"
  },
  {
    "date": "2024-10-08T22:22:22Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/c4bd/live/f4063730-85a9-11ef-a9c9-470d3c15ff2c.jpg",
    "title": "New book says Trump secretly sent Covid tests to Putin during shortage",
    "content": " A new book by veteran Watergate reporter Bob Woodward says Donald Trump secretly sent coveted Covid-19 tests to Vladimir Putin for personal use when it was in short supply, a claim angrily dismissed by the Trump campaign.\nThe book -titled War- also includes a claim that Trump has secretly stayed in touch with Putin since leaving office, according to excerpts cited by US media.\nThe Trump campaign said none of these \"made-up stories\" were true.\n“President Trump gave him absolutely no access for this trash book that either belongs in the bargain bin of the fiction section of a discount bookstore or used [...]",
    "source_url": "https://www.bbc.com/news/articles/c33vjjg8k3yo",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Trump; Covid; Putin; Bob Woodward; Donald Trump; Vladimir Putin; US; President Trump; Steven Cheung; BBC; Woodward; Richard Nixon; Calling Woodward; New York Times; Mar; Lago; White House; Abbott Point of Care Covid; Russia; Department of Justice; President Joe Biden; Merrick Garland; Hunter; Garland"
  },
  {
    "date": "2024-10-08T23:08:05Z",
    "img": "https://assets.nationbuilder.com/therebel/pages/115691/meta_images/original/2024.10.05_-_RNL_Calgary_-_Danielle_Smith_HR_TI_meta.png?1728413811",
    "title": "Premier Smith discusses  hate speech provision  after Rebel News hit with human rights complaint",
    "content": "  My personal view on hate speech has been that the Criminal Code already draws the lines, and it has to be a very high bar,  said Premier Smith.\nRemove Ads\nAlberta Premier Danielle Smith spoke with  about hate speech laws and human rights complaints at this year s Rebel News LIVE! event in Calgary.\nLevant informed Smith that Rebel News has been hit with a human rights complaint under the so-called \"hate speech provision.\" While discussing the complaint — which was not filed in Alberta — Levant noted that B.C, Saskatchewan, and Alberta still include the hate speech provision in their jurisdictions.\nLevant [...]",
    "source_url": "http://www.rebelnews.com/premier_smith_discusses_hate_speech_provision_after_rebel_news_hit_with_human_rights_complaint",
    "source_name": "rebelnews.com",
    "category": "World",
    "keywords": "Premier Smith; Rebel News; Criminal Code; Remove Ads Alberta Premier Danielle Smith; Rebel News LIVE; Levant; Smith; Saskatchewan"
  },
  {
    "date": "2024-10-08T23:20:04Z",
    "img": "https://assets.nationbuilder.com/therebel/pages/115713/meta_images/original/Social_Image_Bloc_NDP.jpg?1728427566",
    "title": "Bloc, NDP have yet to discuss calls for early election: report",
    "content": " Bloc Leader Yves-François Blanchet said he would initiate discussions for an early election should the Liberals not meet their demands. They may  bring down the government  if progress is not made by October 29.\nRemove Ads\nDespite threatening to topple the Trudeau government, the Bloc Québécois has yet to initiate talks with the NDP amid repeated calls for an early election.\n“As House leaders, we’re reaching out to all the parties every day, but I think there’s a difference between what they might be saying publicly and what they’re actually doing privately,” NDP House Leader Peter Julian told CTV News when [...]",
    "source_url": "http://www.rebelnews.com/bloc_ndp_calls_for_early_election",
    "source_name": "rebelnews.com",
    "category": "World",
    "keywords": "Bloc; NDP; Bloc Leader Yves; Fran; Blanchet; Liberals; Remove Ads Despite; Trudeau; Bloc Qu; As House; NDP House Leader Peter Julian; Leader Yves; An Act To Amend the Old Age Security Act; Julian; New Democrats; NDP House Leader; New Democrat Leader Jagmeet Singh; Supply And Confidence Agreement; Singh; Tory Leader Pierre Poilievre; Parliament; Conservative; Justin Trudeau; Prime Minister; Rebel News"
  },
  {
    "date": "2024-10-08T23:16:03Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/a169/live/c87352e0-85c4-11ef-9f88-4dccbd7db95d.jpg",
    "title": "Afghan man arrested in alleged US Election Day terror plot",
    "content": " The US Department of Justice has arrested a man who allegedly planned a terror attack on Election Day in the name of the Islamic State.\nThe suspect, Nasir Ahmad Tawhedi, 27, is a citizen of Afghanistan residing in Oklahoma City, Oklahoma, according to prosecutors.\n“This defendant, motivated by ISIS, allegedly conspired to commit a violent attack, on Election Day, here on our homeland,\" said FBI Director Christopher Wray in a statement on Tuesday.\nThe FBI said he was attempting stockpile firearms, and had taken steps to liquidate his family s assets and relocate members overseas.         [...]",
    "source_url": "https://www.bbc.com/news/articles/cd7x0pj5xzdo",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Afghan; US Election Day; US Department of Justice; Election Day; Islamic State; Nasir Ahmad Tawhedi; Afghanistan; Oklahoma City; Oklahoma; ISIS; FBI Director Christopher Wray; FBI"
  },
  {
    "date": "2024-10-08T11:38:20Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/7/roe-v-wade-1-7065025-1728326016396.jpg",
    "title": "Georgia top court reinstates ban on abortions after six weeks",
    "content": " Georgia s highest court reinstated a ban on nearly all abortions after about six weeks of pregnancy on Monday while it considers the U.S. state s appeal of last week s ruling by a lower court judge blocking the law.\nThe order from the Supreme Court of Georgia allows the ban to take effect at 5 p.m. on Monday.\nThe lawsuit challenging the ban was brought by Atlanta-based SisterSong Women of Color Reproductive Justice Collective.\n\"Today, the Georgia Supreme Court sided with anti-abortion extremists,\" SisterSong executive director Monica Simpson said in a statement. \"Every minute this harmful six-week abortion ban is in place, [...]",
    "source_url": "https://www.ctvnews.ca/health/georgia-top-court-reinstates-ban-on-abortions-after-six-weeks-1.7065014",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Georgia; Supreme Court of Georgia; Atlanta; SisterSong Women of Color Reproductive Justice Collective; Georgia Supreme Court; Monica Simpson; Georgians; Georgia Governor Brian Kemp; Republican; Fulton County Superior Court Judge Robert McBurney; Supreme Court; Roe; Wade; Reporting By Brendan Pierson; New York; Bill Berkrot; Alexia Garamfalvi; Hurricane Milton; Yucatan Peninsula; Florida; Kamala Harris; Donald Trump; Hurricane Helene; Election Day; Nobel Prize; University of Toronto; Geoffrey Hinton; Princeton University; John Hopfield; Amazon; Despite Hurricane Milton; Category; Walt Disney World Resort; Kathy Bates; Oscar; AI; Lululemon; Chip Wilson; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Chantal Kreviazuk; Winnipeg; Shopping Trends; Read"
  },
  {
    "date": "2024-10-03T10:24:27Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/1/caesarean-section-1-7058536-1727826281211.jpg",
    "title": "Woman with rare double uterus gives birth to twins",
    "content": " A woman with the rare condition of two uteruses delivered twins, one from each womb, last month at a hospital in northwestern China, according to health officials and state media.\nThe mother, identified only be her last name Li, welcomed a boy and a girl via caesarean section, the Xi’an People’s Hospital in Shaanxi province said, calling it a “one in a million” occurrence.\n“It is extremely rare for twins to be conceived naturally in each cavity of the uterus, and even rarer for them to be carried to term,” the hospital said on its official account on China’s X-like social media [...]",
    "source_url": "https://www.ctvnews.ca/health/woman-with-rare-double-uterus-gives-birth-to-twins-1.7058532",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "China; Li; Xi; Shaanxi; NEW With; American; Investigates Drug; Mexican; Narco Jungle; Death Train; Avery Haines; DEVELOPING An Israeli; Beirut; Hezbollah; Coquitlam; Google; Novavax; COVID; Nikolaj Sorensen; Office of the Sport Integrity Commissioner; An Ontario; Saudi Arabia; Mrs; Universe; South Korea; Kirstie Allsopp; Europe; Vancouver Asahi; Kaye Kaminishi; On Saturday; Delaware; Ont; Olympic; Paris; Larder Lake; Powell River"
  },
  {
    "date": "2024-10-08T21:51:37Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/what-women-should-know-about-breast-cancer-1-7066673-1728413664855.jpg",
    "title": "What women should know about their breasts, according to a doctor",
    "content": " Most women should receive a mammogram beginning at age 40 every other year until they reach age 74, according to a recent U.S. Preventive Services Task Force recommendation. (Pexels)\nShare\nIt’s time to think about your breasts — not just this month because it’s Breast Cancer Awareness Month, but every month.\nOne in eight women will be diagnosed with invasive breast cancer in their lifetimes, according to the American Cancer Society. Breast cancer is the second leading cause of cancer death for women in the United States, with 42,000 women dying every year from this cancer.\nThese numbers are especially sobering because when breast cancer is caught in its earliest [...]",
    "source_url": "https://www.ctvnews.ca/health/what-women-should-know-about-their-breasts-according-to-a-doctor-1.7066669",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Preventive Services Task Force; Share It; Breast Cancer Awareness Month; American Cancer Society; United States; CNN; Dr; Leana Wen; George Washington University; Baltimore; US Preventive Services Task Force; MRI; American College of Radiology; LIVE UPDATES; National Hurricane Center; Hurricane Milton; Category; Florida; Tampa; Daytona Beach; American; Marc Garneau; Liberal; Fort Chipewyan; Alta; Transport Minister Anita Anand; Palestinian; Hezbollah; Hamas; On September; Madeleine Gervais; Loblaws; College Square; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-07T18:14:33Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/7/hurricane-helene-1-7064908-1728321289899.jpg",
    "title": "Food poisoning dangers are real after severe weather. Here s how to protect yourself",
    "content": " Hurricanes and other natural disasters often create a cascade of unexpected complications, including extended power and water outages, flooding, mold damage and other emergencies. Now add the increased danger of food poisoning to that list.\nThere is the possibility for a rise in foodborne illnesses like salmonella and E. coli after natural disasters, according to the US Centers for Disease Control and Prevention, when power outages affect cold storage.\nIf your household has recently been hit by a power outage, here are ways to keep your food safe:\nUnder normal circumstances, your fridge should be kept at 40 degrees Fahrenheit or below and [...]",
    "source_url": "https://www.ctvnews.ca/health/food-poisoning-dangers-are-real-after-severe-weather-here-s-how-to-protect-yourself-1.7064900",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Hurricanes; US Centers; Disease Control; CDC; CNN; Dr; Leana Wen; Bill Marler; Seattle; Hurricane Helene; Florida; Octavio Jones; CNN Newsource; DEVELOPING Hurricane Milton; Category; Mexico; North York; Sammy Basso; Italian Progeria Association; Labrador; Inuit; Indigenous; Liberal; Indigenous Peoples; Lawyers; Russian; American; Ukraine; COVID; Hamas; Israel; Gaza; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Chantal Kreviazuk; Winnipeg; New York City; Manitoba; Shopping Trends; Read"
  },
  {
    "date": "2024-10-01T20:55:28Z",
    "img": "https://globalnews.ca/wp-content/uploads/2024/07/20240709160720-450151fbced2ed1f88e26bddf826fd90f52235dfc51466d61da737140d9ad46b.jpg?quality=85&strip=all&w=720&h=379&crop=1",
    "title": "Breast cancer is rising among U.S. young women even as deaths drop: study",
    "content": " The number of deaths from breast cancer is on the decline, but new data out of the U.S. shows the prevalence of cases among women under 50 years of age is rising.\nThat has advocates for breast cancer screening once again urging change in Canada.\nThe study, published in  on Tuesday, found the number of deaths declined by 44 per cent between 1989 and 2022.\nThere were roughly 518,000 fewer deaths overall during that time span, though it notes certain demographics have not seen the same decline. American Indian/Alaska Native women saw no reduction in mortality, while Black women have a 38 [...]",
    "source_url": "https://globalnews.ca/news/10788070/breast-cancer-cases-rise-deaths-drop-young-women-risk/",
    "source_name": "globalnews.ca",
    "category": "Health",
    "keywords": "American Indian; Alaska Native; Black; Carson; Certainly; Sign Up In; Canadian Cancer Society; Canada More; Asian; American; Pacific Islander; Trending Now There; Canadian Task Force; Preventative Health Care; Health Minister Mark Holland; Angus Reid"
  },
  {
    "date": "2024-10-08T17:16:58Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/5/31/mammogram-1-6908558-1717173713264.jpg",
    "title": "Ontario lowers the age for self-referral mammogram breast screening to age 40",
    "content": " In this July 31, 2012 file photo, a radiologist compares an image from earlier, 2-D technology mammogram to the new 3-D Digital Breast Tomosynthesis mammography in Wichita Falls, Texas. (Torin Halsey/Times Record News via AP, File)\nShare\nThe Ontario government has lowered the age for regular mammogram breast screening to allow all woman between the age of 40 and 49 to self-refer for the service.\nThe province issued a news release on Tuesday announcing that the change will began immediately and will give an additional one million woman in Ontario the option to get screened earlier.\n“Breast cancer affects one in every nine women [...]",
    "source_url": "https://toronto.ctvnews.ca/ontario-lowers-the-age-for-self-referral-mammogram-breast-screening-to-age-40-1.7066321",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Digital Breast Tomosynthesis; Wichita Falls; Texas; Torin Halsey; Times Record News; AP; Share The Ontario; Minister of Health Sylvia Jones; Ontarians; Andrea Seale; CEO of the Canadian Cancer Society; Hurricane Milton; Yucatan Peninsula; Florida; American; An American; Elections BC; NDP; Tom Mulcair; Conservative Leader Pierre Poilievre; Baby Boomers; Shopping Trends; Read"
  },
  {
    "date": "2024-10-03T17:37:34Z",
    "img": "https://globalnews.ca/wp-content/uploads/2024/10/GettyImages-151035343.jpg?quality=85&strip=all&w=720&h=379&crop=1",
    "title": "Marburg virus: What Canadians need to know about fears spread in Germany",
    "content": " German emergency personnel in full protective gear shut down two railroad tracks at Hamburg’s central station on Wednesday after two passengers were suspected of having contracted the deadly Marburg virus.\nA 26-year-old medical student and his girlfriend developed flu-like symptoms while on a train from Frankfurt, according to local reports . The train was evacuated after health authorities suspected they had contracted the Marburg virus — a rare disease that has a fatality rate as high as 88 per cent.\nThe suspicion arose because the student had recently arrived by plane from Rwanda, where he had been in contact with a patient [...]",
    "source_url": "https://globalnews.ca/news/10792090/marburg-virus-germany-health-scare-canada-risk/",
    "source_name": "globalnews.ca",
    "category": "Health",
    "keywords": "Marburg; What Canadians; Germany German; Hamburg; Frankfurt; Rwanda; Marburg Rwanda; Africa; Ebola; Dr; Isaac Bogoch; Toronto General Hospital; Like Ebola; Sign Up; Germany; Serbia; African; Uganda; Angola; Democratic Republic of the Congo; Kenya; South Africa; Guinea"
  },
  {
    "date": "2024-10-04T22:48:26Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/3/bat-1-7061354-1727990641059.jpg",
    "title": "How bat health could be linked to human health",
    "content": " \"White-nose syndrome, unfortunately, has decimated populations of little brown bats,\" explained Quinn Webber, pointing to a poster of different bat species in his office.\nWebber, who works in the integrative biology department and is also a behavioural ecologist, said the disease has devastated bat populations. It wakes the flying mammals from hibernation, causes them to waste valuable winter energy and, eventually, they starve to death.\nIt attributes the deaths to higher pesticide use by farmers due to the declining bat population, since they are excellent at pest control.\nBut Webber urges caution when citing that study.\n\"I suppose in the United States, in the [...]",
    "source_url": "https://kitchener.ctvnews.ca/how-bat-health-could-be-linked-to-human-health-1.7062768",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "White; Quinn Webber; Webber; But Webber; United States; An Ontario; NDP House; Peter Julian; Parliament; Colorado; Jacob Hoggard; Prince Edward Island; French; Old Montreal; Noovo Info; Antarctica; Shopping Trends; Read"
  },
  {
    "date": "2024-10-04T11:17:26Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2021/10/7/royal-university-hospital--1-5615541-1633644184623.jpg",
    "title": "Saskatchewan s largest hospital hits crisis point as overstuffed ER runs out of stretchers and oxygen",
    "content": " Staff at Saskatoon s Royal University Hospital (RUH) are calling for systemic changes just two days after its emergency room was more than three times above its capacity.\n\"It s worse than it ever has been,\" NDP Saskatoon Fairview candidate Vicki Mowat said outside of the hospital Thursday morning.\n\"We don t have time to wait for help. When you have admitted patients in a hospital that don t even have a chair to sit in, things are at a breaking point.\"\nVicki Mowat speaking to reporters at the Saskatchewan Legislative Building on Dec. 20, 2023. (Courtesy: Saskatchewan NDP)\nAccording to data from the [...]",
    "source_url": "https://saskatoon.ctvnews.ca/saskatchewan-s-largest-hospital-hits-crisis-point-as-overstuffed-er-runs-out-of-stretchers-and-oxygen-1.7061463",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Saskatchewan; ER; Saskatoon; Royal University Hospital; NDP Saskatoon Fairview; Vicki Mowat; Saskatchewan Legislative Building; Saskatchewan NDP; Saskatchewan Union of Nurses; SUN; Regina Thursday; Tracy Zambory; Prince Albert; Saskatchewan Party; Scott Moe; Moe; NDP; City Hospital; Sask; Old Age Security; Liberal; Bank of Canada; GST; HST; WestJet; An Israeli; Lebanon; Syria; REVIEW CTV; Richard Crouse; Joker; Deux; Garth Brooks; Los Angeles; Investigates In; Avery Haines; Darian Gap; North York; Ligeng Guo; Shopping Trends; Read"
  },
  {
    "date": "2024-10-02T19:16:30Z",
    "img": "https://globalnews.ca/wp-content/uploads/2024/10/GettyImages-1007965142.jpg?quality=85&strip=all&w=720&h=379&crop=1",
    "title": "Cold and flu season: What can Canadians expect this year?",
    "content": " As temperatures drop and more Canadians head indoors, the familiar sniffles, aches and pains may soon follow, signaling the arrival of cold and flu season .\nIn Canada, flu season typically runs from November to April, and while anyone can catch the flu, the virus can sometimes lead to severe complications — even death, which is why experts stress the importance of the annual flu shot.\nIn preparation,  some provinces are  over the next few weeks, beginning with vulnerable groups before expanding to the general public.\n2:24\nWhen will Albertans be able to receive fall COVID-19, flu vaccinations?\nThe dominant strain this year is [...]",
    "source_url": "https://globalnews.ca/news/10788454/cold-and-flu-season-canada-what-to-expect/",
    "source_name": "globalnews.ca",
    "category": "Health",
    "keywords": "In Canada; Albertans; COVID; Gerald Evans; Queen; University; Kingston; Ont; South America; Australia; New Zealand; Southern Hemisphere; RSV; Evans; Kevin Chan; London; Sign Up; What the Australians"
  },
  {
    "date": "2024-10-08T19:09:45Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/condom-use-in-canada-1-7066577-1728407800231.jpg",
    "title": "Report suggests decrease in condom use among Canadian youth, lack of safe-sex education",
    "content": " A new report that looks at the sex lives of Canadian youth suggests more needs to be done to encourage safe sex, including reversing a decrease in condom use.\nIn a survey conducted by Angus Reid for the charity LetsStopAIDS , 24 per cent of participants said they use condoms \"all the time.\" That s compared to 53 per cent who said they always used condoms in 2020.\nOne in five said they d never used a condom.\nLetsStopAIDS released Tuesday the results of its annual national survey of more than 1,100 Canadians aged 18 to 24.\nSix per cent of survey respondents said [...]",
    "source_url": "https://www.ctvnews.ca/health/report-suggests-decrease-in-condom-use-among-canadian-youth-lack-of-safe-sex-education-1.7066561",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Angus Reid; HIV; Shamin Mohamed Jr; STI; Mohamed Jr; World Health Organization; In Canada; Public Health Agency of Canada; Canadian Medical Association; CP; LIVE UPDATES; Hurricane Milton; Yucatan Peninsula; Florida; American; Marc Garneau; Liberal; An American; NDP; Tom Mulcair; Conservative Leader Pierre Poilievre; Lower Mainland; Australia; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T12:24:22Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/doctor-holds-a-senior-s-hand-1-7065988-1728389214825.jpg",
    "title": "Baby Boomers are living longer than previous generations but have worse health, study finds",
    "content": " A study has found that Baby Boomers are more likely to have worse health than previous generations, despite living longer. (skynesher/E+/Getty Images via CNN Newsource)\nShare\nLONDON -\nBaby Boomers may be expected to  live longer than their predecessors, but a recent study has found that they are more likely to suffer from worse health than previous generations.\nResearchers at the University of Oxford and University College London (UCL) found that people born since 1945 have worse health than previous generations at the same age, resulting in what they call a \"generational health drift.\"\n\"We found that Baby Boomers are more likely to have doctor-diagnosed diabetes, [...]",
    "source_url": "https://www.ctvnews.ca/health/baby-boomers-are-living-longer-than-previous-generations-but-have-worse-health-study-finds-1.7065987",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Baby Boomers; CNN Newsource; Share LONDON; University of Oxford; University College London; Laura Gimeno; CNN Monday; United States; England; Europe; Greatest Generation; BMI; US; Baby Boomer; Gen; Hurricane Milton; Yucatan Peninsula; Florida; Gulf Coast; Helene; Ian; Kamala Harris; Donald Trump; Hurricane Helene; Election Day; Amazon; Nobel Prize; University of Toronto; Geoffrey Hinton; Princeton University; John Hopfield; Despite Hurricane Milton; Category; Walt Disney World Resort; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Chantal Kreviazuk; Winnipeg; Shopping Trends; Read"
  },
  {
    "date": "2024-10-03T16:58:38Z",
    "img": "https://globalnews.ca/wp-content/uploads/2024/10/CP173257528.jpg?quality=85&strip=all&w=720&h=379&crop=1",
    "title": "‘I have no options’: Canadians criticize lack of Novavax COVID shot",
    "content": " The federal government’s decision to not provide Novavax’s COVID-19 vaccine this respiratory virus season raises health equity concerns, experts and advocates say, as some Canadians look to the U.S. to get the shot.\nThe Public Health Agency of Canada said it won’t provide the protein-based vaccine called Nuvaxovid because the manufacturer required a minimum order that far exceeds last year’s uptake of the vaccine.\nThe health agency said 125,000 Nuvaxovid doses were ordered in 2023, but only 5,529 were administered. This fall, it will only supply provinces and territories with the reformulated Pfizer-BioNTech and Moderna mRNA COVID-19 vaccines.\nBut some Canadians who say [...]",
    "source_url": "https://globalnews.ca/news/10792064/novavax-vaccine-unavailable-canada/",
    "source_name": "globalnews.ca",
    "category": "Health",
    "keywords": "Novavax COVID; Novavax; COVID; Public Health Agency of Canada; Pfizer; BioNTech; Moderna; Linda Wilhelm"
  },
  {
    "date": "2024-09-30T19:37:28Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/9/29/cheo-1-7056611-1727652599699.jpg",
    "title": "Fundraiser in honour of young girl raises $66K for Ottawa s children s hospital",
    "content": " Pat Trimm (right) and Cheryl Smith (centre right) handing a cheque of $66,500 to CHEO staff in honour of Kendyl Smith-Trimm. (Brad Quinn/CTV News Ottawa)\nShare\nThe family of Kendyl Smith-Trimm, a young girl who bravely battled cancer, has raised a staggering $66,500 in her memory for the Children s Hospital of Eastern Ontario (CHEO).\nOn Sunday, her mother Cheryl Smith and father Pat Trimm from Pembroke, Ont. awarded the hospital with a cheque in honour of Kendyl, who they described as \"loving\" and \"caring.\"\n\"Kendyl was a gift from God to us,\" Smith said in an interview.\n\"She loved to have fun and loved [...]",
    "source_url": "https://ottawa.ctvnews.ca/fundraiser-in-honour-of-young-girl-raises-66k-for-ottawa-s-children-s-hospital-1.7056589",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "Pat Trimm; Cheryl Smith; CHEO; Kendyl Smith; Brad Quinn; CTV News Ottawa; Hospital of Eastern Ontario; On Sunday; Pembroke; Ont; God; Smith; On Aug; Trimm Caring; Kids Endowment Fund; Kids CHEO Fundraiser; Que; CHEO Foundation; Ottawa Valley; Pat; Megan Doyle Ray; Valley; Doyle Ray; Austin Lee; Parliament Hill; INVESTIGATES This; Avery Haines; Darien Gap; Hurricane Helene; North Carolina; Sam Perkins; Health Canada; Foreign Affairs Minister Melanie Joly; United Nations; Dikembe Mutombo; Basketball Hall of Famer; NBA; Himalayas; Everest; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T16:53:59Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/wegovy-weight-loss-drug-1-7066517-1728405959934.jpg",
    "title": "WeightWatchers to offer compounded version of Novo Nordisk s weight-loss drug",
    "content": " Soaring demand for weight-loss drugs such as Wegovy and Eli Lilly s Zepbound, shown to help patients lose as much as 20 per cent of weight on average, has led to their shortages that allowed drug compounders to produce them under U.S. regulations.\nMultiple telehealth companies, including Noom and Hims & Hers Health, offer compounded versions of semaglutide, the chemical name of Novo s Wegovy and its diabetes drug Ozempic, as patients look for alternatives amid their shortage.\nDrug compounding refers to the practice of combining, mixing or altering drug ingredients to create a medicine tailored for an individual patient s need, [...]",
    "source_url": "https://www.ctvnews.ca/health/weightwatchers-to-offer-compounded-version-of-novo-nordisk-s-weight-loss-drug-1.7066362",
    "source_name": "CTVnews",
    "category": "Health",
    "keywords": "WeightWatchers; Novo Nordisk; Wegovy; Eli Lilly; Zepbound; Hers Health; Novo; Ozempic; Drug Administration; WW International; US; Outsourcing Facilities Association; FDA; Lilly; Mounjaro; Puyaan Singh; Shilpi Majumdar; Hurricane Milton; Yucatan Peninsula; Florida; American; An American; Elections BC; NDP; Tom Mulcair; Conservative Leader Pierre Poilievre; Baby Boomers; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T18:26:30Z",
    "img": "https://www.embl.org/news/wp-content/uploads/2024/09/20240918_Mattei-1000x600-1.jpg",
    "title": "What we can learn from hungry yeast cells",
    "content": " What can stressed yeast teach us about fundamental processes in the cell? A lot, according to scientists at the European Molecular Biology Laboratory (EMBL). The team studies, among other topics, how cells adapt to stress -- such as nutrient deprivation. One of their favourite test subjects is the yeast species S. pombe, for centuries used in traditional brewing. As a eukaryote, it s in many ways similar to human cells, so biologists often use it as model organism to study fundamental cellular processes.\nRibosomes turn upside-down in hungry cells\nScientists have observed that yeast cells have a remarkable adaptation to starvation: their [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008122552.htm",
    "source_name": "sciencedaily.com",
    "category": "Science",
    "keywords": "European Molecular Biology Laboratory; Intrigued; Mattei Team; EMBL Heidelberg; Jomaa Lab; University of Virginia School of Medicine; Olivier Gemin; EIPOD Postdoctoral Fellow; Team Leader Simone Mattei"
  },
  {
    "date": "2024-10-09T00:27:20Z",
    "img": "https://1408440223.rsc.cdn77.org/images/2024-10/2024_10_08_05.jpg",
    "title": "El Niño linked to accelerated ice loss in tropics",
    "content": " Natural climate patterns such as El Niño are causing tropical glaciers to lose their ice at an alarming rate, a new study has found.\nA phenomenon that typically occurs every two to seven years, El Niño causes much warmer than average ocean temperatures in the eastern Pacific, significantly affecting weather around the globe.\nThe Quelccaya Ice Cap (QIC) in the Peruvian Andes has been shown to be sensitive to these climate shifts, but the extent to which El Niño contributes to its continued shrinkage has, to date, been unclear.\nNow, using images captured by NASA Landsat satellites over the past four decades, researchers [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008163942.htm",
    "source_name": "sciencedaily.com",
    "category": "Science",
    "keywords": "El Ni; Pacific; Quelccaya Ice Cap; Peruvian Andes; NASA Landsat; Kara Lamantia; Byrd Polar; Research Climate Center; Ohio State University; Peru; All of; La Ni; National Science Foundation; Simons Foundation; Volo Foundation; Lonnie Thompson; Bryan Mark; Ohio State; Laura; Larocca of Arizona State University; Tatyana Woodall"
  },
  {
    "date": "2024-10-08T18:54:30Z",
    "img": "https://www.uibk.ac.at/media/filer_public_thumbnails/filer_public/33/4d/334d62de-a9c6-492a-9b66-e58430c421f8/ocg-saving-the-ocean-rxjzisqaq-w-unsplash.jpg__995x597_q85_crop_subject_location-2940%2C1960_subsampling-2_upscale.jpg.webp",
    "title": "One-time cooperation decisions unaffected by increased benefits to society",
    "content": " A new study published in the Proceedings of the National Academy of Sciences (PNAS) challenges long-held assumptions about human cooperation. Traditionally, behavioral scientists and economists have primarily studied cooperation in public good contexts through repeated interactions, where individuals can build trust and reciprocal relationships, adjusting their behavior based on the actions of others. However, many real-world, naturally occurring situations, such as volunteering or donating to crisis relief efforts, are one-time decisions with no obvious future interactions or relationships to consider. This new study, co-authored by Dr. Natalie Struwe and Prof. Esther Blanco from the University of Innsbruck with Prof. James [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008122350.htm",
    "source_name": "sciencedaily.com",
    "category": "Science",
    "keywords": "Proceedings of the National Academy of Sciences; Dr; Natalie Struwe; Esther Blanco; University of Innsbruck; James Walker; Indiana University; Natalie Struwe of the Department of Public Finance; Professor Esther Blanco of the Department of Public Finance; UK; Professor James Walker; Department of Economics of Indiana University; Key Findings"
  },
  {
    "date": "2024-10-09T00:51:19Z",
    "img": "https://d1v1e13ebw3o15.cloudfront.net/data/85536/pool_and_spa_master/..jpg",
    "title": "Atomic-level mechanism in polycrystalline materials",
    "content": " Researchers at the University of California, Irvine and other international institutions have for the first time achieved atomic-scale observations of grain rotation in polycrystalline materials. Widely used in electronic devices, aerospace technologies, automotive applications and solar energy systems, these substances have long been studied for their unique properties and structural dynamics.\nUsing state-of-the-art microscopy tools housed in the UC Irvine Materials Research Institute, scientists were able to heat samples of platinum nanocrystalline thin films and observe the mechanism driving grain rotation in unprecedented detail. Their findings are the subject of a paper published recently in Science.\nThe study employed advanced techniques such [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008201417.htm",
    "source_name": "sciencedaily.com",
    "category": "Science",
    "keywords": "University of California; UC Irvine Materials Research Institute; Science; Xiaoqing Pan; UC Irvine Distinguished Professor; UC IMRI; UC Irvine; Department of Physics; Astronomy; Henry Samueli Endowed Chair; UC Irvine Center; Active Materials; Yutong Bi; Ying Han; Yuan Tian; Mingjie Xu of UC Irvine; Xiaoguo Gong; David Srolovitz of the University of Hong Kong; Leonardo Velasco Estrada of Colombia National University; Evgeniy Boltynjuk of Germany; Karlsruhe Institute of Technology; Horst Hahn of the University of Oklahoma; Caihao Qiu; Jian Han of City University of Hong Kong; National Science Foundation; Materials Research Science; Engineering Centers; Army Research Office; Hong Kong Research Grants Council"
  },
  {
    "date": "2024-10-09T00:04:18Z",
    "img": "https://iiif.elifesciences.org/journal-cms/for-the-press-content%2F2024-10%2Fimage-20241008141446-1.jpeg/full/344,/0/default.webp",
    "title": "New seed fossil sheds light on wind dispersal in plants",
    "content": " Scientists have discovered one of the earliest examples of a winged seed, granting insight into the origin and early evolution of wind dispersal strategies in plants.\nThe study, published today as the final Version of Record after previously appearing as a Reviewed Preprint in eLife, details the second-earliest known winged seed -- Alasemenia -- from the Late Devonian epoch, roughly 360-385 million years ago. The authors use what the editors call solid mathematical analysis to demonstrate that Alasemenia s three-winged seeds are more adapted to wind dispersal than one, two and four-winged seeds.\nWind dispersal in plant seeds is a natural mechanism [...]",
    "source_url": "https://www.sciencedaily.com/releases/2024/10/241008150236.htm",
    "source_name": "sciencedaily.com",
    "category": "Science",
    "keywords": "Version of Record; Reviewed Preprint; Late Devonian; Deming Wang; Key Laboratory of Orogenic Belts; Crustal Evolution; Department of Geology; Peking University; Beijing; China; Xinhang Town; Anhui Province; Pu Huang; Nanjing Institute of Geology; Chinese Academy of Sciences"
  },
  {
    "date": "2024-10-08T23:18:26Z",
    "img": "https://i.cbc.ca/1.7245644.1719321796!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/hockey-nhl-fla-edm.JPG",
    "title": "We re going to do this together : Determined Edmonton Oilers ready for their comeback",
    "content": " Connor McDavid, Leon Draisaitl and the Edmonton Oilers are out to avenge losing to Florida by a goal after erasing a 3-0 series deficit, with their sights set on the championship that has eluded them.\nEdmonton Oilers defenceman Evan Bouchard, goaltenders Calvin Pickard (30) and  Stuart Skinner, and captain Connor McDavid react to the team s loss to Florida in Game 7 of the Stanley Cup final. (Jim Rassol/USA Today Sports via Reuters)\nConnor McDavid is still stinging from losing Game 7 of the Stanley Cup final by the slimmest of margins. Leon Draisaitl cannot keep thinking about it.\n\"I m not [...]",
    "source_url": "https://www.cbc.ca/news/canada/edmonton/we-re-going-to-do-this-together-determined-edmonton-oilers-ready-for-their-comeback-1.7346245?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Determined Edmonton Oilers; Connor McDavid; Leon Draisaitl; Edmonton Oilers; Florida; Evan Bouchard; Calvin Pickard; Stuart Skinner; Stanley Cup; Jim Rassol; USA Today Sports; McDavid; NHL; Draisaitl; Cup; Oilers; Winnipeg Jets; Edmonton Oiler; US; Sean Panganiban; Oilers Nation; BetMGM Sportsbook; Panthers; Western Conference; Central Division; Dallas; Colorado; Pittsburgh; Hopefully; Longtime; Ken Holland; Detroit GM; Red Wings; Penguins; Holland; Stan Bowman; Bowman; Certainly; Corey Perry; Adam Henrique; Viktor Arvidsson; Jeff Skinner; An August; Philip Broberg; Dylan Holloway; St; Louis; By September; Conn Smythe Trophy; MVP"
  },
  {
    "date": "2024-10-08T22:29:37Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/05/golf-graphic-2.jpg",
    "title": "Hole-in-one report: Two aces during Tournament of Champions",
    "content": " This is a darn good way to cap a round — and a season. Dawn Bullen was one-and-done on No. 18 at Willow Park, draining a dynamite driver from 162 yards away.\nVic Berezan buried a beauty on the sixth at River’s Edge. Berezan smoked a seven-iron in a howling wind and was bang-on from the 120-yard blocks.\nJay Langlois and Hans Sorensen each completed their career hole-in-one hat-tricks. Langlois made short work of No. 9 at Hamptons, sinking a nifty nine-iron on that 160-yard test. Sorensen, meanwhile, was gripping his own nine-iron for an ace on No. 15 at Redwood Meadows, [...]",
    "source_url": "https://calgaryherald.com/sports/golf/hole-in-one-report-two-aces-during-tournament-of-champions",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Tournament of Champions This; Dawn Bullen; Willow Park; Vic Berezan; River; Jay Langlois; Hans Sorensen; Hamptons; Sorensen; Redwood Meadows; Arcy Ranch; Gordon Good; Teresita Santos; Carnmoney; Dennis Ramlal; Fox Hollow; Marcus Matzeit; Lee Drewry; Jim Uttley; Springbank Links; Cole Huse; Maple Ridge; Kim Isotti; Winston Golf Club; Larry Vetsch; Shaganappi Point; Curtis Thiessen"
  },
  {
    "date": "2024-10-08T23:20:17Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/cfl-stampders-051424-gya-11.jpg",
    "title": "Matt Shiltz likely in for Stamps at QB for Battle of Alberta",
    "content": " The call to arms for The Battle would mark Shiltz’s first start for the Stamps, after signing on with the Red and White in the off-season.\n“My first taste of (the Battle of Alberta), so if I do get to play, I’m excited for that,” said the 31-year-old Shiltz, who threw for 4,357 yards and 19 touchdowns over six previous seasons combined with the Montreal Alouettes and then the Hamilton Tiger-Cats.\n“At the end of the day, it’s for a lot of guys that may not have gotten opportunities throughout the year that get to showcase who they are, what they can [...]",
    "source_url": "https://calgaryherald.com/sports/football/cfl/calgary-stampeders/matt-shiltz-calgary-stampeders-qb-vs-edmonton-elks",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Matt Shiltz; Stamps; QB; Battle of Alberta; Shiltz; Red; White; Montreal Alouettes; Hamilton Tiger; Cats; St; Instead; Logan Bonner; Labour Day Replay; Maier; TDs; In Week; Lions; QB Maier; TD; Marken Michel; NCAA Butler Bulldogs; Reggie Begelton; BC Place; NFL QB; Walker; Toronto Argonauts; Dickenson; Elizabeth; NFL; Carolina Panthers; Cleveland Browns; WR Cam Echols; Hopefully; WR Jalen Philpot; WR Ishmael Hyman; DB Demerio Houston; WR Clark Barnes"
  },
  {
    "date": "2024-10-08T18:35:25Z",
    "img": "https://smartcdn.gprod.postmedia.digital/montrealgazette/wp-content/uploads/2023/10/0925-spt-col-cowan.jpg",
    "title": "Blacked out on TSN2 or RDS? Here s how to watch Canadiens games from Ontario and Western Canada",
    "content": " Year 11 of Rogers’s 12-year, $5.2-billion NHL rights deal is pretty well the same as last year — rights to Canadiens games are shared between Sportsnet and TSN in English and TVA Sports and RDS in French. But Rogers threw an additional complication in this year when it resold rights to Monday night games to Amazon. Five Canadiens Monday night games this season will be exclusive to Amazon Prime Video subscribers in English.\nWe don’t have the power to change the policy, but we’ll try to do our best here to explain it and give you options.\nNational Hockey League games are [...]",
    "source_url": "https://montrealgazette.com/sports/hockey/nhl/montreal-canadiens/blacked-out-on-sportsnet-or-rds-heres-how-to-watch-canadiens-games-from-ontario-and-western-canada",
    "source_name": "Montreal Gazette",
    "category": "Sports",
    "keywords": "RDS; Canadiens; Western Canada Year; Rogers; NHL; Sportsnet; TSN; TVA Sports; French; But Rogers; Amazon; Five Canadiens Monday; Amazon Prime Video; National Hockey League; English Canadian; French Canadian; National; Exclusive; Buffalo Sabres; Sportsnet Generally; New York City; Saskatchewan; Oilers; Flames; Jets; NFL; TV; In French; Montreal Gazette"
  },
  {
    "date": "2024-10-08T20:41:20Z",
    "img": "https://i.cbc.ca/1.7346453.1728419126!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/raonic-milos-240619-1180.jpg",
    "title": "Raonic to replace Auger-Aliassime on Canada s team at Davis Cup Final 8",
    "content": " Milos Raonic will replace Felix Auger-Aliassime on the Canadian team at the Davis Cup Final 8 next month. Tennis Canada says Auger-Aliassime plans to recover from the season and devote time to his humanitarian work in Togo.\nFor the Davis Cup Final 8 in November, Milos Raonic, pictured, joins a Canadian roster that includes Denis Shapovalov, Gabriel Diallo, Alexis Galarneau and Vasek Pospisil. (Luke Walker/Getty Images for LTA/File)\nMilos Raonic will replace Felix Auger-Aliassime on the Canadian team at the Davis Cup Final 8 next month.\nTennis Canada says Auger-Aliassime, from Montreal, plans to recover from the season and devote time to his [...]",
    "source_url": "https://www.cbc.ca/sports/tennis/milos-raonic-davis-cup-final8-replacement-auger-aliassiime-1.7346447?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Raonic; Auger; Aliassime; Davis Cup Final; Milos Raonic; Felix Auger; Tennis Canada; For the Davis Cup Final; Denis Shapovalov; Gabriel Diallo; Alexis Galarneau; Vasek Pospisil; Luke Walker; Germany; Spain; Thornhill; Ont; Denis Shapovalov of Richmond Hill; Alexis Galarneau of Laval; Que; Vasek Pospisil of Vernon; At No; ATP Tour; West Africa; ATP; Arthur Ashe Humanitarian Award; Milos Raonic of Thornhill; Britain; Cameron Norrie; Queen; Club Championships"
  },
  {
    "date": "2024-10-08T17:55:05Z",
    "img": "https://globalnews.ca/wp-content/uploads/2024/10/2024100716104-2024100715104-adae011954ff2da4c90e417d13a5c37bd1248abb92ec171ef7de4f1f70261713.jpg?quality=85&strip=all&w=720&h=379&crop=1",
    "title": "Gradey Dick ready to earn starters role on Raptors",
    "content": " Increase article font size\nGradey Dick is willing to do whatever the Toronto Raptors need of him.\nDick saw big minutes for a rookie last season as the Raptors were decimated by injuries through March and April. Entering his sophomore NBA campaign, Dick doesn’t intend to lobby head coach Darko Rajakovic or anyone else for a starting role — he wants to earn his spot.\n“I’m going to try my best to be in the position that the team needs,” said Dick before Raptors training camp began. “It’s not me pushing my agenda. It’s really the role that I need to fill and [...]",
    "source_url": "https://globalnews.ca/news/10798933/gradey-dick-ready-to-earn-starters-role-on-raptors/",
    "source_name": "globalnews.ca",
    "category": "Sports",
    "keywords": "Gradey Dick; Raptors Increase; Toronto Raptors; Dick; Raptors; NBA; Darko Rajakovic; NBA Draft; Kansas Jayhawks; Gary Trent Jr; Rajakovic; League"
  },
  {
    "date": "2024-10-08T17:08:43Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/1211021564.jpg",
    "title": "Stampeders add former NFL QB P.J. Walker",
    "content": " He was an integral part of team’s Weeks 5-7 of the NFL schedule, helping the Browns to wins over the visiting San Francisco 49ers — 19-17 — and the host Indianapolis Colts — 39-38 — before a 24-20 loss to the host Seattle Seahawks. In those respective games, Walker went: 19-of-34 for 192 passing yards and two interceptions; 15-of-32 for 178 passing yards and one INT; and 15-of-31 for 248 passing yards with two touchdowns and one INT.\nBut most important is he has big-league pedigree.\nThe Stampeders (4-10-1), who were eliminated from the CFL playoff picture over the weekend, host the [...]",
    "source_url": "https://calgaryherald.com/sports/football/cfl/calgary-stampeders/stampeders-add-former-nfl-qb-p-j-walker",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Stampeders; NFL QB; Walker He; NFL; Browns; San Francisco; Indianapolis Colts; Seattle Seahawks; CFL; Edmonton Elks; McMahon Stadium; TSN; QR Calgary; Matt Shiltz; Maier; Marken Michel; QB; Houston Roughnecks; NCAA; Temple Owls; American Athletic Conference; Temple"
  },
  {
    "date": "2024-10-08T18:29:21Z",
    "img": "https://i.cbc.ca/1.7346249.1728412285!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/barrett-rj-241006-1180.jpg",
    "title": "Raptors swingman RJ Barrett sidelined rest of pre-season with sprained right shoulder",
    "content": " RJ Barrett of the Toronto Raptors will miss the rest of the NBA pre-season after sustaining a right shoulder sprain in Sunday s 125-98 pre-season victory over the Washington Wizards in Montreal.\nRJ Barrett, right, left Sunday s 125-98 pre-season victory in Montreal over the Washington Wizards in the second quarter with a right shoulder injury. (Minas Panagiotakis/Getty Images)\nRJ Barrett will miss the rest of the Toronto Raptors  pre-season with an injury.\nBarrett left Sunday s 125-98 pre-season victory over the Washington Wizards in the second quarter with a right shoulder injury, which occurred after he ran through a screen set [...]",
    "source_url": "https://www.cbc.ca/sports/basketball/nba/rj-barrett-sprained-shoulder-toronto-raptors-nba-pre-season-1.7346234?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Raptors; RJ Barrett; RJ Barrett of the Toronto Raptors; NBA; Washington Wizards; Minas Panagiotakis; Toronto Raptors; Barrett; Jonas Valanciunas; New York Knicks; Knicks"
  },
  {
    "date": "2024-10-08T21:36:18Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/Flames-v-Jets-P2-copy.jpg",
    "title": "Calgary Flames season preview: ‘We’re excited to prove people wrong’",
    "content": " “We have a sneaky amount of talent in this room. We have some pace. We have some physicality. We have a little bit of everything. If everyone does their job and plays well and does it collectively, we’re good.”\nThere are surprise squads in every NHL season, teams that manage to ride a sizzling start to a spring playoff invite.\nThe Canucks did exactly that in 2023-24, although Calgary can’t claim the same sort of star power. There’s no Quinn Hughes or Elias Pettersson on this roster.\nSo what has to go right for the Flames to exceed expectations?\nThey’ll need strong performances from [...]",
    "source_url": "https://calgaryherald.com/sports/hockey/nhl/calgary-flames/calgary-flames-season-preview-excited-prove-people-wrong",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Calgary Flames; NHL; Canucks; Quinn Hughes; Elias Pettersson; Flames; Dan Vladar; Dustin Wolf; Ryan Huska; Yegor Sharangovich; Huberdeau; Lomberg; Hopefully; Vegas; Somebody; Starting Wednesday"
  },
  {
    "date": "2024-10-09T00:44:16Z",
    "img": "https://i.cbc.ca/1.7346698.1728429093!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/soc-nsl-montreal-20241008.JPG",
    "title": "A perfect fit : Roses FC unveiled as name of Montreal s Northern Super League franchise",
    "content": " The women s professional soccer franchise unveiled the team s name and logo on Tuesday night, projecting the new emblem and the club s blue, red and gold colours around an event space near the city s Old Port.\nMontreal s Northern Super League team will be known as Roses FC.\nAnd coming to that conclusion wasn t a snap decision for team president Annie Larouche.\n\"We started working on this back in November,\" Larouche said. \"It wasn t done with four of us on the corner of the table saying,  Let s go for this one, let s find a bilingual [...]",
    "source_url": "https://www.cbc.ca/sports/soccer/nsl-womens-soccer-montreal-unveils-name-1.7346689?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Roses FC; Northern Super League; Old Port; Annie Larouche; Marie; Philip Poulin; Super Bowl; Laurent Duvernay; CF Montreal; Samuel Piette; League; Diana Matheson; ROSES; FC; Farine Five Roses; Lachine Canal; Roses; Montreal Roses; Les Roses; French; Isabele Chevalier; Jean; Francois Crevier; Vancouver Rise FC; Ottawa Rapid FC; Halifax Tides FC; Calgary Wild FC; AFC Toronto; NSL; Professional Women; Hockey League; Verdun Auditorium; Place Bell; Bell Centre; Canadian Elite Basketball League; Montreal Alliance; Marinette Pichon; Robert Rositoiu; Europe; Each NSL; NWSL; United States; US; Canadian Olympians; Evelyne Viens; AS Roma; Italy; Gabrielle Carle of the NWSL; Washington Spirit; Vanessa Gilles"
  },
  {
    "date": "2024-10-08T20:22:30Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/Flames-Practice-copy-1.jpg",
    "title": "25 things we wonder about the 2024-25 Calgary Flames",
    "content": " We wonder if Sam Honzek can stick in the NHL for the entire season. Sometimes, rookies will hit a wall — like, for example, Matt Coronato did a year ago — and require a minor-league stint. Even if that turns out to be true with Honzek, the 19-year-old has served notice of a very bright future.\nWe wonder if Jonathan Huberdeau can find his game again. It has not been a great start to Huberdeau’s tenure in Calgary. After picking up only 55 points in his first season at the Saddledome, that number shrunk to 52 in 2023-24. He’s the team’s [...]",
    "source_url": "https://calgaryherald.com/sports/hockey/nhl/calgary-flames/25-things-wonder-2024-25-calgary-flames",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Calgary Flames We; Sam Honzek; NHL; Matt Coronato; Honzek; Jonathan Huberdeau; Huberdeau; Saddledome; Nazem Kadri; Kadri; Flames; Connor Zary; Martin Pospisil; Andrei Kuzmenko; Yegor Sharangovich; Adam Klapka; Klapka; Wranglers; Canucks; Kuzmenko; Elias Lindholm; West Coast; Ryan Lomberg; Lomberg; Stanley Cup; Anthony Mantha; Mantha; Daniil Miromanov; Noah Hanifin; Vegas Golden Knights; Miromanov; Brayden Pachal; Ryan Huska; Pospisil; Kevin Rooney; Sam Morton; Morton; Dan Vladar; Jacob Markstrom; Dustin Wolf; Boston Bruins; MacKenzie Weegar; American Hockey League; NHLer; Zary; Craig Conroy"
  },
  {
    "date": "2024-10-08T21:01:24Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/Flames-v-Jets-P1-copy.jpg",
    "title": "Pospisil encourages Honzek to play with  F-you  mindset ahead of Flames debut",
    "content": " “Even though he’s a young guy, I think he does some quiet things around our room that show a little bit of leadership starting to creep out.”\nRecommended from Editorial\nHonzek has been the biggest story of training camp at the Saddledome this year. Pospisil being shifted from the wing to centre to play alongside Jonathan Huberdeau and Anthony Mantha is one of the most intriguing lineup moves the Flames have made heading into the 2024-25 regular season, too.\nAnd while they’re not identical players, there are still lessons that the 19-year-old Honzek can learn from the only slightly older 24-year-old Pospisil.\nAnd working [...]",
    "source_url": "https://calgaryherald.com/sports/hockey/nhl/calgary-flames/martin-pospisil-encourages-sam-honzek-mindset-flames-debut",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Pospisil; Honzek; Flames; Editorial Honzek; Saddledome; Jonathan Huberdeau; Anthony Mantha; Slovakia; And Pospisil; Huberdeau; Mantha; Ryan Huska"
  },
  {
    "date": "2024-10-08T22:25:34Z",
    "img": "https://i.cbc.ca/1.7346653.1728426056!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sluchinski-aaron-240307-1180.jpg",
    "title": "Kevin Koe recruits skip Aaron Sluchinski to join men s curling team",
    "content": " Kevin Koe has added Aaron Sluchinski to his men s curling team after the four-time Canadian champion played a three-man team since firing second Jacques Gauthier in September.\nA newcomer to the Kevin Koe rink, Aaron Sluchinski skipped a team that upset Koe in the Alberta provincial men s final in February and also defeated him to open the national championship in Regina. (Darryl Dyck/Canadian Press/File)\nKevin Koe has added Aaron Sluchinski to his men s curling team.\nFour-time Canadian and two-time world champion Koe of Calgary has played a three-man team since firing second Jacques Gauthier in September.\nSluchinski skipped a team that [...]",
    "source_url": "https://www.cbc.ca/sports/olympics/winter/curling/kevin-koe-curling-team-aaron-sluchinski-1.7346613?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Kevin Koe; Aaron Sluchinski; Jacques Gauthier; Koe; Regina; Darryl Dyck; Koe of Calgary; Sluchinski"
  },
  {
    "date": "2024-10-08T20:21:32Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/Flames-Practice2-copy.jpg",
    "title": "Wilson: The Flames  big question marks heading into the season",
    "content": " To prove him right, Connor Zary and Martin Pospisil unexpectedly emerged as quality NHLers last season, while a half-dozen of other youngsters also made their debut in 2023-24.\nThanks to the GM’s restraint in free agency, there should be as much (or more) opportunity for darkhorse hopefuls to establish themselves this year.\nAn early list of intriguing names includes Matthew Coronato, Samuel Honzek, Jeremie Poirier, Artem Grushnikov and Sam Morton, among others.\nHonzek is the biggest surprise so far. The 16th overall pick in 2023, Honzek suffered through a disappointing, injury-plagued season in the WHL where he managed just 31 points in 33 [...]",
    "source_url": "https://calgaryherald.com/sports/hockey/nhl/calgary-flames/wilson-the-flames-big-question-marks-heading-into-the-season",
    "source_name": "calgaryherald.com",
    "category": "Sports",
    "keywords": "Wilson; Flames; Connor Zary; Martin Pospisil; NHLers; GM; Matthew Coronato; Samuel Honzek; Jeremie Poirier; Artem Grushnikov; Sam Morton; Honzek; WHL; Instead; Conroy; Top of; Andrei Kuzmenko; Canucks; Kuzmenko; Rasmus Andersson; Calgary Flames; Anaheim Ducks; Honda Center; Anaheim; California; Sean; Getty Images Jakob Pelletier; AHL; Matthew Phillips; Pelletier; NHL; Calgary Wranglers; Cinderella; Sean Monahan"
  },
  {
    "date": "2024-10-08T18:28:06Z",
    "img": "https://i.cbc.ca/1.7346183.1728410152!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/wallace-jack-220313-1180.jpg",
    "title": "Canada s men suffer overtime loss to U.S. early at International Para Hockey Cup",
    "content": " Jack Wallace scored 19 seconds into the overtime session to give the United States a 2-1 win over Canada at the IPH Cup para hockey tournament on Tuesday in Ostrava, Czech Republic.\nJack Wallace of the United States manoeuvred through the Canadian defence before beating netminder Corbin Watson 19 seconds into overtime for a 2-1 victory on Tuesday at the IPH Cup in Ostrava, Czech Republic. (Dita Alangkara/Associated Press/File)\nJack Wallace scored 19 seconds into the overtime session to give the United States a 2-1 win over Canada at the IPH Cup para hockey tournament on Tuesday in Ostrava, Czech Republic.\nDeclan Farmer [...]",
    "source_url": "https://www.cbc.ca/sports/paralympics/canada-united-states-recap-iph-cup-ostrava-1.7346180?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "International Para Hockey Cup Jack Wallace; United States; IPH Cup; Czech Republic; Jack Wallace of the United States; Corbin Watson; Dita Alangkara; Jack Wallace; Declan Farmer; Russ Herrington; Evan Nichols; Anton Jacobs; Webb; Italy; Jacobs"
  },
  {
    "date": "2024-07-17T13:19:40Z",
    "img": "https://i.guim.co.uk/img/media/b86b00e66b8d10999d964ad49d35377af6395bdb/0_655_1330_798/master/1330.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be94b1ad30154f886fe55e04290f83db",
    "title": "Drake’s Toronto mansion seriously flooded amid record breaking storms ",
    "content": " He shared footage on Instagram of ankle-deep muddy water rushing into an area of his home, with the caption “this better be espresso martini”.\nToronto experienced nearly 100mm (four inches) of rain on Tuesday, according to Environment Canada , surpassing a daily record that had stood since 1941. Some 167,000 customers were left without power according to the city’s electrical grid operator, Toronto Hydro.\nView image in fullscreen\nFlooding at Drake’s Toronto mansion, captured on his Instagram account. Photograph: Instagram\nEmergency services faced numerous callouts to people trapped in lifts thanks to the power cuts, while others had to be rescued from flooded motorways.\nDrake’s [...]",
    "source_url": "https://www.theguardian.com/music/article/2024/jul/17/drake-toronto-mansion-seriously-flooded-amid-record-breaking-storms",
    "source_name": "The Guardian",
    "category": "Entertainment",
    "keywords": "Drake; Instagram; Environment Canada; Toronto Hydro; Instagram Emergency; Bridle Path; Kendrick Lamar; Lamar; Not Like Us; US; Architectural Digest; Embassy"
  },
  {
    "date": "2024-07-17T15:06:33Z",
    "img": "https://www.rollingstone.com/wp-content/uploads/2024/07/katy-perry-comeback-flop.jpg?w=1600&h=900&crop=1",
    "title": "Katy Perry’s ‘Woman’s World’ and the End of 2010s Pop ",
    "content": " Of all the pop -culture questions we thought we’d be asking this summer, “What was Katy Perry thinking?” probably wasn’t high on anyone’s list. But here we are with “Woman’s World,” a fairly generic pop banger about female empowerment. Fine idea, but rarely has someone so misread the room. Crammed with cartoonish, fleshy pop-pinup imagery, the video was in line with Perry’s earlier, Day-Glo clips. But this one was widely savaged for being heavy-handed, empty of meaning, stereotypically sexualized, or out of step with the way women present themselves on record and in videos. (Seeing the controversial Dr. Luke’s name [...]",
    "source_url": "https://www.rollingstone.com/music/music-features/katy-perry-womans-world-backlash-op-ed-1235061347/",
    "source_name": "Rolling Stone",
    "category": "Entertainment",
    "keywords": "Katy Perry; World; Pop; Perry; Seeing; Dr; Luke; Instagram; If Perry; Lady Gaga; Rihanna; Kesha; Barack Obama; White House; Fame; Poker Face; Paparazzi; Just Dance; Teenage Dream; Last Friday Night; California Gurls; Top; Bad Romance; Beyonce; Rolling; Even Gotye; Somebody That; Used To Know; Peter Gabriel; Britney; Don; Stop the Music; Each; Tik Tok; Who We; Carly Rae Jepsen; Call Me Maybe; Born This Way; Roar; Max Martin; Hip; Sabrina Carpenter; Espresso; Carpenter"
  },
  {
    "date": "2024-07-17T11:09:36Z",
    "img": "https://img.huffingtonpost.com/asset/669787142200009200fefe5e.jpeg?cache=b7WB5eXXR5&ops=1200_630",
    "title": "Anthony Hopkins ‘Shocked And Appalled’ By Donald Trump Hannibal Lecter News ",
    "content": " Movie star Anthony Hopkins was asked about former President Donald Trump ’s apparent fixation on and repeated praise for the fictional serial killer Hannibal Lecter, who Hopkins won an Oscar for portraying in the 1991 horror film “The Silence Of The Lambs.”\nThe cannibalistic Lecter has “come up a lot during this election campaign here in America” with Trump “speaking about him at his rallies as if he’s a real person,” Deadline’s Dominic Patten noted to Hopkins in an interview published Tuesday.\nAdvertisement\nTrump, who is now the official GOP presidential nominee, has repeatedly referred to the character at rallies, usually during parts [...]",
    "source_url": "https://www.huffpost.com/entry/anthony-hopkins-donald-trump-hannibal_n_66977ee4e4b076f190eab9e5",
    "source_name": "HuffPost",
    "category": "Entertainment",
    "keywords": "Anthony Hopkins; Shocked And Appalled; By Donald Trump Hannibal Lecter News Movie; President Donald Trump; Hannibal Lecter; Hopkins; Oscar; Silence of the Lambs; Lecter; America; Trump; Dominic Patten; Advertisement Trump; GOP; Those About To Die; Hannibal; God; Oh; Advertisement Hopkins"
  },
  {
    "date": "2024-07-17T10:55:27Z",
    "img": "https://cst.brightspotcdn.com/dims4/default/2145dbd/2147483647/strip/true/crop/870x497+0+67/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fac%2Ffd%2F790f04b15195427014757adc0272%2Fgeorgia-nicols.jpg",
    "title": "Horoscope for Wednesday, July 17, 2024 - Chicago Sun-Times",
    "content": " This is a feel-good day! Travel if possible because you’re pumped to do something different that will expand your world. Make a point of learning new things, meeting new people and discovering new ideas. Publishing, medicine and the law will benefit.\nThis is a financially favorable day for you, which will be good news for you. You might see ways to boost your income. You might also do something to increase the assets of your home or your property. This is a perfect day to entertain at home.\nRelations with partners and close friends are friendly. You might be surprised by the [...]",
    "source_url": "https://chicago.suntimes.com/horoscopes/2024/07/17/horoscopes-today-wednesday-july-17-2024",
    "source_name": "Chicago Sun-Times",
    "category": "Entertainment",
    "keywords": "Horoscope; Chicago Sun; Times This; Publishing; Enjoy; Venus; Jupiter; Singer Jeremih"
  },
  {
    "date": "2024-07-17T17:22:34Z",
    "img": "https://www.rollingstone.com/wp-content/uploads/2024/07/GettyImages-2161155020.jpg?w=1600&h=900&crop=1",
    "title": "Alec Baldwin Plans to Sue Santa Fe Prosecutor, Sheriff After ‘Rust’ Charge Dismissal ",
    "content": " Alec Baldwin ’s lawyers have warned the Santa Fe sheriff and prosecutors of “future litigation” over their actions in the Rust shooting trial following  against the actor.\n“Specifically, we request that you immediately take all necessary steps, including preserving all devices, hard drives, emails, text messages, and other electronic communications, to preserve any and all documents, records, electronically stored information (‘ESI’), and other materials and data existing in any form whatsoever, that are actually or potentially relevant or relate in any way to the investigation(s) and/or prosecution(s) conducted by the State in connection with the death of Halyna Hutchins on [...]",
    "source_url": "https://www.rollingstone.com/tv-movies/tv-movie-news/alec-baldwin-lawsuit-santa-fe-prosecutor-sheriff-rust-charge-dismissal-1235062210/",
    "source_name": "Rolling Stone",
    "category": "Entertainment",
    "keywords": "Alec Baldwin Plans; Sue Santa Fe Prosecutor; Sheriff After; Rust; Charge Dismissal Alec Baldwin; Santa Fe; Halyna Hutchins; Baldwin; New Mexico Judge Mary Marlowe Sommer; Hollywood; Thell Reed; Hannah Gutierrez; Santa Fe County Sheriff; Office; Judge Marlowe Sommer; Judge Sommer; Marlowe Sommer"
  },
  {
    "date": "2024-07-17T11:21:34Z",
    "img": "https://www.theglobeandmail.com/resizer/v2/5FFHF5OJZNDXDE2OXVDA2MFHKA.png?auth=60b191d3022bbca3f16ac852c79f8a272fe58413787ab273d3b2863f0bd4445f&width=1200&height=801&quality=80",
    "title": "Your daily horoscope: July 17, 2024 ",
    "content": " It’s your life and it must always be your decision as to what you are going to do with it. Having said that, don’t close your ears to advice this year because a friend may see opportunities that you cannot. Your dream could be their dream too.\nIf you are losing interest in something you have been working on for the past few weeks it may be because you can sense you are destined for bigger and better things – and you’re right, you are. Why push ahead with something that no longer inspires you?\nYou may think you can do 10 [...]",
    "source_url": "https://www.theglobeandmail.com/life/horoscopes/article-your-daily-horoscope-july-17-2024/",
    "source_name": "The Globe and Mail",
    "category": "Entertainment",
    "keywords": "Don"
  },
  {
    "date": "2024-07-17T14:01:54Z",
    "img": "https://variety.com/wp-content/uploads/2024/04/Hannah-Gutierrez-Reed-Sentencing-6.jpg?w=1000&h=563&crop=1",
    "title": "‘Rust’ Armorer Wants Conviction Overturned After Alec Baldwin Case Collapses ",
    "content": " “ Rust ” armorer Hannah Gutierrez Reed is asking a judge to overturn her conviction, alleging she was subject to the same sort of prosecutorial misconduct that torpedoed the Alec Baldwin trial last week.\nGutierrez Reed was convicted in March of manslaughter in the death of cinematographer Halyna Hutchins. In a motion filed Tuesday , attorney Jason Bowles stated since then, he has received substantial evidence that should have been disclosed before the trial.\nBowles also asked that Gutierrez Reed be released from prison, and that special prosecutor Kari Morrissey be removed from the case due to misconduct. District Attorney Mary Carmack-Altwies [...]",
    "source_url": "https://variety.com/2024/film/news/rust-armorer-hannah-gutierrez-reed-alec-baldwin-suppressed-evidence-1236074767/",
    "source_name": "Variety",
    "category": "Entertainment",
    "keywords": "Rust; Armorer Wants Conviction Overturned After Alec Baldwin Case Collapses; Hannah Gutierrez Reed; Alec Baldwin; Gutierrez Reed; Halyna Hutchins; Jason Bowles; Kari Morrissey; District Attorney Mary Carmack; Morrissey; On Friday; Judge Mary Marlowe Sommer; Baldwin; Ms; Hutchins; Seth Kenney; Lucien Haag; Brady; Maryland; Marlowe Sommer; Bryan Carpenter; Gutierrez; This Court"
  },
  {
    "date": "2024-07-17T15:26:50Z",
    "img": "https://pagesix.com/wp-content/uploads/sites/3/2024/07/tom-sandoval-arian-madix-raquel-leviss-01.jpg?quality=75&strip=all&w=1024",
    "title": "Tom Sandoval sues Ariana Madix for accessing explicit Raquel Leviss videos without ‘permission’ ",
    "content": " Her court filing pointed out the “public recognition and professional opportunity” her fellow cast members received in the wake of the scandal, noting that she “remains a shell of her former self, with career prospects stunted and her reputation in tatters.”\nAlthough Sandoval  in April, a Los Angeles judge granted the “Rachel Goes Rogue” podcast host the right to continue suing him .\nMadix, for her part, has denied the claims and called them “an abuse of the legal process.”                      [...]",
    "source_url": "https://pagesix.com/2024/07/17/entertainment/tom-sandoval-sues-ariana-madix-for-accessing-explicit-raquel-leviss-videos/",
    "source_name": "Page Six",
    "category": "Entertainment",
    "keywords": "Tom Sandoval; Ariana Madix; Raquel Leviss; Although Sandoval; Los Angeles; Rachel Goes Rogue; Madix"
  },
  {
    "date": "2024-07-17T12:51:43Z",
    "img": "https://i.guim.co.uk/img/media/8746f5e076d75183df6f89228bfd44e9439b9d79/0_407_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6c2a8efe002711a18c050cbb51e641ee",
    "title": "LA punk legends X: ‘The violence didn’t bother me as much as the spitting!’ ",
    "content": " They chronicled 1980s Los Angeles as a nihilist nightmare and became a key voice in the city. Releasing their final album, they recall the wild parties – and rocky romances\nLos Angeles was so foundational to punk-rock pioneers X they named their 1980 debut album after it. For Brooklyn-raised bassist/singer John Doe, the city held all the promise of a new frontier. “I’d seen Talking Heads at CBGBs, the Heartbreakers at Max’s Kansas City,” he says. “I wanted to be in a band, and I packed up my shit and moved to LA because I loved movies and literature, and because [...]",
    "source_url": "https://www.theguardian.com/music/article/2024/jul/17/la-punk-legends-x-the-violence-didnt-bother-me-as-much-as-the-spitting",
    "source_name": "The Guardian",
    "category": "Entertainment",
    "keywords": "LA; Los Angeles; Releasing; For Brooklyn; John Doe; Talking Heads; Max; Kansas City; Exene Cervenka; St Petersburg; Florida; Hollywood; Illinois; Billy Zoom; Bret Easton Ellis; Less Than Zero; Venice Beach; Beyond Baroque; John; California; George Rose; Getty Images Cervenka; So John; DJ Bonebrake; Black Randy; Penelope Spheeris; Decline of Western Civilisation; Darby Crash; World; In My Kiss; Soul Kitchen; Ray Manzarek; Chuck Berry; Eddie Cochran; Los Angelenos; Must Not Think Bad Thoughts; Michael Wagener; Christian; Love Grand; Joel Selvin; Getty Images Zoom; Reunion; Big Black; Errol Flynn; Hollywood Hills"
  },
  {
    "date": "2024-07-17T15:14:36Z",
    "img": "https://pagesix.com/wp-content/uploads/sites/3/2024/07/85586497.jpg?quality=75&strip=all&w=1024",
    "title": "‘Top Chef Masters’ alum Naomi Pomeroy dead at 49 after freak tubing accident ",
    "content": " She also served as a guest judge on “Top Chef” and “Bobby’s Triple Threat.” Neilson Barnard\nPomeroy shuttered the doors to her popular restaurant, Beast, in 2020 due to the COVID-19 pandemic and opened a frozen custard shop, Cornet Custard, this past May. She also recently launched a dinner party series dubbed “Garden Party,” according to her Instagram .\nThe decorated cook left her mark on TV as a competitor in “Iron Chef” in 2010 and “Top Chef Masters” the next year.\nShe also served as a guest judge on “Knife Fight,” “Top Chef” and Bobby Flay’s “Bobby’s Triple Threat.”\nNaomi Pomeroy drowned in [...]",
    "source_url": "https://pagesix.com/2024/07/17/entertainment/chef-naomi-pomeroy-dead-at-49-after-freak-tubing-accident/",
    "source_name": "Page Six",
    "category": "Entertainment",
    "keywords": "Top Chef Masters; Naomi Pomeroy; Top Chef; Triple Threat; Neilson Barnard Pomeroy; COVID; Cornet Custard; Garden Party; Instagram; TV; Iron Chef; Knife Fight; Bobby Flay; Oregon; Kyle Linden Webster; Instagram Her; AP; Naomi"
  },
  {
    "date": "2024-07-17T15:34:48Z",
    "img": "https://nypost.com/wp-content/uploads/sites/2/2024/07/christina-hall-husband-josh-85589879.jpg?quality=75&strip=all&w=1024",
    "title": "Christina Hall’s husband Josh wondered ‘how long’ their marriage would last before split ",
    "content": " According to TMZ , Hall filed for a dissolution of marriage in Orange County, California. He cited irreconcilable differences as the reason for the split and listed July 8 as the separation date.\nChristina reportedly filed for divorce as well.\nIn his filing, Hall asked to be given spousal support from his wife and for the court to “eliminate” her “ability to collect from him.” \n10\nHe also reportedly wants the rights to any HGTV-Discovery Network shows that he and Christina produced together during their marriage.\nThey both star in her shows “Christina on the Coast” and “Christina in the Country” and have another show, “The [...]",
    "source_url": "https://nypost.com/2024/07/17/entertainment/christina-halls-husband-josh-wondered-how-long-marriage-would-last-before-split/",
    "source_name": "New York Post ",
    "category": "Entertainment",
    "keywords": "Christina Hall; Josh; TMZ; Hall; Orange County; California; Christina; HGTV; Discovery Network; Flip Off; Josh Hall; Instagram When Christina; Flip; Flop; Instagram; Tarek El Moussa; Taylor; El Moussa; Selling Sunset; Heather Rae El Moussa"
  },
  {
    "date": "2024-07-17T10:53:29Z",
    "img": "https://static01.nyt.com/images/2024/07/17/opinion/17weiner-image/17weiner-image-facebookJumbo.jpg",
    "title": "Opinion | We Owe Shannen Doherty an Apology ",
    "content": " If you were alive and sentient in the 1990s — whether you, like me, were a devoted fan of “Beverly Hills, 90210” and E! or you were just the most casual reader of People magazine — you knew this to be true. The sky is blue. The earth is round. Shannen Doherty, the star of multiple hit movies and television shows, is difficult. She was, per the tabloids, a volatile, unmanageable diva, and that reputation was only reinforced by the pouty, prima donna roles in which she was so often and so brilliantly cast.\nMs. Doherty died on Saturday, at the [...]",
    "source_url": "https://www.nytimes.com/2024/07/17/opinion/shannen-doherty-gen-x.html",
    "source_name": "The New York Times",
    "category": "Entertainment",
    "keywords": "Opinion; We Owe Shannen Doherty; Apology If; Beverly Hills; Shannen Doherty; Ms; Doherty; Instead; Gen; Britney Spears; Justin Timberlake; Katherine Heigl; Hollywood; Emmy; Knocked Up; Megan Fox; Michael Bay; Britney; MeToo; Fox; Brenda Walsh; West Beverly High; Jennie Garth; Tori Spelling; When Aaron Spelling; Charmed; Reader; Times"
  },
  {
    "date": "2024-07-17T15:39:44Z",
    "img": "https://variety.com/wp-content/uploads/2024/07/glen-powell.webp?w=1000&h=563&crop=1",
    "title": "Box Office: ‘Twisters’ Aims to Stir Up $55 Million Debut ",
    "content": " The movie, a standalone sequel to the 1996 disaster epic “Twister,” is expected to generate a sizable $50 million to $55 million when it touches down in 4,000 North American theaters over the weekend. “Minari” filmmaker Lee Isaac Chung directed “Twisters,” which stars Daisy Edgar-Jones, Glen Powell and Anthony Ramos as storm chasers who find themselves in the fight of their lives as multiple tornadoes converge over central Oklahoma.\n“Twisters” cost $155 million to produce, so its backers at Universal need the movie to resonate globally to justify that price tag. Warner Bros. is releasing the film internationally, where “Twisters” has [...]",
    "source_url": "https://variety.com/2024/film/news/twisters-box-office-opening-weekend-estimate-1236073914/",
    "source_name": "Variety",
    "category": "Entertainment",
    "keywords": "Box Office; Twisters; Stir Up; Million Debut; Twister; North American; Lee Isaac Chung; Daisy Edgar; Jones; Glen Powell; Anthony Ramos; Oklahoma; Warner Bros; Europe; France; Germany; Italy; United Kingdom; Helen Hunt; Bill Paxton; Cary Elwes; Philip Seymour Hoffman; Oscar; Rotten Tomatoes; Owen Gleiberman; Powell; Disney; Pixar; Inside Out; Despicable Me; And Neon; Longlegs; Marvel; Deadpool; Wolverine; Ryan Reynolds; Hugh Jackman"
  },
  {
    "date": "2024-07-17T16:58:41Z",
    "img": "https://static.foxnews.com/foxnews.com/content/uploads/2024/07/cody-johnson.jpg",
    "title": "Cody Johnson nails national anthem at MLB All Star Game following Ingrid Andress’ ‘drunk’ performance ",
    "content": " Country singer Cody Johnson hit a home run with his national anthem performance at the MLB All-Star Game in Texas on Tuesday night, just one day after singer-songwriter Ingrid Andress went viral for her pained rendition, which she later admitted she performed while \"drunk.\"\nJohnson, 37, was welcomed by the crowd at Globe Life Field in Arlington just one day after fans and players were left stunned by  of \"The Star-Spangled Banner.\"\nCody Johnson performs the United States national anthem prior to the 94th MLB All-Star Game presented by Mastercard at Globe Life Field on Tuesday, July 16, 2024 in Arlington, [...]",
    "source_url": "https://www.foxnews.com/sports/cody-johnson-nails-national-anthem-mlb-all-star-game-following-ingrid-andress-drunk-performance",
    "source_name": "Fox News",
    "category": "Entertainment",
    "keywords": "Cody Johnson; MLB All Star Game; Ingrid Andress; MLB All; Star Game; Texas; Johnson; Globe Life Field; Spangled Banner; United States; Mary DeCicco; MLB Photos"
  },
  {
    "date": "2024-07-17T11:54:30Z",
    "img": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/07/17/2187deab-90a3-4668-8bbb-27950bad3d21/thumbnail/1200x630/8963e5763fec247ba3f51d481c6409c5/gettyimages-138255605.jpg?v=5710b2ed1cee1bdfd30cb9c02455b43d",
    "title": "Naomi Pomeroy, star of \"Top Chef Masters\" and award winning chef, dies in river tubing accident in Oregon ",
    "content": " Naomi Pomeroy, an award-winning chef who helped put Portland on the map as a culinary destination and starred on \"Top Chef Masters,\" has drowned in an inner tubing accident, authorities said. She was 49 years old.\nPomeroy drowned Saturday evening in the Willamette River near Corvallis after the group she was tubing with got caught on an exposed snag in the water, the Benton County Sheriff s Office said in a statement. Pomeroy was pulled under the water and trapped by a paddle board leash attached to her, Captain Chris Duffitt said. The group had tied their inner tubes and paddle [...]",
    "source_url": "https://www.cbsnews.com/news/naomi-pomeroy-dies-top-chef-masters-star-river-tubing-accident-oregon-age-49/",
    "source_name": "CBS News",
    "category": "Entertainment",
    "keywords": "Naomi Pomeroy; Top Chef Masters; Oregon Naomi Pomeroy; Portland; Pomeroy; Willamette River; Benton County Sheriff; Office; Captain Chris Duffitt; Contestant Naomi Pomeroy; Episode; Story; Nicole Wilder; NBCU Photo Bank; Naomi; Sheriff Jef Van Arsdall; Oregon State Marine Board; Brian Paulsen; James Beard; Northwest; CBS; TV; Getty Images Heather Wallberg; Gary Okazaki; Rep; Earl Blumenauer; Oregon"
  },
  {
    "date": "2024-10-08T13:53:37Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/8/13/a-number-of-7-eleven-stores-could-close-1-6999779-1723591717723.jpg",
    "title": "7-Eleven stores seen with permanently closed signs in Winnipeg",
    "content": " It appears stores at 815 Ellice Ave., 665 McPhillips St., 1007 McPhillips St., and 1103 Pembina Highway are getting ready to close down.\nStaff from the locations confirmed the closures. CTV News was also told the Ellice and two McPhillips stores are shuttering because of theft. The reasons behind the Pembina store are unclear.\nAt some of the stores, there are signs that read “permanently closed” on them. At all four, store shelves are empty or the shelves themselves have already been pulled down.\nCTV reached out to 7-Eleven for comment but did not hear back.\nThis comes after two city councillors, Ross Eadie [...]",
    "source_url": "https://winnipeg.ctvnews.ca/7-eleven-stores-seen-with-permanently-closed-signs-in-winnipeg-1.7065595",
    "source_name": "CTVnews",
    "category": "Business",
    "keywords": "Eleven; Winnipeg It; Ellice Ave; McPhillips St; Pembina Highway; McPhillips; Pembina; Ross Eadie; Vivan Santos"
  },
  {
    "date": "2024-10-09T00:22:41Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/aerial-view-of-oil-sands-operations.jpg",
    "title": "Canada posts sixth straight month of trade deficits",
    "content": " The data were delayed by approximately 30 minutes on Tuesday morning because Statistics Canada experienced a technical issue with its website. The report went live around 9 a.m. Ottawa time.\nCanada’s exports of energy products posted the largest decrease in August, mainly on lower exports of crude oil mostly attributable to concerns over demand exerting downward pressure on prices.\nExports of forestry products and building and packaging materials dropped by 5.5 per cent to $3.8 billion in August, their lowest level since July 2023. Lower shipments of pulp and paper to China and the United States led the decline, potentially due to [...]",
    "source_url": "https://financialpost.com/news/economy/oil-exports-canada-trade-deficit",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "China; United States; Motor; Editorial In"
  },
  {
    "date": "2024-10-08T12:58:38Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/9e7f/live/62c29fb0-8573-11ef-89cf-b1f7c7617571.jpg",
    "title": "China hits back at EU with brandy tax",
    "content": " China has imposed duties on imports of European brandy in a move that France has said is retaliation for recent big tariffs the EU announced on Chinese electric vehicles.\nThe European Commission said it would challenge China s tax at the World Trade Organization (WTO), calling it an \"abuse\" of trade defence measures.\nBut China said the move was an \"anti-dumping\" measure that would protect its domestic producers.\nFrench brandy producers said the duties, which will hit big brands including Hennessy and Remy Martin, would be \"catastrophic\" for the industry.\nShares in brandy companies dropped after the announcement.\nChina announced new restrictions on European brandy [...]",
    "source_url": "https://www.bbc.com/news/articles/cn8jz39xl19o",
    "source_name": "bbc.com",
    "category": "Business",
    "keywords": "China; EU; France; European Commission; World Trade Organization; WTO; But China; French; Hennessy; Remy Martin; German; French Trade Minister Sophie Primas; European Union; Remy Cointreau; Analysts; Jefferies"
  },
  {
    "date": "2024-10-08T12:09:31Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/no1007trump.jpg",
    "title": "Trump tariff proposal could cost Canadians $1,100 per year, report warns",
    "content": " It’s estimated nearly 2.4 million Canadian jobs are tied to Canadian exports to the United States. While the report provided no details on how many jobs would be impacted by the tariff, estimates during the “Nixon Shock” suggested Canada would have lost 90,000 jobs if the tariff had lasted for a full year.\nThe report also highlighted how much individual states depend on Canadian trade, with Canada being the top exporter destination for 34 U.S. states.\n“In Montana, trade with Canada accounts for 16 per cent of the state economy, in Michigan it’s 14 per cent and in Illinois, it’s 10 per [...]",
    "source_url": "https://financialpost.com/news/economy/trump-tariff-cost-canadians-1100-per-year",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "Trump; United States; Nixon Shock; In Montana; Michigan; Illinois; Texas; In New Brunswick; Manitoba; US; Editorial Similarly"
  },
  {
    "date": "2024-10-08T15:02:06Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/1008-bc-hinton-.jpg",
    "title": "Canadian godfather of AI  flabbergasted  with Nobel Prize in physics",
    "content": " “I’m flabbergasted. I had, no idea this would happen,” he said when reached by the Nobel committee on the phone.\nHinton predicted that AI will end up having a “huge influence” on civilization, bringing improvements in productivity and health care.\n“It would be comparable with the Industrial Revolution,” he said in the open call with reporters and the officials from the Royal Swedish Academy of Sciences.\n“Instead of exceeding people in physical strength, it’s going to exceed people in intellectual ability. We have no experience of what it’s like to have things smarter than us. And it’s going to be wonderful in many [...]",
    "source_url": "https://financialpost.com/technology/nobel-prize-physics-artificial-intelligence",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "AI; Nobel Prize; Nobel; Hinton; Industrial Revolution; Royal Swedish Academy of Sciences; Instead; Americans Victor Ambros; Gary Ruvkun"
  },
  {
    "date": "2024-10-08T12:39:36Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2019/3/5/uber-1-4322787-1627390799744.jpg",
    "title": "Uber to launch AI assistant powered by OpenAI s GPT-4o to help drivers go electric",
    "content": " Uber Technologies will roll out an AI assistant powered by OpenAI s technology to help drivers transition to electric vehicles, as part of its efforts to lower emissions.\nThe ride-hailing company has advocated a shift to EVs for several years and has pledged US$800 million to support its driver partners  switching entirely to EVs by 2040.\nThe AI assistant, based on OpenAI s GPT-4o, was unveiled at Uber s Go-Get Zero event in London on Tuesday. The chatbot is set to launch early next year in the United States and will later expand to other locations.\nIt will provide personalized answers tailored [...]",
    "source_url": "https://www.ctvnews.ca/business/uber-to-launch-ai-assistant-powered-by-openai-s-gpt-4o-to-help-drivers-go-electric-1.7066011",
    "source_name": "CTVnews",
    "category": "Business",
    "keywords": "Uber; AI; OpenAI; GPT; Uber Technologies; EVs; US; Get Zero; London; United States; Europe; In London; CEO Dara Khosrowshahi; EV; Lotus LOT; Los Angeles; Miami; Dallas; Rivian; Arsheeya Bajwa; Pooja Desai; Hurricane Milton; Yucatan Peninsula; Florida; Gulf Coast; Helene; Ian; Baby Boomers; Kamala Harris; Donald Trump; Hurricane Helene; Election Day; Amazon; Nobel Prize; University of Toronto; Geoffrey Hinton; Princeton University; John Hopfield; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Chantal Kreviazuk; Winnipeg; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T05:57:27Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/71df/live/156139c0-853c-11ef-81ed-aff3b9114853.jpg",
    "title": "Water companies must return £158m over poor performance",
    "content": " Water companies have been ordered to return £158m to customers via lower bills next year after missing key targets on issues like pollution.\nThe industry regulator Ofwat announced the rebate following its annual review of water and wastewater companies’ performance in England and Wales.\nChief executive David Black warned companies that “money alone” would not solve the issue and there needed to be a change in culture.\nIndustry body Water UK have been approached for a comment.\nOfwat assesses the performance of the 17 largest water and wastewater companies in England and Wales each year against key targets for issues such as sewer flooding, [...]",
    "source_url": "https://www.bbc.com/news/articles/c0r84lnng4eo",
    "source_name": "bbc.com",
    "category": "Business",
    "keywords": "England; Wales; David Black; Water UK"
  },
  {
    "date": "2024-10-08T19:50:51Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/9d14/live/2222d7a0-8563-11ef-a8ba-ed5ab114fd9d.jpg",
    "title": "HS2 may now run to central London, minister says",
    "content": " Her comments come after work to expand Euston station to accommodate HS2 was halted by the previous Conservative government last year because of the mounting costs.\nHaigh told BBC Radio 5Live a decision on where HS2 will end would be \"clear soon\", with an announcement set to be made around the time of the Budget on 30 October.\nCurrently, the plan to terminate at Old Oak Common would mean passengers travelling to central London would have to change trains.\nBut Haigh told the BBC on Tuesday: \"It would make absolutely no sense to build a £66bn high-speed line between Old Oak Common and [...]",
    "source_url": "https://www.bbc.com/news/articles/crm2843glmjo",
    "source_name": "bbc.com",
    "category": "Business",
    "keywords": "London; Conservative; BBC Radio; Old Oak Common; But Haigh; BBC; Birmingham; North of England; Former Prime Minister Rishi Sunak; Labour; Department; Ltd; In February; Commons Public Accounts Committee; Manchester; Parkway; Hampstead Road; Euston Approaches; Euston Station"
  },
  {
    "date": "2024-10-08T09:59:52Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/1008-bc-lysyk.jpg",
    "title": "OSC appoints former Ontario auditor general Bonnie Lysyk as head of enforcement",
    "content": " To create that report, she assembled a team that included financial analysts and environmental experts who dug into documents and emails behind the Ontario government’s decision, which had drawn sharp criticism over Ford’s ties to developers and the timing of the decision to remove legal protections from the parcels of land to allow real estate development.\nThe analysis by Lysyk and her team, released in August 2023, sent shockwaves through the government. It concluded that the lands removed from the Greenbelt in December 2022 “were not chosen using an objective and transparent selection process” and said that there was “no evidence” [...]",
    "source_url": "https://financialpost.com/news/osc-former-ontario-auditor-general-bonnie-lysyk-enforcement",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "OSC; Bonnie Lysyk; Ford; Lysyk; Greenbelt; In September; Editorial Prior; Gaming Commission of Ontario; HSBC Bank Canada"
  },
  {
    "date": "2024-10-08T14:53:05Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/chip-house-2.jpg",
    "title": "Lululemon founder Chip Wilson s Vancouver mansion defaced after election sign went up",
    "content": " A few days earlier, a sign was erected outside the house with the message: “Eby will tell you the Conservatives are ‘Far Right’ but neglects saying that the NDP is ‘Communist.’” That’s a reference to David Eby, premier of the province of 5.7 million people, and his New Democratic Party.\nThe graffiti was visible on Monday morning, but by late afternoon it had been washed and a new sign was in place, with the message: “Voters seem to forget when Eby ‘gives’ us money, it is the Voters’ money he has already taken.”\nto elect a new provincial government, and a race [...]",
    "source_url": "https://financialpost.com/news/lululemon-founder-chip-wilsons-vancouver-mansion-defaced-after-election-sign-went-up",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "Lululemon; Chip Wilson; Eby; Conservatives; Far Right; NDP; Communist; David Eby; New Democratic Party; Conservative Party; Wilson; Conservative Leader John Rustad; British Columbians; Red Hot Chili Peppers; Editorial; Ayn Rand; Atlas Shrugged"
  },
  {
    "date": "2024-10-08T20:47:51Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/CNRL-Shareholders-Meeting-copy.jpg",
    "title": "Varcoe: Two decades, 23 deals and $33B in M&amp;A — Canadian Natural Resources keeps on growing, as Chevron exits Alberta",
    "content": " It’s slightly ahead of Occidental Petroleum for 10th spot this year — the list is led by supermajors ExxonMobil and Chevron — and Canadian Natural is currently projected to dip slightly behind the Houston-based producer next year.\n“It is growing significantly with this acquisition,” said Jonah Resnick, senior research analyst with Wood Mackenzie.\n“CNRL is essentially neck-and-neck with Oxy. They’re in the top three by independent operators in North America and the world, for that matter, because the rest of those companies are all majors, integrated majors.”\nThe deal adds about 63,000 barrels per day of synthetic crude oil output to CNRL, along [...]",
    "source_url": "https://calgaryherald.com/opinion/columnists/varcoe-chevron-exits-alberta-deal-canadian-natural-resources",
    "source_name": "calgaryherald.com",
    "category": "Business",
    "keywords": "Varcoe; Canadian Natural Resources; Chevron; Alberta It; Occidental Petroleum; ExxonMobil; Canadian Natural; Houston; Jonah Resnick; Wood Mackenzie; CNRL; BP Amoco; Horizon Oil Sands; Royal Dutch Shell; Marathon Oil; Cenovus Energy; Canadianization; Oklahoma; Devon Energy; Canadian Natural Resources Ltd; Chevron Canada Ltd; Athabasca Oil Sands Project; Ben Nelms; Bloomberg; Murray Edwards; US; Toronto Stock Exchange; Eric Nuttal; Ninepoint Partners; Given Murray; Murray; For Chevron; Hess Corp; In January; Chevron Canada; East Coast; British Columbia; Cenovus; Suncor Energy"
  },
  {
    "date": "2024-10-09T00:20:41Z",
    "img": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/10/1009-bc-brook.jpg",
    "title": "Brookfield seeks US$1 billion green-power deals",
    "content": " The company sees opportunities around the world “to acquire renewable developers or maybe a big utility,” Adomait said in an interview on the sidelines of the BNEF Summit in London on Tuesday.\nAny deal would follow the firm’s purchase this year of a majority stake in Neoen SA that moved it closer to a €6.1 billion (US$6.7 billion) takeover of the French renewable developer. That came after troubles in the offshore wind industry — including higher interest rates and supply chain snarls — cut valuations of publicly-traded renewable power companies.\n“Did that create a buying opportunity? Yes, absolutely,” Adomait said. “We were [...]",
    "source_url": "https://financialpost.com/commodities/brookfield-green-power-deals-buyers-market",
    "source_name": "National Post",
    "category": "Business",
    "keywords": "Brookfield; US; BNEF Summit; London; Neoen SA; French; India"
  },
  {
    "date": "2024-10-08T08:42:49Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/29d3/live/b9e63440-8362-11ef-bbc3-9d3803ee8b52.jpg",
    "title": "For Gen Z, US election is all about the economy",
    "content": " The US presidential election is just weeks away and one essential voting bloc is getting a lot of attention from both parties: young voters.  But it’s economic woes – from inflation to housing – that could drive them to the polls.\nIt’s Isabella Morris’s first presidential election, and the 21-year-old mum from Rosenberg, Texas, said she’s listening closely to what both candidates have to say.\nRecently married with a two-year-old, Isabella works part-time to supplement her husband’s full-time income. She stays at home with her child while her family rents a small one-bedroom apartment.\nThe plan seemed solid—two incomes, no mortgage, or [...]",
    "source_url": "https://www.bbc.com/news/articles/czeg87x125ro",
    "source_name": "bbc.com",
    "category": "Business",
    "keywords": "For Gen; US; Isabella Morris; Rosenberg; Texas; Isabella; BBC; Gaza; Gen Forward Survey; University of Chicago; Covid; TikToker Kyla Scanlon; Federal Reserve; Ms Scanlon; Gen; TikTok; Abby Kiesa; Civic Learning; Ms Kiesa; Trump; Harris; Biden; Taylor Swift; Billie Eilish; Logan Paul; Adin Ross; When Biden; Harvard Institute of Politics; Gabriel Sanchez; Democratic; Georgia; Sanchez; In May; Atlanta"
  },
  {
    "date": "2024-10-08T14:22:41Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/10/8/parliamentary-budget-officer-yves-giroux-1-7066190-1728397424071.jpg",
    "title": "Inflation, interest rates eroded Canadians  purchasing power since 2022: PBO report",
    "content": " A new report from the Parliamentary Budget Officer says inflation and higher interest rates have eroded Canadians  purchasing power since 2022, particularly for lower-income households.\nHowever wealthier households have seen their purchasing power rise.\nParliamentary Budget Officer Yves Giroux says government transfers, wage gains and net investment income have helped disposable income for higher-income households rise above inflation since 2019.\nThe report says the investment income of the wealthiest 20 per cent of households grew faster than their interest payments, leading to a net increase over inflation and boosting their purchasing power in 2023.\nFor other households, interest payment increases on average were [...]",
    "source_url": "https://www.ctvnews.ca/business/inflation-interest-rates-eroded-canadians-purchasing-power-since-2022-pbo-report-1.7066182",
    "source_name": "CTVnews",
    "category": "Business",
    "keywords": "PBO; Parliamentary Budget Officer; Parliamentary Budget Officer Yves Giroux; Hurricane Milton; Yucatan Peninsula; Florida; Baby Boomers; Despite Hurricane Milton; Category; Walt Disney World Resort; Dutch; Kathy Bates; Oscar; Bernie Hicks; Batman of Amherst; Batmobile; Awesome Eats; University Ave West; Weeneebayko Area Health Authority; Government of Ontario; Far North; Manitobans; Avry Wortman; Greater Moncton Football Association; Shopping Trends; Read"
  },
  {
    "date": "2024-10-08T08:37:49Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/df1e/live/5dd02690-8513-11ef-9d1d-8981b4296577.jpg",
    "title": "China stock rally fizzles as stimulus news disappoints",
    "content": " A stock market rally in China has fizzled out as a highly-anticipated announcement on plans to boost the country s ailing economy disappointed investors.\nShares had jumped by over 10% as trading restarted after the Golden Week holiday but fell back after a news conference by the country s economic planners.\nAfter a volatile day of trading, the Shanghai Composite Index in mainland China closed 4.6% higher, while the Hang Seng in Hong Kong slumped by 9.4%.\nInvestors had been hoping for more information about how the government plans to support economic growth but the announcement gave little in the way of details.\nThe [...]",
    "source_url": "https://www.bbc.com/news/articles/c8elgd52x4wo",
    "source_name": "bbc.com",
    "category": "Business",
    "keywords": "China; Golden Week; Shanghai Composite Index; Hang Seng; Hong Kong; National Development; Reform Commission Zheng Shanjie; Mr Zheng; Alicia Garcia; Asia Pacific"
  },
    {
      "date": "2024-10-14T04:52:10Z",
      "img": "https://dims.apnews.com/dims4/default/04f576a/2147483647/strip/true/crop/3351x2235+0+0/resize/1440x960!/format/webp/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F02%2Fb8%2F371befe2b9ce93878c89db86b1e4%2F7224c7ae434343148667e4e1976a67fd",
      "title": "Ailing and silenced in prison, Belarus activist symbolizes the nation’s repression",
      "content": " Her sister, Tatiana Khomich, said she was told by former inmates that the 5-foot-9-inch Kolesnikova weighed only about 45 kilograms (100 pounds).\n“They are slowly killing Maria, and I consider that this is a critical period because no one can survive in such conditions,” said Khomich, who lives outside Belarus.\nThe last time Kolesnikova wrote from prison was in February 2023. Letters to her “are ripped up before her eyes by prison personnel,” her sister said, relaying accounts from other former inmates.\nKolesnikova, who before the 2020 protests was a classical flautist who was especially knowledgable about baroque music, is one of several [...]",
      "source_url": "https://winnipegsun.com/pmn/ailing-and-silenced-in-prison-belarus-activist-symbolizes-the-nations-repression",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "Belarus; Tatiana Khomich; Maria; Letters; Lukashenko; Belarusian Interior Ministry; Human Rights Committee; Belarusian; In September; European Parliament; Nobel Peace Prize; Ales Bialiatsky; Alexei Navalny; Russia; Western; Amnesty International; Siarhei Tsikhanouski; Sviatlana Tsikhanouskaya; Viktar Babaryka; Mikola Statkevich; Maxim Znak; Moscow; EU; Minsk; West; Alexander Friedman"
    },
    {
      "date": "2024-10-14T03:21:13Z",
      "img": "https://globalnews.ca/wp-content/uploads/2024/10/Amazon-NHL-1.jpg?quality=85&strip=all&w=720&h=379&crop=1",
      "title": "Mark Messier says ‘change’ is inevitable as the NHL enters streaming era on Amazon",
      "content": " Descrease article font size\nIncrease article font size\nOver his quarter century in the National Hockey League , Mark Messier witnessed sweeping technological changes to the game, from the advent of lighter hockey sticks to the use of video reviews.\nNow, the Canadian Hall of Famer believes hockey is poised for another leap as it moves into the streaming era.\nMessier will be among the on-air talent for Amazon Prime Video’s new NHL broadcast, Prime Monday Night Hockey, the league’s first exclusive national broadcast package with a digital-only streaming service in Canada.\nShows will be broadcast from the home team’s arena, kicking off Monday when [...]",
      "source_url": "https://globalnews.ca/news/10809453/tv-nhl-amazon/",
      "source_name": "globalnews.ca",
      "category": "Sports",
      "keywords": "Mark Messier; NHL; Amazon Descrease; National Hockey League; Canadian Hall of Famer; Messier; Amazon Prime Video; Prime Monday Night Hockey; Montreal Canadiens; Pittsburgh Penguins; Bell Centre; John Forslund; Amazon; Rogers Communications Inc; Mark Shopiro; Prime Video Canada; Rogers; Sign Up; Adnan Virk; Andi Petrillo; View; Blake Bolden; Thomas Hickey; Toronto Maple Leafs; Detroit Red Wings; Monday Night Hockey; Scotiabank Arena; Steve Mayer; Trending Now; Sportsnet; Amazon Prime"
    },
    {
      "date": "2024-10-14T04:46:10Z",
      "img": "https://dims.apnews.com/dims4/default/fdfd5ee/2147483647/strip/true/crop/6000x4000+0+0/resize/1440x960!/format/webp/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2Fe5%2F313ba9b28f53d02df6d942d5f29c%2Fc8a644b1cf1b4b0792d74a6306b857dd",
      "title": "Trial set to begin for suspect in the 2017 killings of 2 teen girls in Indiana",
      "content": " Within days, police released files found on Libby’s cellphone _ two grainy photos and audio of a man saying “down the hill” — that they believed represented the killer.\nBut no arrest followed.\nIn July 2017, investigators released a sketch of the suspect, and another in April 2019. They also released a brief video showing the suspect walking on an abandoned railroad bridge called the Monon High Bridge.\nAfter years of failing to find a suspect, investigators said they went back and reviewed “prior tips.”\nAllen had been interviewed in 2017. He told the officer that he had been walking on the trail the [...]",
      "source_url": "https://winnipegsun.com/pmn/trial-set-to-begin-for-suspect-in-the-2017-killings-of-2-teen-girls-in-indiana",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "Indiana Within; In July; Monon High Bridge; Allen; Freedom Bridge; Indiana Supreme Court; Allen County Superior Court Judge Fran Gull; In August; Hal Johnston; Indiana University; Johnston; Abby"
    },
    {
      "date": "2024-10-14T02:47:05Z",
      "img": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2024/10/c3588a134c67376a740011d6ff43df1f04a1d12c778bf603b57558fa46379ea4.jpg;w=960",
      "title": "LAFC edges struggling Vancouver Whitecaps 2-1 with stoppage time goal",
      "content": " Bogusz set up another opportunity with a corner in the 20th minute. The Polish striker swung a ball into the six-yard box where Eddie Segura directed a header on net. Takaoka stretched out and got a hand on the ball for the save.\nThe ‘Caps got a chance in the 36th minute when Brian White went one-on-one with Lloris. The ‘keeper darter out to the top of the six-yard box and smothered the ball before the American striker could get his shot off.\nL.A. outshot Vancouver 7-6 across the first half, and 3-1 in on-target shots.\nThe home side returned to the field [...]",
      "source_url": "https://winnipegsun.com/pmn/lafc-edges-struggling-vancouver-whitecaps-2-1-with-stoppage-time-goal",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "LAFC; Vancouver Whitecaps; Polish; Eddie Segura; Brian White; American; Whitecaps; Sergi Palencia; Sebastian Berhalter; Substitute Deiber Caicedo; Sanchez; David Martinez; Whitecap Kei Kamara; Ali Ahmed; Sam Adekugbe; Andres Cubas; Paraguay; Ryan Gauld; Scotland; Fafa Picault; Haiti; Pedro Vite; Ecuador; Denis Bouanga; Gabon; Cristian Olivera; Uruguay; Maxime Chanot; Luxembourg; Stuart Armstrong; UP NEXT; Real Salt Lake; The San Jose Earthquakes"
    },
    {
      "date": "2024-10-14T02:23:08Z",
      "img": "https://assets.technologynetworks.com/production/dynamic/images/content/392048/engineering-perovskite-materials-at-the-atomic-level-paves-way-for-new-lasers-leds-392048-1280x720.webp?cb=13036874",
      "title": "Engineering perovskite materials at the atomic level paves way for new lasers, LEDs",
      "content": " Researchers have developed and demonstrated a technique that allows them to engineer a class of materials called layered hybrid perovskites (LHPs) down to the atomic level, which dictates precisely how the materials convert electrical charge into light. The technique opens the door to engineering materials tailored for use in next-generation printed LEDs and lasers -- and holds promise for engineering other materials for use in photovoltaic devices.\nPerovskites, which are defined by their crystalline structure, have desirable optical, electronic and quantum properties. LHPs consist of incredibly thin sheets of perovskite semiconductor material that are separated from each other by thin organic [...]",
      "source_url": "https://www.sciencedaily.com/releases/2024/10/241011141001.htm",
      "source_name": "sciencedaily.com",
      "category": "Technology",
      "keywords": "LEDs Researchers; LEDs; Aram Amassian; North Carolina State University; Kenan Gundogdu; NC State; LHP; Instead; Milad Abolhasani; ALCOA Professor of Chemical; Biomolecular Engineering; National Science Foundation; Office of Naval Research"
    },
    {
      "date": "2024-10-14T04:05:05Z",
      "img": "https://smartcdn.gprod.postmedia.digital/winnipegsun/wp-content/uploads/2024/10/jjf120_140247-the-canadian-press.jpg",
      "title": "Surprising starts to NHL season for unbeaten Flames, winless Oilers",
      "content": " “The number 1 thing for us is we took one minor penalty. In prior years, games against this team, we’ve taken four or five minors and you don’t give yourselves a chance because their power play is too good.”\nDan Vladar had 24 saves in the Calgary net.\n“Obviously, a couple bounces went our way, which I haven’t seen in a lot of games,” he said. “So, I’m happy for that, but that’s the first week so we’ve got to keep going and getting even better.”\nThe Oilers had two goals called back on video review, including one for goaltender interference against Corey [...]",
      "source_url": "https://winnipegsun.com/pmn/surprising-starts-to-nhl-season-for-unbeaten-flames-winless-oilers",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "NHL; Flames; Oilers; Dan Vladar; Obviously; Corey Perry; Vladar; Perry; Stanley Cup; Florida Panthers; Jay Woodcroft; Connor McDavid; Jeff Skinner; Oiler"
    },
    {
      "date": "2024-10-14T05:25:05Z",
      "img": "https://dims.apnews.com/dims4/default/5e5017a/2147483647/strip/true/crop/3651x2434+0+0/resize/1440x960!/format/webp/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F18%2Fbf%2Fdddaaadd7eeede6897dc6b33735f%2F325214de9624403e8ca2734b29e9730d",
      "title": "Pakistan hosts a major security meeting this week as it struggles against rising insurgent violence",
      "content": " The group wants independence for the province. It’s not interested in overthrowing the state to establish a caliphate, which is what the Pakistani Taliban want. But the two groups have a common enemy — the government.\nAnalysts have said the BLA is getting support from the Pakistani Taliban. But, even without an alliance, attacks in the southwest are becoming more audacious and brutal, indicating that the BLA’s tactics are evolving and taking the security apparatus by surprise.\nThe Pakistani Taliban continue their shootings and bombings in Khyber Pakhtunkhwa province, which borders Afghanistan.\nIt could be difficult for militants to hit the summit given [...]",
      "source_url": "https://winnipegsun.com/pmn/pakistan-hosts-a-major-security-meeting-this-week-as-it-struggles-against-rising-insurgent-violence",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "Pakistan; Pakistani Taliban; Analysts; Khyber Pakhtunkhwa; Afghanistan; Imtiaz Gul; Security Studies; Finance Minister Muhammad Aurangzeb; Prime Minister Imran Khan; International Monetary Fund"
    },
    {
      "date": "2024-10-14T02:19:07Z",
      "img": "https://www.earth.com/assets/_next/image/?url=https%3A%2F%2Fcff2.earth.com%2Fuploads%2F2024%2F10%2F13084156%2FSuns-atmosphere-1400x850.jpg&w=1200&q=75",
      "title": "Researchers find clues to the mysterious heating of the sun s atmosphere",
      "content": " There is a profound mystery in our sun. While the sun s surface temperature measures around 10,000 degrees Fahrenheit, its outer atmosphere, known as the solar corona, measures more like 2 million degrees Fahrenheit, about 200 times hotter. This increase in temperature away from the sun is perplexing and has been an unsolved mystery since 1939, when the high temperature of the corona was first identified. In the ensuing decades, scientists have tried to determine the mechanism that could cause this unexpected heating, but so far, they have not succeeded.\nNow, a team led by Sayak Bose, a researcher at the [...]",
      "source_url": "https://www.sciencedaily.com/releases/2024/10/241011141015.htm",
      "source_name": "sciencedaily.com",
      "category": "Technology",
      "keywords": "Sayak Bose; Department of Energy; Princeton Plasma Physics Laboratory; PPPL; Astrophysical Journal; Swedish; Nobel Prize; Hannes Alfv; Large Plasma Device; LAPD; University of California; Los Angeles; UCLA; Physicists; Jason TenBarge; Princeton University; Columbia University; National Science Foundation; Basic Plasma Science Facility; DOE Office of Science Fusion Energy Sciences; Raphael Rosen"
    },
    {
      "date": "2024-10-14T03:19:13Z",
      "img": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2024/10/fed5b9fb09b2eddea975331098f40aa41620a63438991676af05a268b589c2f4.jpg;w=960",
      "title": "Unbeaten Flames stay hot with 4-1 win over winless Oilers",
      "content": " Flames: Mantha’s 300th point of his NHL career was a game winner. The Flames went up 2-1 seven minutes into the third period after sustained pressure in the Edmonton zone. Mantha was able to corral a rebound in tight and lifted it up high over Skinner for his second of the season.\nOilers: Captain Connor McDavid assisted on Jeff Skinner’s goal in the first period, marking the 15th time he has assisted in a player’s first goal as an Oiler. That tied Ryan Smyth for second best in franchise history in the category, behind only Wayne Gretzky’s 21 first-goal assists.\nKEY MOMENT\nThe [...]",
      "source_url": "https://winnipegsun.com/pmn/unbeaten-flames-stay-hot-with-4-1-win-over-winless-oilers",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "Unbeaten Flames; Oilers Flames; Mantha; NHL; Flames; Skinner; Oilers; Captain Connor McDavid; Jeff Skinner; Oiler; Ryan Smyth; Wayne Gretzky; KEY MOMENT The Oilers; Troy Stecher; Vladar; Corey Perry; Derek Ryan; Viktor Arvidsson"
    },
    {
      "date": "2024-10-14T03:22:14Z",
      "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/taiwan-national-day.jpg",
      "title": "China holds large military exercises surrounding Taiwan, outlying islands",
      "content": " Play Video\nChina’s Defence Ministry said the drills were a response to Taiwanese President Lai Ching-te’s refusal to concede to Beijing’s demands that Taiwan acknowledge itself as a part of the People’s Republic of China under the rule of the Communist Party.\nTaiwan’s Defence Ministry called the drills a provocation and said its forces were prepared to respond.\nLai took office in May, continuing the eight-year rule of the Democratic Progressive Party that rejects China’s demand that it recognize Taiwan is a part of China. China routinely states that Taiwan independence is a “dead end” and that annexation by Beijing is a historical [...]",
      "source_url": "https://torontosun.com/news/world/china-holds-large-military-exercises-surrounding-taiwan-outlying-islands",
      "source_name": "torontosun",
      "category": "Top Stories",
      "keywords": "China; Taiwan; Play Video China; Defence Ministry; Taiwanese President Lai Ching; Beijing; Republic of China; Communist Party; Lai; Democratic Progressive Party"
    },
    {
      "date": "2024-10-14T03:51:05Z",
      "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/2178272716-e1728875996510.jpg",
      "title": "West becomes first 3-time inductee as Carter, Billups enter basketball hall",
      "content": " The class also included high-scoring Phoenix star Walter Davis and former Knicks champion Dick Barnett, with Seimone Augustus and Michele Timms making it from the WNBA. Doug Collins and Pacers owner Herb Simon were inducted as contributors, along with amateur-level coaches Bo Ryan, Harley Redin and Charles Smith.\nThis honour for West was for his work as a contributor, largely recognizing the eight championships he helped the Lakers win as an executive.\n“Contributor to the game of basketball, that is you in every single sense and that will live on forever,” Jonnie West said, with Lakers Hall of Famers such as Magic [...]",
      "source_url": "https://torontosun.com/sports/basketball/nba/west-becomes-first-3-time-inductee-as-carter-billups-enter-basketball-hall",
      "source_name": "torontosun",
      "category": "Top Stories",
      "keywords": "West; Carter; Billups; Phoenix; Walter Davis; Knicks; Dick Barnett; Seimone Augustus; Michele Timms; WNBA; Doug Collins; Herb Simon; Bo Ryan; Harley Redin; Charles Smith; Lakers; Jonnie West; Lakers Hall of Famers; Magic Johnson; James Worthy; Cooper; Pat Riley; Olympic; Riley; Johnson; New Mexico; Bryant"
    },
    {
      "date": "2024-10-14T04:08:06Z",
      "img": "https://smartcdn.gprod.postmedia.digital/winnipegsun/wp-content/uploads/2024/10/fcg117-the-canadian-press.jpg",
      "title": "Unbeaten Jets aim to keep soaring, building on early success",
      "content": " There was the season-opening 6-0 victory over the Oilers in Edmonton, followed by Friday’s 2-1 overtime win at home against the Chicago Blackhawks.\nThe stars of the show so far have been centre Mark Scheifele and reigning Vezina Trophy winner Connor Hellebuyck, who signed identical seven-year deals last year with an average value of $8.5 million per year. The contracts kicked in this season.\nScheifele scored his fourth goal of the season against the Wild and added an assist in his 800th NHL career game. He leads his team with six points in a three-game point streak of four goals and two [...]",
      "source_url": "https://winnipegsun.com/pmn/unbeaten-jets-aim-to-keep-soaring-building-on-early-success",
      "source_name": "winnipegsun",
      "category": "Top Stories",
      "keywords": "Unbeaten Jets; Oilers; Chicago Blackhawks; Mark Scheifele; Vezina Trophy; Connor Hellebuyck; Scheifele; NHL; Arniel; Connor; Winnipeg; Atlanta Thrashers; Jets; Minnesota; Filip Gustavsson; Canada Life Centre; With the Wild; Jake Middleton; Hellebuyck; Adam Lowry; Matt Boldy; Lowry; John Hynes; Ryan Hartman"
    },
    {
      "date": "2024-10-14T05:35:11Z",
      "img": "https://www.politico.com/dims4/default/ace5e7d/2147483647/strip/true/crop/2414x1609+0+0/resize/630x420!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F13%2F5c%2Fca6d51474d72854fd4cd37711353%2Fus-election-2024-walz-39430.jpg",
      "title": "50 Republican veterans in Congress accuse Tim Walz of Falsifying military record in signed letter",
      "content": " On Wednesday, Representative Brian Mast (R-FL), who served as a U.S. Army explosive ordnance disposal technician in Afghanistan and lost both legs in 2010, spearheaded an endorsement from 50 Republican veterans in Congress through a letter . The letter criticized Minnesota Democratic Governor Tim Walz for false statements regarding his military service.\n“The Office of the Vice President is a position that requires the trust of the American people and a solemn commitment to duty on behalf of the United States of America,” the letter began. “As veterans who have served our nation, we feel compelled to address your egregious misrepresentations [...]",
      "source_url": "http://www.rebelnews.com/50_republican_veterans_in_congress_accuse_tim_walz_of_falsifying_military_record_in_signed_letter",
      "source_name": "rebelnews.com",
      "category": "World",
      "keywords": "Republican; Congress; Tim Walz of Falsifying; On Wednesday; Representative Brian Mast; Afghanistan; Minnesota Democratic Governor Tim Walz; Office of the Vice President; American; United States of America; Retired Command Sergeant Major; Armed Forces; Vice President; America; When America; Contributor Ian Miles Cheong; Twitter"
    }
]
