[
  {
    "date": "2024-10-06T02:12:12Z",
    "img": "https://smartcdn.gprod.postmedia.digital/torontosun/wp-content/uploads/2024/10/CP173261018.jpg",
    "title": "Maple Leafs season preview: From the crease to the bench, meet the new players",
    "content": " WHERE HE’S BEEN: Years of near anonymity in the desert for the sixth overall pick in 2009 (just before the Leafs selected Nazem Kadri) ended couple of high-profile years in Vancouver and then a Cup with the Panthers. His 24 games last spring nearly doubled his career playoff run, on top of 80 regular-season games, his best attendance in five years. \nWHAT HE BRINGS: In addition to experience, he possesses a better point shot than most on the current Leafs, which will help at 5-on-5 and the power play. If Berube can find a complimentary right-handed shot as a partner, Ekman-Larsson will [...]",
    "source_url": "https://torontosun.com/sports/hockey/nhl/toronto-maple-leafs/season-preview-from-the-crease-to-the-bench-meet-the-new-maple-leafs",
    "source_name": "torontosun",
    "category": "Top Stories",
    "keywords": "Maple Leafs; WHERE HE; Leafs; Nazem Kadri; Cup; Panthers; WHAT HE BRINGS; If Berube; Ekman; Larsson; DID YOU KNOW; NHL; Leaf; Tim Horton; Finland; Hawk WHERE HE; St; Louis; Hakanpaa; Anaheim; Dallas Stars; UFAs; American Brian Rafalski; Finnish; New Canaan; Conn; Patches WHERE HE; Patrick Kane; James; Stanley Cup; Vegas; Achilles; Pacioretty; Tyler Bertuzzi; Auston Matthews; Mexican"
  },
  {
    "date": "2024-10-06T05:00:06Z",
    "img": "",
    "title": "Survivors grapple with aid cuts and the Taliban a year after massive Afghan earthquake",
    "content": " Charities had stepped in to build housing for survivors. But the accommodation they built lacks walls so there is no privacy, while the poor design leaves them vulnerable to storms or heavy rainfall. Houses either have no bathrooms or the bathrooms don’t have a roof.\nRahmani’s village, Naib Rafi, still doesn’t have a health clinic or a school. Instead, children are learning in tents.\nThe government didn’t provide financial assistance, he said. Senior officials and Islamic scholars visited communities a few times, listened to people’s problems and left.\nAhmadullah Muttaqi, spokesman and member of the Herat Earthquake Commission, said authorities worked with charities [...]",
    "source_url": "https://winnipegsun.com/pmn/survivors-grapple-with-aid-cuts-and-the-taliban-a-year-after-massive-afghan-earthquake",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Taliban; Afghan; Naib Rafi; Instead; Islamic; Ahmadullah Muttaqi; Herat Earthquake Commission; AP; Afghans; International Rescue Committee"
  },
  {
    "date": "2024-10-06T01:24:11Z",
    "img": "https://i.cbc.ca/1.7344233.1728179110!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/rgu-wxv-1-ireland-canada-20241005.JPG",
    "title": "Canada s women s rugby team beats Ireland to improve to 2-0 at WXV 1 tournament in B.C.",
    "content": " The Canadian women s rugby team started quickly and then dug in defensively to beat Ireland 21-8 at the WXV 1 tournament on Saturday at Langley Events Centre in Langley, B.C.\nThe Canadian women s rugby team started quickly and then dug in defensively to beat Ireland 21-8 at the WXV 1 tournament on Saturday at Langley Events Centre in Langley, B.C.\nThe Canadians, who rolled past France 46-24 in their tournament opener on Sept. 29, improved to 2-0. They ll next face England on Saturday, Oct. 12, at B.C. Place in Vancouver. England, which crushed the United States 61-21 in its tourney opener on Sept. [...]",
    "source_url": "https://www.cbc.ca/sports/rugby/canadian-women-rugby-ireland-wxv-1-tournament-recap-1.7344230?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Ireland; WXV; Langley Events Centre; Langley; France; England; United States; New Zealand; Clair Gallagher; Julia Omokhuale; Alex Tessier; Eimear Considine; Brien"
  },
  {
    "date": "2024-10-06T04:52:05Z",
    "img": "",
    "title": "Exiled from Russia centuries ago, a religious group is on the edge of vanishing in Georgia",
    "content": " And all the while, the prayers never stopped, not even when the Soviet authorities relentlessly cracked down on religious activities.\n“There hasn’t been a single Sunday without prayer,” Yuri Strukov, 46, says with pride, in the village of Orlovka, where he has lived for 30 years.\nA shrinking community\nLike others in the rural community, Strukov owns cattle and produces cottage cheese, sour cream and a brined cheese called suluguni, which he sells in a nearby town. His way of life is challenging — he braves freezing temperatures during winter and droughts in the summer, and the remote village is a three-hour drive [...]",
    "source_url": "https://winnipegsun.com/pmn/exiled-from-russia-centuries-ago-a-religious-group-is-on-the-edge-of-vanishing-in-georgia",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Russia; Georgia And; Soviet; Yuri Strukov; In Soviet; Georgia; Soviet Union; Dmitry Zubkov; Georgians; Armenian"
  },
  {
    "date": "2024-10-06T01:43:01Z",
    "img": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2021/3/15/rcmp-1-5347740-1710784597555.jpg",
    "title": "Car flies into B.C. backyard, lands upside down",
    "content": " A driver suffered only minor injuries after going airborne in a residential neighbourhood in Maple Ridge, B.C., on Friday, the car eventually landing on its roof in someone’s backyard.\nLocal RCMP say officers responded to the rollover in the 14000 block of Mier Drive around noon.\nPolice say they found the vehicle upside-down in a backyard after it appeared to cause damage in multiple other backyards.\nA video posted on social media shows the vehicle, a white SUV, careening over a metal fence, and flying through the air before skidding across a rock barrier.\nby u/mx043 in MapleRidge\nAnother video taken after the crash shows [...]",
    "source_url": "https://bc.ctvnews.ca/car-flies-into-b-c-backyard-lands-upside-down-1.7063786",
    "source_name": "CTVnews",
    "category": "Top Stories",
    "keywords": "Maple Ridge; Local RCMP; Mier Drive; SUV; MapleRidge Another; RCMP; Cpl; Brett Urano; Ridge Meadows RCMP; Integrated Collision Analysis; Reconstruction Service; Donald Trump; Pennsylvania; Trump; GST; HST; North York; Ligeng Guo; Old Montreal; Galway University; Ireland; Hamilton; McMaster University; Vanderbilt; AP; Alabama; Tropical Storm Milton; Gulf of Mexico; Mexico; Shopping Trends; Read"
  },
  {
    "date": "2024-10-06T01:51:03Z",
    "img": "",
    "title": "Tavares, Matthews lead Maple Leafs to 3-2 win over Red Wings",
    "content": " The Maple Leafs dressed most of their opening-night roster with only regulars Nick Robertson, Calle Jarnkrok and defenceman Jake McCabe missing.\nThe Red Wings were without many of their top players as Dylan Larkin, Patrick Kane and Moritz Seider stayed home.\nThe visitors did not mount much of an attack in the latter two periods. But the Maple Leafs did have to kill off a final Red Wings power play with 8:30 remaining.\nVille Husso was Detroit’s best player, stopping 30 shots.\nToronto goalie Joseph Woll played the entire game. With no explanation from new head coach Craig Berube, Woll played only 31:45 in [...]",
    "source_url": "https://winnipegsun.com/pmn/tavares-matthews-lead-maple-leafs-to-3-2-win-over-red-wings",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Tavares; Matthews; Maple Leafs; Red Wings the Maple Leafs; Nick Robertson; Calle Jarnkrok; Jake McCabe; Red Wings; Dylan Larkin; Patrick Kane; Moritz Seider; But the Maple Leafs; Ville Husso; Detroit; Joseph Woll; Craig Berube; Woll; Anthony Stolarz; Stanley Cup; Florida Panthers; After Jonatan Berggren; Michael Bradsegg; Andrew Copp; William Wallinder; Matthew Knies; Christian Fischer; Ryan Reaves; Brogan Rafferty; Steven Lorentz"
  },
  {
    "date": "2024-10-06T01:18:02Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/0c93/live/766afcb0-8375-11ef-ad45-893aa022fcbc.jpg",
    "title": "Time stood still, Trump says at site of assassination attempt",
    "content": " Nearly three months after an assassin’s bullet nearly took his life, former President Donald Trump came to Butler, Pennsylvania, returning to a place of “tragedy” to promise his supporters victory in the 5 November presidential election.\nOne person - a volunteer fire chief - was killed in the 13 July shooting, which also left two bystanders seriously wounded and Trump shot in the ear.\n“For 15 seconds, time stood still,” Trump told the crowd. “This vicious monster unleashed evil… the villain did not succeed in his goal.”\nFor Saturday s rally, though, security was tight - a result of increased scrutiny of the [...]",
    "source_url": "https://www.bbc.com/news/articles/c70w909znl6o",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Trump; President Donald Trump; Butler; Pennsylvania; For Saturday; Secret Service; JD Vance; Eric Trump; Lara Trump; Elon Musk; US; Corey Competore; Corey; Vance; Teresa Wilson; US Marine; Kamala Harris; New York Times; Harris; Jessenia Anderson; Latinas; Sean Moon; Tennessee; Mexico; Mr Moon; North Korean; North Carolina; Maui; Hurricane Helene; Hawaii"
  },
  {
    "date": "2024-10-06T04:26:05Z",
    "img": "",
    "title": "Mexican immigrant families plagued by grief, questions after plant workers swept away by Helene",
    "content": " But surviving workers say the evacuation began too late. Some clung to pipes on truck flatbeds for up to six hours while making frantic 911 calls and saying goodbyes to loved ones. Some saw coworkers carried off by the current.\nEmergency dispatchers said resources were spread thin as a rescue operation was underway over a mile downriver at Unicoi County Hospital.\nNormally running 2 feet (about 60 centimeters) deep, the Nolichucky River rose to a record 30 feet (9.1 meters) that day, running at more than 1.4 million gallons (5.3 million liters) per second, which is twice as much as Niagara Falls.\nThe [...]",
    "source_url": "https://winnipegsun.com/pmn/mexican-immigrant-families-plagued-by-grief-questions-after-plant-workers-swept-away-by-helene",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Mexican; Helene But; Unicoi County Hospital; Nolichucky River; Niagara Falls; Robert Jarvis; Jarvis; Annabel Andrade; Rosy Reynoso; Connor; Alma Vazquez; Catholic Charities"
  },
  {
    "date": "2024-10-06T01:26:10Z",
    "img": "https://i.cbc.ca/1.7344225.1728176274!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/2176100465.jpg",
    "title": "Unranked Vanderbilt stuns No. 1 Alabama in historic college football upset",
    "content": " Fans of the Vanderbilt Commodores danced onto the field, jumping up and down as they tore down a goal post, carried it out of the stadium and rang out sweet sounds of victory. Their school s historic win over No. 1 Alabama deserved to be celebrated this way.\nVanderbilt Commodores defensive lineman De Marion Thomas and offensive lineman Duncan MacDonald celebrate their team s 40-35 upset victory over the Alabama Crimson Tide on Saturday at FirstBank Stadium in Nashville. (Carly Mackler/Getty Images)\nFans of the Vanderbilt Commodores danced onto the field, jumping up and down as they tore down a goal post, [...]",
    "source_url": "https://www.cbc.ca/sports/football/vanderbilt-upsets-alabama-college-football-1.7344224?cmp=rss",
    "source_name": "CBC News",
    "category": "Sports",
    "keywords": "Unranked Vanderbilt; Alabama; Fans of the Vanderbilt Commodores; Vanderbilt Commodores; De Marion Thomas; Duncan MacDonald; Alabama Crimson Tide; FirstBank Stadium; Nashville; Carly Mackler; Sedrick Alexander; Randon Fontenette; Diego Pavia; Heisman Trophy; Jalen Milroe; Vanderbilt; Southeastern Conference; AP; Clark Lea; DOWN GOES the FIELD GOAL POSTS; Only Jam Miller; TD; AP Top; Georgia; Alexander; Nick Saban; Ryan Williams; Miles Capers; Yilanan Ouattara; Kamrean Johnson; Williams; PAVIA TO JOHNSON FOR the TOUCHDOWN; Games; De Rickey Wright; SEC"
  },
  {
    "date": "2024-10-06T02:08:12Z",
    "img": "",
    "title": "Penalty kick lifts Minnesota United to 1-0 win over struggling Vancouver Whitecaps",
    "content": " Tanitoluwa Oluwaseyi charged into the area in the 20th minute and Takaoka came well off his line to challenge the Loons midfielder, getting a foot on the ball to send it out of play.\nA minute later, Laborda took down Carlos Harvey at the top of the area. Referee Ramy Touchan immediately signalled for penalty.\nAfter an extended discussion, Dotson stepped up to take the kick in the 24th minute. His right-footed shot sailed into the side of the net as Takaoka dove to his left.\nDotson’s fifth goal of the season gave Minnesota a 1-0 lead.\nVancouver appeared to equalize in the 35th [...]",
    "source_url": "https://winnipegsun.com/pmn/penalty-kick-lifts-minnesota-united-to-1-0-win-over-struggling-vancouver-whitecaps",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Minnesota United; Vancouver Whitecaps Tanitoluwa Oluwaseyi; Carlos Harvey; Referee Ramy Touchan; Minnesota; Sam Adekugbe; Miguel Tapias; St; Clair; Whitecaps; Jorge Gonzalez; Ryan Gauld; Sang Bin Jeong; Adekugbe; Ryan Raposo; Brian White; Loic Mesanvi; NOTES The Whitecaps; Fafa Picault; Seattle Sounders; Michael Boxall; Midfielder Stuart Armstrong; MLS"
  },
  {
    "date": "2024-10-06T02:45:06Z",
    "img": "",
    "title": "Roughriders edge Elks 28-24, clinch playoff berth",
    "content": " The Roughriders once again punched back with 55 seconds left in the second, as backup QB Shea Patterson took it in on a two-yard plunge.\nSaskatchewan took the lead on the final play of the first half after a bizarre play where Elks receiver Eugene Lewis almost seemed to launch the ball into the hands of linebacker Adam Auclair for the interception, leading to a 50-yard field goal by Brett Lauther.\nIt was Saskatchewan’s Rolan Milligan Jr.’s turn to get his league-leading eighth pick of the season early in the third quarter, intercepting MBT at the Edmonton 40-yard-line, leading to a 13-yard [...]",
    "source_url": "https://winnipegsun.com/pmn/roughriders-edge-elks-28-24-clinch-playoff-berth",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Roughriders; Elks; QB Shea Patterson; Saskatchewan; Eugene Lewis; Adam Auclair; Brett Lauther; Rolan Milligan Jr; Bethel; Thompson; Lewis; Harris; KeeSean Johnson; TD; Boris Bede; Rider Amari Henderson; NOTES It; Regina; Leake; Darrius Bratton; With Shawn Bane Jr; Jerreth Sterns; Jake Julien; CFL; Thirteen of"
  },
  {
    "date": "2024-10-06T04:16:08Z",
    "img": "",
    "title": "North Korea and China mark their 75th anniversary of ties as outsiders question their relationship",
    "content": " In a message sent to Chinese President Xi Jinping, North Korean leader Kim Jong Un said his government will “steadily strive to consolidate and develop the friendly and cooperative relations” between the two countries, according to North Korea’s official Korean Central News Agency.\nXi, in his message to Kim, said that China is ready to jointly promote “the stable and further advance of the socialist cause in the two countries,” KCNA said.\nSince North Korea and China established diplomatic ties on Oct. 6, 1949, their relationship has often been described as being “as close as lips and teeth.” China, North Korea’s biggest [...]",
    "source_url": "https://winnipegsun.com/pmn/north-korea-and-china-mark-their-75th-anniversary-of-ties-as-outsiders-question-their-relationship",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "North Korea; China; Chinese President Xi Jinping; North Korean; Kim Jong Un; Korean Central News Agency; Xi; Kim; Since North Korea; Korean Peninsula; West; Russia; Europe; Asian; Ukraine; Russian President Vladimir Putin; Cold War; South Korea"
  },
  {
    "date": "2024-10-06T02:25:03Z",
    "img": "https://ichef.bbci.co.uk/news/1024/branded_news/3f4b/live/72edb570-8378-11ef-83dd-fbf1b9732cf0.jpg",
    "title": "Netanyahu says Macron s call for arms embargo is  a disgrace",
    "content": " Israeli Prime Minister Benjamin Netanyahu has criticised French President Emmanuel Macron over his call to halt arms deliveries to Israel for use in Gaza.\nMacron told France Inter radio that \"the priority is that we return to a political solution, that we stop delivering weapons to fight in Gaza\".\nAt a summit in Paris on Saturday, the French president reiterated his concern over the conflict in Gaza continuing despite ceasefire calls, and he also criticised Israel s decision to\nNetanyahu responded: \"Shame on them,\" referring to Macron and other Western leaders who have called for what he described as an arms embargo on [...]",
    "source_url": "https://www.bbc.com/news/articles/cjr3zd4d8y5o",
    "source_name": "bbc.com",
    "category": "World",
    "keywords": "Netanyahu; Macron; Israeli Prime Minister Benjamin Netanyahu; French President Emmanuel Macron; Israel; Gaza; France Inter; Paris; French; Western; France; Lebanon; Iran; As Israel; President Macron; Reuters Macron; Francophonie Summit; Grand Palais; Paris Speaking; US; Prime Minister Netanyahu; Lebanese; Franco; Israelis; Hamas"
  },
  {
    "date": "2024-10-06T01:22:01Z",
    "img": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2024/10/alberta-ndp-politics-100524-gya-3.jpg",
    "title": "‘Shameless’: Nenshi blasts UCP over Green Line flip-flop during NDP town hall, leans into  Nenshi Nightmare",
    "content": " Speaking about the province’s commitment to education spending, Nenshi called Smith a “pinball Premier,” who “goes from crisis to crisis, careening wildly, patching up holes in the wall after the water has already come in.”\nThe provincial opposition leader gave credit to Smith for the recent announcement that the province would invest $8.6 billion in education over the next three years, but raised concerns about whether the Premier knows how the money will be spent. He also criticized Smith for creating massive inflation in the construction industry with the announcement.\nOther issues addressed during the town hall were hospital wait times, overcrowded [...]",
    "source_url": "https://calgaryherald.com/news/local-news/nenshi-to-speak-at-ndp-town-hall-saturday-morning",
    "source_name": "calgaryherald.com",
    "category": "World",
    "keywords": "Shameless; Nenshi; UCP; Green Line; NDP; Nenshi Nightmare Speaking; Smith; Danielle Smith; Alberta NDP"
  },
  {
    "date": "2024-10-06T01:23:03Z",
    "img": "",
    "title": "Pinto nets hat trick to lead Senators past Canadiens 4-2",
    "content": " After a solid first Pinto continued to lead the way for the Senators in the second chipping in with a goal and an assist to give Ottawa a 4-1 lead.\nJust 22 seconds into the period, Amadio tipped in an Artem Zub shot. Four minutes later, Pinto forced a turnover on the Montreal power play and scored on a breakaway, beating Montembeault with a backhand.\nThe Senators took a 2-1 lead in the first period after Pinto scored a pair of goals.\nPinto opened the scoring just 44 seconds into the game when he picked up a Noah Gregor rebound.\nOttawa, with a two-man [...]",
    "source_url": "https://winnipegsun.com/pmn/pinto-nets-hat-trick-to-lead-senators-past-canadiens-4-2",
    "source_name": "winnipegsun",
    "category": "Top Stories",
    "keywords": "Pinto; Senators; Canadiens; Artem Zub; Montembeault; Noah Gregor; Jake Sanderson; NOTES Ottawa; Claude Giroux; Tim Stutzle; Brady Tkachuk; David Perron; Nick Suzuki; Juraj Slafkovsky; Cole Caufield; Kirby Dach"
  }
]
